[{"charityLegalName": "Hospice of the Valleys (Hosbis y Cymoedd)", "imageURL": "https://www.charitychoice.co.uk/media/profile/h/hospice-of-the-valleys-hosbis-y-cymoedd-4189/Hospice%20of%20the%20Valleys%20logo.jpg", "charityWebsite": "http://www.hospiceofthevalleys.org.uk", "smallDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer...", "longDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer. Our team of specialist Nurses, Social Workers, Welfare Rights Officers and Therapists are able to help patients and their families deal with the challenges such a diagnosis brings. Our service is free and available 24hrs a day all year for the people of Blaenau Gwent.", "addressLine1": "Festival Drive", "state": "Blaenau Gwent", "country": "UK", "postcode": "NP238XF", "telephone": "+441495717277", "fax": "+441495724188", "charityNumber": "517724", "facebook": "", "twitter": ""}, {"charityLegalName": "Partially Sighted Society", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/partially-sighted-society-1520/partially-sighted-society.jpg", "charityWebsite": "https://www.partsight.org.uk/", "smallDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight...", "longDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight. The Partially Sighted Society has been in existence for over 50 years. Our aim is to help people with sight loss make the best use of their remaining vision. From our professionally equipped sight centre in Doncaster we provide a range of services to support anybody living with sight loss. These include: - Free Low Vision Assessments. Our professional low vision assessment has access to the latest aids and equipment to help you continue to live life independently. - Sight tests. We are a registered NHS Sight Test Centre and anyone can book an appointment with our part time Optometrist, who is as passionate about low vision as we are. We do not dispense spectacles, however, if new glasses are prescribed you can then take this to an optician of your choice. Our sight test clinic is ideal for those with learning disabilities or dementia. Our waiting area is never busy and we have supportive, caring staff. - Pss Print. Our print room offers a unique range of bold-lined stationery, exercise books, diaries and calendars. Andre, our print room manager, understands the challenges of visual impairment and is on hand to advise. We also offer a bespoke print service and free Visual Impairment Assessment Packs with samples of all our printed material. - Information and Support groups. Come and meet new people and learn new things at our variety of support and activity groups.", "addressLine1": "1 Bennetthorpe", "state": "South Yorkshire", "country": "UK", "postcode": "DN26AA", "telephone": "+441302965195", "fax": "+441302556587", "charityNumber": "254052", "facebook": "", "twitter": ""}, {"charityLegalName": "Cinnamon Trust - Helping Elderly and Terminally ill People and their Pets", "imageURL": "https://www.charitychoice.co.uk/media/profile/c/cinnamon-trust-helping-elderly-people-and-pets-1075/cinnamontrust.jpg", "charityWebsite": "http://www.cinnamon.org.uk", "smallDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty...", "longDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty. We step in to ensure that any problem encountered in the day to day care of a pet can be overcome and all the benefits of owning a pet can be preserved. Our aims are achieved by tasking a national network of over 6,000 volunteers to provide any assistance required including walking dogs and pet fostering. We operate a national register of 752 care homes/sheltered housing for the elderly that will accept pets. A principal concern for elderly and terminally ill pet owners is the long term care of beloved pets. We provide lifetime care for pets whose owners have died either in our unique home from home sanctuaries or in long term foster homes. We rely entirely on donations and legacies. We make no charge for our services. Peace of mind and practical help for people - love, care and safety for their pets.", "addressLine1": "10 Market Square", "state": "Cornwall", "country": "UK", "postcode": "TR274HE", "telephone": "+441736757900", "fax": "+441736757010", "charityNumber": "1134680", "facebook": "", "twitter": ""}, {"charityLegalName": "Wythall Animal Sanctuary", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/wythall-animal-sanctuary-1258/top.jpg", "charityWebsite": "https://wythallanimalrescue.org/", "smallDescription": "Wythall Animal Sanctuary was founded by Mr...", "longDescription": "Wythall Animal Sanctuary was founded by Mr. & Mrs. E. Davies in 1968, whose aim was to save and find homes for as many unwanted pets as possible. Many thousands have been found new homes since then. Many of these animals may otherwise have been destroyed. We have a non-destruction policy and we are the last hope for these animals. As our name signifies we give them Sanctuary. We take in, when possible, animals for rehoming and some of these animals will not be fit for rehoming and will live the rest of their lives with us. We pick up all the bills, including veterinary bills, for our residents both long-term and animals for rehoming. It costs £4,000 a week to keep the Sanctuary running and we rely entirely on donations, fundraising and Wills to continue our work. Other ways you can help are by Sponsoring an Animal, Leave a gift in your Will or by becoming a 'Friend' of Wythall Animal Sanctuary.", "addressLine1": "Middle Lane Kings Norton", "state": "West Midlands", "country": "UK", "postcode": "B380DU", "telephone": "+441564823288", "fax": "", "charityNumber": "1137681", "facebook": "", "twitter": ""}, {"charityLegalName": "St Kentigern Hospice and Palliative Care Centre, St Asaph, Denbighshire", "imageURL": "https://www.charitychoice.co.uk/media/profile/s/st-kentigern-hospice-and-palliative-care-centre-st-asaph-denbighshire-4300/St%20Kentigern%20logo.jpg", "charityWebsite": "http://www.stkentigernhospice.org.uk", "smallDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day...", "longDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day. We provide a relaxed, homely and informal environment for people with a diagnosis of cancer. Other services include physiotherapy, aromatherapy, reflexology, chiropody, and much more. We make no charge to our patients or their carers. Any donations received would be greatly appreciated.", "addressLine1": "St Kentigern Hospice Upper Denbigh Road", "state": "Denbighshire", "country": "UK", "postcode": "LL170RS", "telephone": "+441745585221", "fax": "+441745585224", "charityNumber": "519931", "facebook": "", "twitter": ""}, {"charityLegalName": "Psoriasis and Psoriatic Arthritis Alliance (PAPAA)", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/psoriasis-and-psoriatic-arthritis-alliance-papaa-17015/top_wiki.jpg", "charityWebsite": "http://www.papaa.org", "smallDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis...", "longDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis.", "addressLine1": "Unit 3 Horseshoe Business Park Lye Lane Bricket Wood", "state": "Hertfordshire", "country": "UK", "postcode": "AL23TA", "telephone": "+441923672837", "fax": "+441923682606", "charityNumber": "1118192", "facebook": "", "twitter": ""}, {"charityLegalName": "Walsall Society for the Blind", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/walsallsocietyfortheblind/Walsall-logo.jpg", "charityWebsite": "http://www.walsallblind.org", "smallDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall...", "longDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall. Walsall Society for the Blind has been a flagship for sight loss services in the Walsall Borough for over 100 years. We currently have over 1500 visually impaired individuals on our database who have already made use of our services. With a total of 22 staff, we provide a seamless package of sight loss services across the Borough. From the early intervention of the Eye Clinic Liaison Officer (ECLO) to the Community Services, we can help anyone experiencing a sight loss, whether it is temporary or permanent, newly diagnosed or long standing. We also provide information and support to their families, carers and friends. At WSB we understand how devastating sight loss can be, and we realise the consequences of living with it can be dramatic. We aim to do our best by our service users, by making our services known from the first possible point, and carrying our support and guidance through for as long as the individual needs it.", "addressLine1": "Hawley House 11 Hatherton Road", "state": "West Midlands", "country": "UK", "postcode": "WS11XS", "telephone": "+441922627683", "fax": "", "charityNumber": "1075854", "facebook": "http://www.facebook.com/pages/Walsall-Society-for-the-Blind/213993005340708", "twitter": ""}, {"charityLegalName": "Oak Tree Animals' Charity", "imageURL": "https://www.charitychoice.co.uk/media/profile/o/oaktreeanimalscharity/OTAC-logoOrange-small.jpg", "charityWebsite": "https://www.oaktreeanimals.org.uk/", "smallDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle...", "longDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle. It\u0092s also a safe haven for stray, abandoned or unwanted dogs and cats who are awaiting new homes through our Adoption Programme. Every year Oak Tree takes in hundreds of lost or unwanted animals and gives them a second chance. We rehabilitate the animals, but we also prepare potential owners for life with a new companion and offer the help and support necessary for both animal and owner to live a long and happy life together. Our work in the community means that loving pet owners can find the information and resources they need to keep their animals happy, healthy and in good homes. We also support unowned animals such as feral cats through our Trap Neuter Return (TNR) programme. We use educational campaigns to raise awareness and change perceptions, hoping to provide a brighter future for animals in all walks of society. Our team speaks to schools, community groups and colleges about animal welfare and offers advice on working with animals in the future, investing in our younger generations and providing them with the knowledge they need to help animals in the long term.", "addressLine1": "Oak Tree Farm Wetheral Shields", "state": "Cumbria", "country": "UK", "postcode": "CA48JA", "telephone": "+441228560082", "fax": "+441228560985", "charityNumber": "1001169511", "facebook": "https://www.facebook.com/oaktreeanimals", "twitter": ""}, {"charityLegalName": "Priscilla Bacon Lodge Palliative Care Unit", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Colman Hospital Unthank Road", "state": "Norfolk", "country": "UK", "postcode": "NR22PJ", "telephone": "+441603288981ext.4981", "fax": "+441603288988", "charityNumber": "278667", "facebook": "", "twitter": ""}, {"charityLegalName": "Glamis Hall For All", "imageURL": "", "charityWebsite": "http://www.glamishall.org.uk", "smallDescription": "Who Are We? We are a group of friends who came together in 2014 to save Glamis Hall from closure...", "longDescription": "Who Are We? We are a group of friends who came together in 2014 to save Glamis Hall from closure. We became a registered charity (No. 1160317) in early 2015 to help us provide services at Glamis Hall for the community. What is Glamis Hall? Glamis Hall is a community centre on the Queensway Estate in Wellingborough, Northamptonshire. It consists of a wellbeing centre for elderly people, a large sports hall with kitchen and servery, community room and football changing rooms. Our Mission To provide a Community Hub for the residents of the Borough of Wellingborough and the surrounding areas.", "addressLine1": "Glamis Hall Day Centre Goldsmith Road Wellingborough", "state": "", "country": "UK", "postcode": "NN83RU", "telephone": "+441933677326", "fax": "", "charityNumber": "1160317", "facebook": "https://www.facebook.com/GlamisHall/", "twitter": ""}, {"charityLegalName": "Care 4 All (north East Lincolnshire) Ltd", "imageURL": "", "charityWebsite": "http://www.care4all.org.uk", "smallDescription": "Care4all are a local charity providing services for older people and people with disabilities within North East Lincolnshire...", "longDescription": "Care4all are a local charity providing services for older people and people with disabilities within North East Lincolnshire. Our day opportunities are provided from four health and wellbeing centres throughout Immingham, Grimsby and Cleethorpes. Older People\u0092s Day Services offer a wide range of activities and social events to promote independence, encourage involvement and social interaction, and reduce isolation. The aim is to support people to live their chosen lifestyle in their own homes for as long as possible and also, if appropriate, provide respite for carers. We also operate a Meals Plus service in which hot nutritious meals are delivered to people\u0092s homes. The service is much more than just a delivery service as our drivers are aware that they may be a person\u0092s only visitor that day and an element of care is included. This can range from helping with the meal to monitoring and reporting food and fluid intake, medication prompts and social interaction. Disability Services provide a range of activities and opportunities within both centre and local community based settings to support adults with learning and/or physical disabilities to enjoy meaningful, purposeful lives of their choice. Another service provide by Care4all is Personal Assistant Support Solutions (PASS), this is a matching service for adults with physical or learning disabilities, mental health problems or long term illness who are seeking to employ a personal assistant to support them to live independently and lead the best quality of life possible. Care4all operate a number of enterprises including a garden centre, a chain of cafes, charity shop, textile banks and specially adapted holiday chalet. Each of these unique enterprises provides real employment opportunities to local people with disabilities in a range of different roles, including horticulture and gardening, retail, catering and administration. The jobs they create improve lives through helping to enhance people\u0092s self-esteem and confidence by being included in society. All profits made are reinvested back into the organisation to develop the business further.", "addressLine1": "Queen Street Resource Centre Queen Street Grimsby North East Lincolnshire", "state": "", "country": "UK", "postcode": "DN311QG", "telephone": "+441472571100", "fax": "", "charityNumber": "41146255", "facebook": "https://www.facebook.com/Care4allNEL", "twitter": ""}, {"charityLegalName": "Avon Sport And Leisure Club For The Visually Impaired", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "7 Hamilton Road Southville", "state": "", "country": "UK", "postcode": "BS31PA", "telephone": "+441179837915", "fax": "", "charityNumber": "278199", "facebook": "", "twitter": ""}, {"charityLegalName": "Faith In Action International Rally", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "40 Pennington Way London", "state": "", "country": "UK", "postcode": "SE129QB", "telephone": "+447588681256", "fax": "", "charityNumber": "1147063", "facebook": "", "twitter": ""}, {"charityLegalName": "Church Without Walls (truth Ministries)", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "42 Plumbridge Street London", "state": "", "country": "UK", "postcode": "SE108PA", "telephone": "+442086915614", "fax": "", "charityNumber": "1144410", "facebook": "", "twitter": ""}, {"charityLegalName": "Scarth Memorial Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "5 South Cleatlam Darlington", "state": "", "country": "UK", "postcode": "DL23QP", "telephone": "+441833660802", "fax": "", "charityNumber": "520586", "facebook": "", "twitter": ""}, {"charityLegalName": "The Bouncing Ball Trust", "imageURL": "", "charityWebsite": "http://www.bouncingballtrust.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Admiral's Yard Station Road", "state": "", "country": "UK", "postcode": "BS346LR", "telephone": "+443301200720", "fax": "", "charityNumber": "1170946", "facebook": "", "twitter": ""}, {"charityLegalName": "Sesaw (suffolk And Essex Small Animal Welfare)", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Idano Stoke Road Leavenheath Colchester", "state": "", "country": "UK", "postcode": "CO64PP", "telephone": "+441787210888", "fax": "", "charityNumber": "1124029", "facebook": "", "twitter": ""}, {"charityLegalName": "The Burton Blind And Partially Sighted Club", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "33 The Green Barton Under Needwood Burton-on-Trent Staffordshire", "state": "", "country": "UK", "postcode": "DE138JD", "telephone": "", "fax": "", "charityNumber": "1040914", "facebook": "", "twitter": ""}, {"charityLegalName": "Victoria Hall Performing Arts Association", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Treasurer Victoria Theatre 106 Wedgewood Drive Harlow", "state": "", "country": "UK", "postcode": "CM179PY", "telephone": "+447834324802", "fax": "", "charityNumber": "1051379", "facebook": "", "twitter": ""}, {"charityLegalName": "Lyng & District Community Hall", "imageURL": "", "charityWebsite": "http://www.lynghallforall.uk", "smallDescription": "Lyng Hall is in need of support and funding to rebuild this essential central hub of our community...", "longDescription": "Lyng Hall is in need of support and funding to rebuild this essential central hub of our community. Our hall is more than 60 years old. The facilities it offers are in bad condition, out of date and inadequate. We need to take action NOW to avoid it's enforced closure. The demand for a new hall is high. Many elderly live in our rural village and without a Bus Service they have to rely on lifts and taxis which can be expensive. Many people are isolated with their own transport and we aim to offer elderly and families services that combat this, along with exercise programs to help keep people fit, and clubs and groups for the young people to keep them entertained.", "addressLine1": "Richmond Place Lyng Norwich Norfolk", "state": "", "country": "UK", "postcode": "NR95RF", "telephone": "+441603872238", "fax": "", "charityNumber": "1156339", "facebook": "www.facebook.com/lyngdistrictcommunityhall", "twitter": ""}, {"charityLegalName": "Cambridge Crystallographic Data Centre", "imageURL": "", "charityWebsite": "", "smallDescription": "Cambridge Crystallographic Data Centre supports the science of chemistry and crystallography in all its branches by helping researchers and research programmes...", "longDescription": "Cambridge Crystallographic Data Centre supports the science of chemistry and crystallography in all its branches by helping researchers and research programmes.", "addressLine1": "12 Union Road", "state": "Cambridgeshire", "country": "UK", "postcode": "CB21EZ", "telephone": "+441223336408", "fax": "", "charityNumber": "800579", "facebook": "", "twitter": ""}, {"charityLegalName": "Warslow Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "", "state": "", "country": "UK", "postcode": "", "telephone": "", "fax": "", "charityNumber": "216771", "facebook": "", "twitter": ""}, {"charityLegalName": "1st Allerton Boy Scout Group", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "218 Brodie Avenue Liverpool", "state": "", "country": "UK", "postcode": "L197NG", "telephone": "+441514942663", "fax": "", "charityNumber": "1521582", "facebook": "", "twitter": ""}, {"charityLegalName": "Born To Shine Challenge Ltd", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Bethel House Lansdowne Place London", "state": "", "country": "UK", "postcode": "SE14XH", "telephone": "+442074079996", "fax": "", "charityNumber": "1142350", "facebook": "", "twitter": ""}, {"charityLegalName": "Success For All Foundation", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Studio 8 Stuart House St Johns Street", "state": "Cambridgeshire", "country": "UK", "postcode": "PE15DD", "telephone": "+441733490222", "fax": "", "charityNumber": "1077079", "facebook": "", "twitter": ""}, {"charityLegalName": "The Queen's Hall", "imageURL": "", "charityWebsite": "http://www.thequeenshall.net", "smallDescription": "", "longDescription": "", "addressLine1": "Clerk Street", "state": "", "country": "UK", "postcode": "EH89JG", "telephone": "+441316683456", "fax": "+441316682656", "charityNumber": "012294", "facebook": "", "twitter": ""}, {"charityLegalName": "Hallam Diocesan Caring Services (Hallam Diocese)", "imageURL": "", "charityWebsite": "", "smallDescription": "Hallam Diocese works to promote the Roman Catholic religion in the local area...", "longDescription": "Hallam Diocese works to promote the Roman Catholic religion in the local area.", "addressLine1": "St Wilfrid's Centre 524 Queens Road", "state": "South Yorkshire", "country": "UK", "postcode": "S24DT", "telephone": "+441142580000", "fax": "+441142580000", "charityNumber": "512021", "facebook": "", "twitter": ""}, {"charityLegalName": "Water Fall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Green Pastures 11 Blackthorn Lane Leicester", "state": "", "country": "UK", "postcode": "LE24FA", "telephone": "+441162985518", "fax": "", "charityNumber": "1140634", "facebook": "", "twitter": ""}, {"charityLegalName": "Faith In Action International Rally", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "40 Pennington Way London", "state": "", "country": "UK", "postcode": "SE129QB", "telephone": "+447588681256", "fax": "", "charityNumber": "1147063", "facebook": "", "twitter": ""}, {"charityLegalName": "Tech4All", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "70 Bedford Gardens", "state": "", "country": "UK", "postcode": "W87EH", "telephone": "+442078881328", "fax": "", "charityNumber": "41054041", "facebook": "", "twitter": ""}, {"charityLegalName": "The Sowton Village Hall", "imageURL": "", "charityWebsite": "http://www.sowtonvillage.com", "smallDescription": "Fund raising for the maintenance and improvement of Sowton Village Hall...", "longDescription": "Fund raising for the maintenance and improvement of Sowton Village Hall. Organising social events in the hall. Letting out the hall to individuals or groups. Acting as a focus for the residents in the area of benefit", "addressLine1": "Willow Cottage 14 Sowton Village Sowton", "state": "Devon", "country": "UK", "postcode": "EX52AD", "telephone": "+441392367956", "fax": "", "charityNumber": "300975", "facebook": "", "twitter": ""}, {"charityLegalName": "Bungoma Calling", "imageURL": "", "charityWebsite": "http://www.bungomacalling.co.uk", "smallDescription": "Bungoma Calling is a UK charity working with Christian churches in Bungoma, Western Kenya...", "longDescription": "Bungoma Calling is a UK charity working with Christian churches in Bungoma, Western Kenya. It is also linked with the St Dorcas Orphanage where in 2015 thirty (30) children of 5 years old and upwards live. They all go to school and the charity is trying to ensure they all have a quality education up to and including secondary school by a sponsorship programme to pay their school fees. Several primary schools in the York area are linked with schools in Bungoma. Each year a team go out to visit and work with the orphanage, the link schools and the churches.", "addressLine1": "Orchard House Ingleby Arncliffe", "state": "North Yorkshire", "country": "UK", "postcode": "DL63LN", "telephone": "+441609882937", "fax": "", "charityNumber": "1137121", "facebook": "https://www.facebook.com/pages/Bungoma-Calling/268280119905085", "twitter": ""}, {"charityLegalName": "BEN - The Automotive Industry Charity", "imageURL": "", "charityWebsite": "http://ben.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Lynwood Court Lynwood Village Rise Road", "state": "Windsor & Maidenhead", "country": "UK", "postcode": "SL50FG", "telephone": "+441344298100", "fax": "+441344298109", "charityNumber": "297877039842", "facebook": "", "twitter": ""}, {"charityLegalName": "Wallasey Islamic Cultural Centre", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "22 Brook Close", "state": "Merseyside", "country": "UK", "postcode": "CH441DU", "telephone": "+441512010357", "fax": "", "charityNumber": "1144643", "facebook": "", "twitter": ""}, {"charityLegalName": "PCC of All Saints Onslow Village Guildford", "imageURL": "", "charityWebsite": "http://www.allsaintschurchgfd.org.uk/welcome.htm", "smallDescription": "ALL SAINTS' CHURCH We are a friendly, open and welcoming church, meeting in the centre of the community...", "longDescription": "ALL SAINTS' CHURCH We are a friendly, open and welcoming church, meeting in the centre of the community. Whether you are looking to join the church family on a regular basis, or are enquiring about becoming part of the church for a special event, such as a wedding or a baptism, just contact us via the website or telephone, or turn up for a service. Each week, children and adults of all ages gather for worship at three different times on a Sunday and on weekdays. Newcomers are always welcome and we hope that you will find a spiritual home here - all are truly welcome. At the moment we are fundraising with two of our congregation abseiling from Guildford Cathedral Tower on 21st June. Please donate generously via our church website page, or by using the 'donate now' button on this page. Thank you for your support.", "addressLine1": "53 Agraria Road", "state": "Surrey", "country": "UK", "postcode": "GU24LF", "telephone": "+441483822982", "fax": "", "charityNumber": "72292", "facebook": "https://www.facebook.com/allsaintschurchgfd", "twitter": ""}, {"charityLegalName": "Dysfunction Gallery", "imageURL": "", "charityWebsite": "http://www.dysfunction.eu/home/4589015301", "smallDescription": "", "longDescription": "", "addressLine1": "10 Todshill Street Strathaven South Lanarkshire", "state": "", "country": "UK", "postcode": "ML106DD", "telephone": "+441357238943", "fax": "", "charityNumber": "046829", "facebook": "", "twitter": ""}, {"charityLegalName": "The Totally Different Playscheme", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "79 Harford Drive", "state": "Hertfordshire", "country": "UK", "postcode": "WD173DQ", "telephone": "+441923244196", "fax": "", "charityNumber": "1110386", "facebook": "", "twitter": ""}, {"charityLegalName": "National Gallery", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "National Gallery Trafalgar Square", "state": "", "country": "UK", "postcode": "WC2N5DN", "telephone": "+442077475875", "fax": "+442077475878", "charityNumber": "", "facebook": "", "twitter": ""}, {"charityLegalName": "Cornwall Community Accountancy Service", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "8 Greenacres Nanstallon Bodmin Cornwall", "state": "", "country": "UK", "postcode": "PL305LZ", "telephone": "+447867524663", "fax": "", "charityNumber": "1147929", "facebook": "", "twitter": ""}, {"charityLegalName": "Active4All", "imageURL": "", "charityWebsite": "http://www.active4all.info", "smallDescription": "", "longDescription": "", "addressLine1": "10 Holmwood Avenue Uddingston", "state": "", "country": "UK", "postcode": "G717AJ", "telephone": "+441698815400", "fax": "+441698580482", "charityNumber": "4036591", "facebook": "", "twitter": ""}]