{"charityLegalName": "Wythall Animal Sanctuary", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/wythall-animal-sanctuary-1258/top.jpg", "charityWebsite": "https://wythallanimalrescue.org/", "smallDescription": "Wythall Animal Sanctuary was founded by Mr...", "longDescription": "Wythall Animal Sanctuary was founded by Mr. & Mrs. E. Davies in 1968, whose aim was to save and find homes for as many unwanted pets as possible. Many thousands have been found new homes since then. Many of these animals may otherwise have been destroyed. We have a non-destruction policy and we are the last hope for these animals. As our name signifies we give them Sanctuary. We take in, when possible, animals for rehoming and some of these animals will not be fit for rehoming and will live the rest of their lives with us. We pick up all the bills, including veterinary bills, for our residents both long-term and animals for rehoming. It costs £4,000 a week to keep the Sanctuary running and we rely entirely on donations, fundraising and Wills to continue our work. Other ways you can help are by Sponsoring an Animal, Leave a gift in your Will or by becoming a 'Friend' of Wythall Animal Sanctuary.", "addressLine1": "Middle Lane Kings Norton", "state": "West Midlands", "country": "UK", "postcode": "B380DU", "telephone": "+441564823288", "fax": "", "charityNumber": "1137681", "facebook": "", "twitter": ""}{"charityLegalName": "St Kentigern Hospice and Palliative Care Centre, St Asaph, Denbighshire", "imageURL": "https://www.charitychoice.co.uk/media/profile/s/st-kentigern-hospice-and-palliative-care-centre-st-asaph-denbighshire-4300/St%20Kentigern%20logo.jpg", "charityWebsite": "http://www.stkentigernhospice.org.uk", "smallDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day...", "longDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day. We provide a relaxed, homely and informal environment for people with a diagnosis of cancer. Other services include physiotherapy, aromatherapy, reflexology, chiropody, and much more. We make no charge to our patients or their carers. Any donations received would be greatly appreciated.", "addressLine1": "St Kentigern Hospice Upper Denbigh Road", "state": "Denbighshire", "country": "UK", "postcode": "LL170RS", "telephone": "+441745585221", "fax": "+441745585224", "charityNumber": "519931", "facebook": "", "twitter": ""}{"charityLegalName": "Hospice of the Valleys (Hosbis y Cymoedd)", "imageURL": "https://www.charitychoice.co.uk/media/profile/h/hospice-of-the-valleys-hosbis-y-cymoedd-4189/Hospice%20of%20the%20Valleys%20logo.jpg", "charityWebsite": "http://www.hospiceofthevalleys.org.uk", "smallDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer...", "longDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer. Our team of specialist Nurses, Social Workers, Welfare Rights Officers and Therapists are able to help patients and their families deal with the challenges such a diagnosis brings. Our service is free and available 24hrs a day all year for the people of Blaenau Gwent.", "addressLine1": "Festival Drive", "state": "Blaenau Gwent", "country": "UK", "postcode": "NP238XF", "telephone": "+441495717277", "fax": "+441495724188", "charityNumber": "517724", "facebook": "", "twitter": ""}{"charityLegalName": "Cinnamon Trust - Helping Elderly and Terminally ill People and their Pets", "imageURL": "https://www.charitychoice.co.uk/media/profile/c/cinnamon-trust-helping-elderly-people-and-pets-1075/cinnamontrust.jpg", "charityWebsite": "http://www.cinnamon.org.uk", "smallDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty...", "longDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty. We step in to ensure that any problem encountered in the day to day care of a pet can be overcome and all the benefits of owning a pet can be preserved. Our aims are achieved by tasking a national network of over 6,000 volunteers to provide any assistance required including walking dogs and pet fostering. We operate a national register of 752 care homes/sheltered housing for the elderly that will accept pets. A principal concern for elderly and terminally ill pet owners is the long term care of beloved pets. We provide lifetime care for pets whose owners have died either in our unique home from home sanctuaries or in long term foster homes. We rely entirely on donations and legacies. We make no charge for our services. Peace of mind and practical help for people - love, care and safety for their pets.", "addressLine1": "10 Market Square", "state": "Cornwall", "country": "UK", "postcode": "TR274HE", "telephone": "+441736757900", "fax": "+441736757010", "charityNumber": "1134680", "facebook": "", "twitter": ""}{"charityLegalName": "Partially Sighted Society", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/partially-sighted-society-1520/partially-sighted-society.jpg", "charityWebsite": "https://www.partsight.org.uk/", "smallDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight...", "longDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight. The Partially Sighted Society has been in existence for over 50 years. Our aim is to help people with sight loss make the best use of their remaining vision. From our professionally equipped sight centre in Doncaster we provide a range of services to support anybody living with sight loss. These include: - Free Low Vision Assessments. Our professional low vision assessment has access to the latest aids and equipment to help you continue to live life independently. - Sight tests. We are a registered NHS Sight Test Centre and anyone can book an appointment with our part time Optometrist, who is as passionate about low vision as we are. We do not dispense spectacles, however, if new glasses are prescribed you can then take this to an optician of your choice. Our sight test clinic is ideal for those with learning disabilities or dementia. Our waiting area is never busy and we have supportive, caring staff. - Pss Print. Our print room offers a unique range of bold-lined stationery, exercise books, diaries and calendars. Andre, our print room manager, understands the challenges of visual impairment and is on hand to advise. We also offer a bespoke print service and free Visual Impairment Assessment Packs with samples of all our printed material. - Information and Support groups. Come and meet new people and learn new things at our variety of support and activity groups.", "addressLine1": "1 Bennetthorpe", "state": "South Yorkshire", "country": "UK", "postcode": "DN26AA", "telephone": "+441302965195", "fax": "+441302556587", "charityNumber": "254052", "facebook": "", "twitter": ""}{"charityLegalName": "Psoriasis and Psoriatic Arthritis Alliance (PAPAA)", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/psoriasis-and-psoriatic-arthritis-alliance-papaa-17015/top_wiki.jpg", "charityWebsite": "http://www.papaa.org", "smallDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis...", "longDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis.", "addressLine1": "Unit 3 Horseshoe Business Park Lye Lane Bricket Wood", "state": "Hertfordshire", "country": "UK", "postcode": "AL23TA", "telephone": "+441923672837", "fax": "+441923682606", "charityNumber": "1118192", "facebook": "", "twitter": ""}{"charityLegalName": "Oak Tree Animals' Charity", "imageURL": "https://www.charitychoice.co.uk/media/profile/o/oaktreeanimalscharity/OTAC-logoOrange-small.jpg", "charityWebsite": "https://www.oaktreeanimals.org.uk/", "smallDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle...", "longDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle. Its also a safe haven for stray, abandoned or unwanted dogs and cats who are awaiting new homes through our Adoption Programme. Every year Oak Tree takes in hundreds of lost or unwanted animals and gives them a second chance. We rehabilitate the animals, but we also prepare potential owners for life with a new companion and offer the help and support necessary for both animal and owner to live a long and happy life together. Our work in the community means that loving pet owners can find the information and resources they need to keep their animals happy, healthy and in good homes. We also support unowned animals such as feral cats through our Trap Neuter Return (TNR) programme. We use educational campaigns to raise awareness and change perceptions, hoping to provide a brighter future for animals in all walks of society. Our team speaks to schools, community groups and colleges about animal welfare and offers advice on working with animals in the future, investing in our younger generations and providing them with the knowledge they need to help animals in the long term.", "addressLine1": "Oak Tree Farm Wetheral Shields", "state": "Cumbria", "country": "UK", "postcode": "CA48JA", "telephone": "+441228560082", "fax": "+441228560985", "charityNumber": "1001169511", "facebook": "https://www.facebook.com/oaktreeanimals", "twitter": ""}{"charityLegalName": "Walsall Society for the Blind", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/walsallsocietyfortheblind/Walsall-logo.jpg", "charityWebsite": "http://www.walsallblind.org", "smallDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall...", "longDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall. Walsall Society for the Blind has been a flagship for sight loss services in the Walsall Borough for over 100 years. We currently have over 1500 visually impaired individuals on our database who have already made use of our services. With a total of 22 staff, we provide a seamless package of sight loss services across the Borough. From the early intervention of the Eye Clinic Liaison Officer (ECLO) to the Community Services, we can help anyone experiencing a sight loss, whether it is temporary or permanent, newly diagnosed or long standing. We also provide information and support to their families, carers and friends. At WSB we understand how devastating sight loss can be, and we realise the consequences of living with it can be dramatic. We aim to do our best by our service users, by making our services known from the first possible point, and carrying our support and guidance through for as long as the individual needs it.", "addressLine1": "Hawley House 11 Hatherton Road", "state": "West Midlands", "country": "UK", "postcode": "WS11XS", "telephone": "+441922627683", "fax": "", "charityNumber": "1075854", "facebook": "http://www.facebook.com/pages/Walsall-Society-for-the-Blind/213993005340708", "twitter": ""}{"charityLegalName": "North Ferriby Village Hall Trust", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "7 Greenways North Ferriby", "state": "", "country": "UK", "postcode": "HU143JN", "telephone": "+441482633848", "fax": "", "charityNumber": "223908", "facebook": "", "twitter": ""}{"charityLegalName": "The Totally Different Playscheme", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "79 Harford Drive", "state": "Hertfordshire", "country": "UK", "postcode": "WD173DQ", "telephone": "+441923244196", "fax": "", "charityNumber": "1110386", "facebook": "", "twitter": ""}{"charityLegalName": "Alliance for Inclusive Education", "imageURL": "", "charityWebsite": "http://www.allfie.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "336 Brixton Road Brixton", "state": "", "country": "UK", "postcode": "SW97AA", "telephone": "+442077376030", "fax": "", "charityNumber": "1124424", "facebook": "", "twitter": ""}{"charityLegalName": "Diddlebury Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Milford Farm House Bache Mill Diddlebury Craven Arms Shropshire", "state": "", "country": "UK", "postcode": "SY79JX", "telephone": "+441584841265", "fax": "", "charityNumber": "522511", "facebook": "", "twitter": ""}{"charityLegalName": "Over The Wall", "imageURL": "", "charityWebsite": "http://www.otw.org.uk", "smallDescription": "Over The Wall provide free life-changing activity camps to children aged 8-17 affected by serious and life-limiting illnesses in the UK...", "longDescription": "Over The Wall provide free life-changing activity camps to children aged 8-17 affected by serious and life-limiting illnesses in the UK. We also provide camps for siblings aged 8-17 and family groups. Through our life-changing camps children build confidence, self-esteem and resilience; they also find fun, friendship and laughter and there is growing academic evidence that the experiences we provide are beneficial and complimentary to on-going treatment.", "addressLine1": "Langstone Technology Park Langstone Road", "state": "Hampshire", "country": "UK", "postcode": "PO91SA", "telephone": "+442392477110", "fax": "", "charityNumber": "1075361", "facebook": "http://en-gb.facebook.com/overthewallcamp", "twitter": ""}{"charityLegalName": "Ambassadors Football", "imageURL": "", "charityWebsite": "http://gb.ambassadorsfootball.org/", "smallDescription": "", "longDescription": "", "addressLine1": "Claremont House St Georges Road", "state": "Greater Manchester", "country": "UK", "postcode": "BL12BY", "telephone": "+441204363606", "fax": "", "charityNumber": "1055422", "facebook": "", "twitter": ""}{"charityLegalName": "Stonehaven Town Hall Trust", "imageURL": "", "charityWebsite": "http://www.stonehaventownhall.org", "smallDescription": "The town hall trust has been formed to ensure the public get their town hall back and it continues to be at the heart of your communityThe Town Hall was built in 1876 with £4,000 raised by public subscription...", "longDescription": "The town hall trust has been formed to ensure the public get their town hall back and it continues to be at the heart of your communityThe Town Hall was built in 1876 with £4,000 raised by public subscription. The 1902 Stonehaven Town Hall Confirmation Act vested the running of the Hall to the Town Council, this was repealed by parliament in 1986, and the Hall then became the responsibility of the Aberdeenshire Council. Established in 2010, the Stonehaven Town Hall Trust is now working with Aberdeenshire Council towards bringing the building back into community ownership", "addressLine1": "6 Kings Road", "state": "Aberdeenshire", "country": "UK", "postcode": "AB392HB", "telephone": "", "fax": "", "charityNumber": "041958", "facebook": "http://www.facebook.com/stonehaventownhall", "twitter": ""}{"charityLegalName": "Galloway Wildlife Conservation Trust", "imageURL": "", "charityWebsite": "http://gallowaywildlife.co.uk/contactus.php", "smallDescription": "", "longDescription": "", "addressLine1": "Lochfergus Plantation Kirkcudbright", "state": "Dumfries & Galloway", "country": "UK", "postcode": "DG64XX", "telephone": "+441557331645", "fax": "", "charityNumber": "042826", "facebook": "", "twitter": ""}{"charityLegalName": "Dibden Allotments Fund", "imageURL": "", "charityWebsite": "", "smallDescription": "Dibden Allotments Fund supports people in the Parish of Hythe and Dibden who are in conditions of need, hardship or distress...", "longDescription": "Dibden Allotments Fund supports people in the Parish of Hythe and Dibden who are in conditions of need, hardship or distress.", "addressLine1": "7 Drummond Court Prospect House", "state": "Hampshire", "country": "UK", "postcode": "SO456HD", "telephone": "+442380841305", "fax": "", "charityNumber": "255778", "facebook": "", "twitter": ""}{"charityLegalName": "Steel Valley Project", "imageURL": "", "charityWebsite": "http://www.steelvalleyproject.org", "smallDescription": "The Steel Valley Project has been enhancing Stocksbridge, Bradfield and the Upper Don area since forming in 1988...", "longDescription": "The Steel Valley Project has been enhancing Stocksbridge, Bradfield and the Upper Don area since forming in 1988. A registered charity, our organisation works towards the following objectives: Manage habitats for the benefit of wildlife, people, heritage and landscape. Encourage access to open green space/wider countryside. Deliver environmental/education/interpretation to local schools/wider population. Provide support, advice, training & supervision to volunteers, trainees & community groups in countryside management/ conservations skills by working on real local environmental projects. We have a long history of delivering environmental, community and countryside projects with a range of partners, consistently working to improve the environment in our operational area. Working with volunteers is a huge part of our organisation and we have a team of dedicated people who help us to deliver our practical and community activities throughout the year.", "addressLine1": "The ARC Manchester Road Stocksbridge", "state": "South Yorkshire", "country": "UK", "postcode": "S362DT", "telephone": "+441142830880", "fax": "+441142903605", "charityNumber": "1095510", "facebook": "https://www.facebook.com/TheSteelValleyProject/", "twitter": ""}{"charityLegalName": "Oriel Mostyn Gallery", "imageURL": "", "charityWebsite": "http://www.mostyn.org", "smallDescription": "", "longDescription": "", "addressLine1": "12 Vaughan Street", "state": "Conwy", "country": "UK", "postcode": "LL301AB", "telephone": "+441492879201", "fax": "+441492878869", "charityNumber": "507842", "facebook": "", "twitter": ""}{"charityLegalName": "Duncombe Place Masonic Hall Charitable Trust", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "56 Hobgate York", "state": "", "country": "UK", "postcode": "YO244HH", "telephone": "+441904798289", "fax": "", "charityNumber": "1027876", "facebook": "", "twitter": ""}{"charityLegalName": "Cornwall Foundation of Promise", "imageURL": "", "charityWebsite": "", "smallDescription": "Cornwall Foundation of Promise helps disadvantaged young people by offering them training schemes in the kitchen at Fifteen Cornwall, giving them trasnferable skills and helping move them towards employment...", "longDescription": "Cornwall Foundation of Promise helps disadvantaged young people by offering them training schemes in the kitchen at Fifteen Cornwall, giving them trasnferable skills and helping move them towards employment.", "addressLine1": "10 Spernen Wyn Road", "state": "Cornwall", "country": "UK", "postcode": "TR114EH", "telephone": "+441637861000", "fax": "", "charityNumber": "1119341", "facebook": "", "twitter": ""}{"charityLegalName": "The Link Tees Valley Ltd", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "45 Station Road Redcar Redcar And Cleveland", "state": "", "country": "UK", "postcode": "TS101DT", "telephone": "+441287622202", "fax": "", "charityNumber": "1166207", "facebook": "", "twitter": ""}{"charityLegalName": "Priscilla Bacon Lodge Palliative Care Unit", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Colman Hospital Unthank Road", "state": "Norfolk", "country": "UK", "postcode": "NR22PJ", "telephone": "+441603288981ext.4981", "fax": "+441603288988", "charityNumber": "278667", "facebook": "", "twitter": ""}{"charityLegalName": "Hallam Diocesan Caring Services (Hallam Diocese)", "imageURL": "", "charityWebsite": "", "smallDescription": "Hallam Diocese works to promote the Roman Catholic religion in the local area...", "longDescription": "Hallam Diocese works to promote the Roman Catholic religion in the local area.", "addressLine1": "St Wilfrid's Centre 524 Queens Road", "state": "South Yorkshire", "country": "UK", "postcode": "S24DT", "telephone": "+441142580000", "fax": "+441142580000", "charityNumber": "512021", "facebook": "", "twitter": ""}{"charityLegalName": "Vauxhall Neighbourhood Council", "imageURL": "", "charityWebsite": "", "smallDescription": "Vauxhall Neighbourhood Council promotes healthcare and education improvement through the provision of grants to charities...", "longDescription": "Vauxhall Neighbourhood Council promotes healthcare and education improvement through the provision of grants to charities.", "addressLine1": "Multi-Services Centre Silvester Street", "state": "Merseyside", "country": "UK", "postcode": "L58SE", "telephone": "+441514822000", "fax": "", "charityNumber": "1063661", "facebook": "", "twitter": ""}{"charityLegalName": "Disability Challengers", "imageURL": "", "charityWebsite": "http://www.disability-challengers.org", "smallDescription": "Imagine a childhood without play...", "longDescription": "Imagine a childhood without play. Shockingly, 51% of disabled children and young people are deliberately excluded from play and leisure opportunities. At Challengers we will never exclude a child or young person and we need your help to make this possible. £152 will pay for one child to come to Challengers for a day of fun and laughter. Every penny you donate or raise will make a huge difference. Thank you.", "addressLine1": "Stoke Park London Road", "state": "Surrey", "country": "UK", "postcode": "GU11TU", "telephone": "+441483579390", "fax": "+441483302947", "charityNumber": "1095134", "facebook": "https://www.facebook.com/DisabilityChallengers", "twitter": ""}{"charityLegalName": "Football For Humanity, Inc Foundation", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "35 Lowfield Lane", "state": "Merseyside", "country": "UK", "postcode": "WA95TA", "telephone": "+4406328006661", "fax": "", "charityNumber": "1174192", "facebook": "", "twitter": ""}{"charityLegalName": "Challenge 4 Change (C4C)", "imageURL": "", "charityWebsite": "http://www.challenge4change.org", "smallDescription": "", "longDescription": "", "addressLine1": "Challenge 4 Change Centre 373 Trafford Park Road", "state": "Greater Manchester", "country": "UK", "postcode": "M171AL", "telephone": "+443001231401", "fax": "+443001231401", "charityNumber": "441126141", "facebook": "", "twitter": ""}{"charityLegalName": "Amber Valley Stroke Group", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "28 Ivy Grove Ripley Derbyshire", "state": "", "country": "UK", "postcode": "DE53HN", "telephone": "", "fax": "", "charityNumber": "1093663", "facebook": "", "twitter": ""}{"charityLegalName": "It's On The Ball", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "King Street House 15 Upper King Street Norwich", "state": "", "country": "UK", "postcode": "NR31RB", "telephone": "", "fax": "", "charityNumber": "1155510", "facebook": "", "twitter": ""}{"charityLegalName": "British Small Animal Veterinary Association - PetSavers", "imageURL": "", "charityWebsite": "http://www.petsavers.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Woodrow House 1 Telford Way Waterwells Business Park", "state": "Gloucestershire", "country": "UK", "postcode": "GL22AB", "telephone": "+441452726723", "fax": "+441452726701", "charityNumber": "1024811", "facebook": "", "twitter": ""}{"charityLegalName": "Village Hall - Winterborne Whitechurch", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "2 Queens Square Winterborne Whitechurch Blandford Forum Dorset", "state": "", "country": "UK", "postcode": "DT110AF", "telephone": "+441258881204", "fax": "", "charityNumber": "209082", "facebook": "", "twitter": ""}{"charityLegalName": "Success For All Foundation", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Studio 8 Stuart House St Johns Street", "state": "Cambridgeshire", "country": "UK", "postcode": "PE15DD", "telephone": "+441733490222", "fax": "", "charityNumber": "1077079", "facebook": "", "twitter": ""}{"charityLegalName": "The Bold Balladiers Trust", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "77 Southampton Road Lymington", "state": "", "country": "UK", "postcode": "SO419GH", "telephone": "+441590677258", "fax": "", "charityNumber": "1053925", "facebook": "", "twitter": ""}{"charityLegalName": "Ashton Hall Organ Restoration Project", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "10 Whernside Road Lancaster", "state": "", "country": "UK", "postcode": "LA12TA", "telephone": "+441524843117", "fax": "", "charityNumber": "1113551", "facebook": "", "twitter": ""}{"charityLegalName": "Lyth Valley First Responder Group", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Tower Hill Crosthwaite Kendal", "state": "", "country": "UK", "postcode": "LA88HX", "telephone": "+441539568599", "fax": "", "charityNumber": "1127795", "facebook": "", "twitter": ""}{"charityLegalName": "Venner Road Hall Community Association", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "72 Perry Rise London", "state": "", "country": "UK", "postcode": "SE232QL", "telephone": "+447931620917", "fax": "", "charityNumber": "1169551", "facebook": "", "twitter": ""}{"charityLegalName": "Owston Ferry Coronation Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "High Hall Burnham Road Owston Ferry Doncaster", "state": "", "country": "UK", "postcode": "DN91AY", "telephone": "+441427728373", "fax": "", "charityNumber": "1091070", "facebook": "", "twitter": ""}{"charityLegalName": "Look: National Federation of Families with Visually Impaired Children", "imageURL": "", "charityWebsite": "http://www.look-uk.org", "smallDescription": "LOOK's Vision and Mission The Vision of LOOK is to be one of the first points of contact and guidance for families with children affected by visual impairment...", "longDescription": "LOOK's Vision and Mission The Vision of LOOK is to be one of the first points of contact and guidance for families with children affected by visual impairment. The Mission of LOOK is to improve the lives of families with visually impaired children and young people by providing support, information and activities.", "addressLine1": "c/o The Royal National College for the Blind Venns Lane", "state": "Herefordshire", "country": "UK", "postcode": "HR11DT", "telephone": "+441432376314", "fax": "", "charityNumber": "1140471", "facebook": "", "twitter": ""}{"charityLegalName": "The London Ballet Foundation", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "17 Holly Road Ipswich", "state": "", "country": "UK", "postcode": "IP13QN", "telephone": "+447772926974", "fax": "", "charityNumber": "1170362", "facebook": "", "twitter": ""}{"charityLegalName": "Cinnamon Trust - Helping Elderly and Terminally ill People and their Pets", "imageURL": "https://www.charitychoice.co.uk/media/profile/c/cinnamon-trust-helping-elderly-people-and-pets-1075/cinnamontrust.jpg", "charityWebsite": "http://www.cinnamon.org.uk", "smallDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty...", "longDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty. We step in to ensure that any problem encountered in the day to day care of a pet can be overcome and all the benefits of owning a pet can be preserved. Our aims are achieved by tasking a national network of over 6,000 volunteers to provide any assistance required including walking dogs and pet fostering. We operate a national register of 752 care homes/sheltered housing for the elderly that will accept pets. A principal concern for elderly and terminally ill pet owners is the long term care of beloved pets. We provide lifetime care for pets whose owners have died either in our unique home from home sanctuaries or in long term foster homes. We rely entirely on donations and legacies. We make no charge for our services. Peace of mind and practical help for people - love, care and safety for their pets.", "addressLine1": "10 Market Square", "state": "Cornwall", "country": "UK", "postcode": "TR274HE", "telephone": "+441736757900", "fax": "+441736757010", "charityNumber": "1134680", "facebook": "", "twitter": ""}{"charityLegalName": "Wythall Animal Sanctuary", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/wythall-animal-sanctuary-1258/top.jpg", "charityWebsite": "https://wythallanimalrescue.org/", "smallDescription": "Wythall Animal Sanctuary was founded by Mr...", "longDescription": "Wythall Animal Sanctuary was founded by Mr. & Mrs. E. Davies in 1968, whose aim was to save and find homes for as many unwanted pets as possible. Many thousands have been found new homes since then. Many of these animals may otherwise have been destroyed. We have a non-destruction policy and we are the last hope for these animals. As our name signifies we give them Sanctuary. We take in, when possible, animals for rehoming and some of these animals will not be fit for rehoming and will live the rest of their lives with us. We pick up all the bills, including veterinary bills, for our residents both long-term and animals for rehoming. It costs £4,000 a week to keep the Sanctuary running and we rely entirely on donations, fundraising and Wills to continue our work. Other ways you can help are by Sponsoring an Animal, Leave a gift in your Will or by becoming a 'Friend' of Wythall Animal Sanctuary.", "addressLine1": "Middle Lane Kings Norton", "state": "West Midlands", "country": "UK", "postcode": "B380DU", "telephone": "+441564823288", "fax": "", "charityNumber": "1137681", "facebook": "", "twitter": ""}{"charityLegalName": "Hospice of the Valleys (Hosbis y Cymoedd)", "imageURL": "https://www.charitychoice.co.uk/media/profile/h/hospice-of-the-valleys-hosbis-y-cymoedd-4189/Hospice%20of%20the%20Valleys%20logo.jpg", "charityWebsite": "http://www.hospiceofthevalleys.org.uk", "smallDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer...", "longDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer. Our team of specialist Nurses, Social Workers, Welfare Rights Officers and Therapists are able to help patients and their families deal with the challenges such a diagnosis brings. Our service is free and available 24hrs a day all year for the people of Blaenau Gwent.", "addressLine1": "Festival Drive", "state": "Blaenau Gwent", "country": "UK", "postcode": "NP238XF", "telephone": "+441495717277", "fax": "+441495724188", "charityNumber": "517724", "facebook": "", "twitter": ""}{"charityLegalName": "St Kentigern Hospice and Palliative Care Centre, St Asaph, Denbighshire", "imageURL": "https://www.charitychoice.co.uk/media/profile/s/st-kentigern-hospice-and-palliative-care-centre-st-asaph-denbighshire-4300/St%20Kentigern%20logo.jpg", "charityWebsite": "http://www.stkentigernhospice.org.uk", "smallDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day...", "longDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day. We provide a relaxed, homely and informal environment for people with a diagnosis of cancer. Other services include physiotherapy, aromatherapy, reflexology, chiropody, and much more. We make no charge to our patients or their carers. Any donations received would be greatly appreciated.", "addressLine1": "St Kentigern Hospice Upper Denbigh Road", "state": "Denbighshire", "country": "UK", "postcode": "LL170RS", "telephone": "+441745585221", "fax": "+441745585224", "charityNumber": "519931", "facebook": "", "twitter": ""}{"charityLegalName": "Partially Sighted Society", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/partially-sighted-society-1520/partially-sighted-society.jpg", "charityWebsite": "https://www.partsight.org.uk/", "smallDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight...", "longDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight. The Partially Sighted Society has been in existence for over 50 years. Our aim is to help people with sight loss make the best use of their remaining vision. From our professionally equipped sight centre in Doncaster we provide a range of services to support anybody living with sight loss. These include: - Free Low Vision Assessments. Our professional low vision assessment has access to the latest aids and equipment to help you continue to live life independently. - Sight tests. We are a registered NHS Sight Test Centre and anyone can book an appointment with our part time Optometrist, who is as passionate about low vision as we are. We do not dispense spectacles, however, if new glasses are prescribed you can then take this to an optician of your choice. Our sight test clinic is ideal for those with learning disabilities or dementia. Our waiting area is never busy and we have supportive, caring staff. - Pss Print. Our print room offers a unique range of bold-lined stationery, exercise books, diaries and calendars. Andre, our print room manager, understands the challenges of visual impairment and is on hand to advise. We also offer a bespoke print service and free Visual Impairment Assessment Packs with samples of all our printed material. - Information and Support groups. Come and meet new people and learn new things at our variety of support and activity groups.", "addressLine1": "1 Bennetthorpe", "state": "South Yorkshire", "country": "UK", "postcode": "DN26AA", "telephone": "+441302965195", "fax": "+441302556587", "charityNumber": "254052", "facebook": "", "twitter": ""}{"charityLegalName": "Oak Tree Animals' Charity", "imageURL": "https://www.charitychoice.co.uk/media/profile/o/oaktreeanimalscharity/OTAC-logoOrange-small.jpg", "charityWebsite": "https://www.oaktreeanimals.org.uk/", "smallDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle...", "longDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle. Its also a safe haven for stray, abandoned or unwanted dogs and cats who are awaiting new homes through our Adoption Programme. Every year Oak Tree takes in hundreds of lost or unwanted animals and gives them a second chance. We rehabilitate the animals, but we also prepare potential owners for life with a new companion and offer the help and support necessary for both animal and owner to live a long and happy life together. Our work in the community means that loving pet owners can find the information and resources they need to keep their animals happy, healthy and in good homes. We also support unowned animals such as feral cats through our Trap Neuter Return (TNR) programme. We use educational campaigns to raise awareness and change perceptions, hoping to provide a brighter future for animals in all walks of society. Our team speaks to schools, community groups and colleges about animal welfare and offers advice on working with animals in the future, investing in our younger generations and providing them with the knowledge they need to help animals in the long term.", "addressLine1": "Oak Tree Farm Wetheral Shields", "state": "Cumbria", "country": "UK", "postcode": "CA48JA", "telephone": "+441228560082", "fax": "+441228560985", "charityNumber": "1001169511", "facebook": "https://www.facebook.com/oaktreeanimals", "twitter": ""}{"charityLegalName": "Psoriasis and Psoriatic Arthritis Alliance (PAPAA)", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/psoriasis-and-psoriatic-arthritis-alliance-papaa-17015/top_wiki.jpg", "charityWebsite": "http://www.papaa.org", "smallDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis...", "longDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis.", "addressLine1": "Unit 3 Horseshoe Business Park Lye Lane Bricket Wood", "state": "Hertfordshire", "country": "UK", "postcode": "AL23TA", "telephone": "+441923672837", "fax": "+441923682606", "charityNumber": "1118192", "facebook": "", "twitter": ""}{"charityLegalName": "Walsall Society for the Blind", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/walsallsocietyfortheblind/Walsall-logo.jpg", "charityWebsite": "http://www.walsallblind.org", "smallDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall...", "longDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall. Walsall Society for the Blind has been a flagship for sight loss services in the Walsall Borough for over 100 years. We currently have over 1500 visually impaired individuals on our database who have already made use of our services. With a total of 22 staff, we provide a seamless package of sight loss services across the Borough. From the early intervention of the Eye Clinic Liaison Officer (ECLO) to the Community Services, we can help anyone experiencing a sight loss, whether it is temporary or permanent, newly diagnosed or long standing. We also provide information and support to their families, carers and friends. At WSB we understand how devastating sight loss can be, and we realise the consequences of living with it can be dramatic. We aim to do our best by our service users, by making our services known from the first possible point, and carrying our support and guidance through for as long as the individual needs it.", "addressLine1": "Hawley House 11 Hatherton Road", "state": "West Midlands", "country": "UK", "postcode": "WS11XS", "telephone": "+441922627683", "fax": "", "charityNumber": "1075854", "facebook": "http://www.facebook.com/pages/Walsall-Society-for-the-Blind/213993005340708", "twitter": ""}{"charityLegalName": "Alliance For International Development", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Flat 76 Arrol House Rockingham Street London", "state": "", "country": "UK", "postcode": "SE16QL", "telephone": "+447535873262", "fax": "", "charityNumber": "1161111", "facebook": "", "twitter": ""}{"charityLegalName": "The Parochial Church Council Of The Ecclesiastical Parish Of All Saints Ockbrook", "imageURL": "", "charityWebsite": "http://www.allsaints.ockbrook.com", "smallDescription": "All Saints Church, Ockbrook Building for the FutureSome years ago, following an inspection, it became clear the All SaintsChurch building in Ockbrook needed costly repair...", "longDescription": "All Saints Church, Ockbrook Building for the FutureSome years ago, following an inspection, it became clear the All SaintsChurch building in Ockbrook needed costly repair. and refurbishment. Wealso have to ensure the building complies with current legislation withregard to disabled access, toilet facilities suitable for all and fireregulations, which it currently fails to do. Without these changes, thebuilding may have to close. My Building Team and I, in closecollaboration with our architect, have been preparing detailed plans forthese internal repairs and to refurbish the building. Our aim is to create aflexible space for Sunday services, occasional offices (baptisms,weddings and funerals) and for use on weekdays by church andcommunity groups. Our vision is that the church becomes a facility foruse by the whole community..Our architect has drawn up plans and we estimate that this work will costin the region of £400,000. So far, the church family have raised£200,000. We have already completed work on the Chancel roof,rainwater drainage system, toilet roof, lychgate, one of the stained-glasswindows and filled in the old boiler room.We wish to ask for your support with our plans. I wondered if youwould be willing to donate towards keeping All Saints Ockbrook openand fit for future generations to use and enjoy?May I thank you for your interest and generosity.Kind regardsThe Revd Tim SumpterChurch of England Vicar of Ockbrook & Borrowash", "addressLine1": "74 The Ridings Ockbrook Derby", "state": "", "country": "UK", "postcode": "DE723SF", "telephone": "+441332820084", "fax": "", "charityNumber": "1168870", "facebook": "@allsaintsockbrookandststephensborrowash", "twitter": ""}{"charityLegalName": "Lilleshall Relief In Need Charity", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Church Office, St John's Church Saltwells Drive Muxton", "state": "Shropshire", "country": "UK", "postcode": "TF28RJ", "telephone": "+441952670033", "fax": "", "charityNumber": "216246", "facebook": "", "twitter": ""}{"charityLegalName": "Love Is All We Need", "imageURL": "", "charityWebsite": "http://www.loveisallweneed.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Flat 332 Cowley Mansions Mortlake High Street", "state": "", "country": "UK", "postcode": "SW148SL", "telephone": "+447753779055", "fax": "", "charityNumber": "1116963", "facebook": "", "twitter": ""}{"charityLegalName": "Watts Gallery", "imageURL": "", "charityWebsite": "http://www.wattsgallery.org.uk/", "smallDescription": "Watts Gallery promotes the wider knowledge and appreciation of the works of G...", "longDescription": "Watts Gallery promotes the wider knowledge and appreciation of the works of G. F. Watts and Mrs Mary Watts within the wider context of nineteenth-century art and runs a gallery to showcase their works.", "addressLine1": "Down Lane", "state": "Surrey", "country": "UK", "postcode": "GU31DH", "telephone": "+441483810235", "fax": "", "charityNumber": "313612", "facebook": "", "twitter": ""}{"charityLegalName": "The Holme Valley Mountain Rescue Team", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Emergency House Manchester Road Marsden Huddersfield", "state": "", "country": "UK", "postcode": "HD76EY", "telephone": "", "fax": "", "charityNumber": "1015532", "facebook": "", "twitter": ""}{"charityLegalName": "Merseyside Youth Challenge Trust", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Outdoor Activities Centre Allerton Tower Park Menlove Avenue", "state": "Merseyside", "country": "UK", "postcode": "L257UL", "telephone": "+441514289758", "fax": "+441514289758", "charityNumber": "1024555", "facebook": "", "twitter": ""}{"charityLegalName": "Faith In Action International Rally", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "40 Pennington Way London", "state": "", "country": "UK", "postcode": "SE129QB", "telephone": "+447588681256", "fax": "", "charityNumber": "1147063", "facebook": "", "twitter": ""}{"charityLegalName": "PCC of All Saints Onslow Village Guildford", "imageURL": "", "charityWebsite": "http://www.allsaintschurchgfd.org.uk/welcome.htm", "smallDescription": "ALL SAINTS' CHURCH We are a friendly, open and welcoming church, meeting in the centre of the community...", "longDescription": "ALL SAINTS' CHURCH We are a friendly, open and welcoming church, meeting in the centre of the community. Whether you are looking to join the church family on a regular basis, or are enquiring about becoming part of the church for a special event, such as a wedding or a baptism, just contact us via the website or telephone, or turn up for a service. Each week, children and adults of all ages gather for worship at three different times on a Sunday and on weekdays. Newcomers are always welcome and we hope that you will find a spiritual home here - all are truly welcome. At the moment we are fundraising with two of our congregation abseiling from Guildford Cathedral Tower on 21st June. Please donate generously via our church website page, or by using the 'donate now' button on this page. Thank you for your support.", "addressLine1": "53 Agraria Road", "state": "Surrey", "country": "UK", "postcode": "GU24LF", "telephone": "+441483822982", "fax": "", "charityNumber": "72292", "facebook": "https://www.facebook.com/allsaintschurchgfd", "twitter": ""}{"charityLegalName": "Restorer Ministries-God's Bible Church Of All Nations", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "15 Baronscourt Leeds", "state": "", "country": "UK", "postcode": "LS157AP", "telephone": "+441132646975", "fax": "", "charityNumber": "327906", "facebook": "", "twitter": ""}{"charityLegalName": "Lyth Valley First Responder Group", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Tower Hill Crosthwaite Kendal", "state": "", "country": "UK", "postcode": "LA88HX", "telephone": "+441539568599", "fax": "", "charityNumber": "1127795", "facebook": "", "twitter": ""}{"charityLegalName": "Kilmallie Free Church of Scotland", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Erradale Corpach", "state": "Highland", "country": "UK", "postcode": "PH337LT", "telephone": "", "fax": "", "charityNumber": "038140", "facebook": "", "twitter": ""}{"charityLegalName": "Stone Cross Memorial Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "264 Kings Drive Eastbourne", "state": "", "country": "UK", "postcode": "BN212XD", "telephone": "+441323502578", "fax": "", "charityNumber": "305326", "facebook": "", "twitter": ""}{"charityLegalName": "Walsall Foster Carer's Association", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "2 Barbel Drive Wolverhampton", "state": "", "country": "UK", "postcode": "WV100TQ", "telephone": "+44122698127", "fax": "", "charityNumber": "1112154", "facebook": "", "twitter": ""}{"charityLegalName": "Small Dole Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "9 Hoewood Small Dole Henfield West Sussex", "state": "", "country": "UK", "postcode": "BN59YR", "telephone": "+441273494831", "fax": "", "charityNumber": "275112", "facebook": "", "twitter": ""}{"charityLegalName": "National Gallery", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "National Gallery Trafalgar Square", "state": "", "country": "UK", "postcode": "WC2N5DN", "telephone": "+442077475875", "fax": "+442077475878", "charityNumber": "", "facebook": "", "twitter": ""}{"charityLegalName": "Mollington,backford And District Village Hall", "imageURL": "", "charityWebsite": "https://mbdvh.org.uk/", "smallDescription": "Mollington, Backford & District Village Hall - a community hall serving the parishes of Mollington, Lea-by-Backford, Backford, Chorlton by Backford and Caughall in the county of Cheshire just four miles north of Chester...", "longDescription": "Mollington, Backford & District Village Hall - a community hall serving the parishes of Mollington, Lea-by-Backford, Backford, Chorlton by Backford and Caughall in the county of Cheshire just four miles north of Chester. The hall has existed since 1950 and there is a campaign now well under way to obtain funding to rebuild the hall. We already have funding from the Big Lottery Fund and Sport England together with other gifts and contributions from individuals and other funders.", "addressLine1": "Strawberry Cottage Strawberry Lane Mollington Chester", "state": "", "country": "UK", "postcode": "CH16LL", "telephone": "+441244851893", "fax": "", "charityNumber": "702464", "facebook": "https://facebook.com/mbdvh", "twitter": ""}{"charityLegalName": "Smallpeice Trust", "imageURL": "", "charityWebsite": "http://www.smallpeicetrust.org.uk", "smallDescription": "Smallpeice Trust promotes education in engineering technology and engineering as a career...", "longDescription": "Smallpeice Trust promotes education in engineering technology and engineering as a career.", "addressLine1": "74 Upper Holly Walk", "state": "Warwickshire", "country": "UK", "postcode": "CV324JL", "telephone": "+441926333207", "fax": "", "charityNumber": "313719", "facebook": "", "twitter": ""}{"charityLegalName": "Bungoma Calling", "imageURL": "", "charityWebsite": "http://www.bungomacalling.co.uk", "smallDescription": "Bungoma Calling is a UK charity working with Christian churches in Bungoma, Western Kenya...", "longDescription": "Bungoma Calling is a UK charity working with Christian churches in Bungoma, Western Kenya. It is also linked with the St Dorcas Orphanage where in 2015 thirty (30) children of 5 years old and upwards live. They all go to school and the charity is trying to ensure they all have a quality education up to and including secondary school by a sponsorship programme to pay their school fees. Several primary schools in the York area are linked with schools in Bungoma. Each year a team go out to visit and work with the orphanage, the link schools and the churches.", "addressLine1": "Orchard House Ingleby Arncliffe", "state": "North Yorkshire", "country": "UK", "postcode": "DL63LN", "telephone": "+441609882937", "fax": "", "charityNumber": "1137121", "facebook": "https://www.facebook.com/pages/Bungoma-Calling/268280119905085", "twitter": ""}{"charityLegalName": "Autism All Stars Foundation Uk", "imageURL": "", "charityWebsite": "http://www.autism-all-stars.org", "smallDescription": "Autism All Stars is a positive, forward-thinking UK charity based on the Surrey/Sussex borders and our Registered Charity Number is 1152681...", "longDescription": "Autism All Stars is a positive, forward-thinking UK charity based on the Surrey/Sussex borders and our Registered Charity Number is 1152681. Our intention is to raise awareness of the different manifestations of autism and to offer support and encouragement to all those affected by it. We know exactly how hard it is to raise children with autism, and its not something we take lightly at all. We know about the isolation, the destruction, the physical attacks, the disapproval, the rejection, the emotional roller-coasters, the tears, the guilt and the despair, and that is precisely why All Stars is run the way it is. We aim to give people something bright, colourful and uplifting to enjoy, not more doom and gloom  presumably they get enough of that already. We offer them somewhere their children are welcome no matter how they behave; somewhere people genuinely understand and accept them; somewhere they can smile and feel just a little less alone. We organise events that are truly inclusive, where everyone is allowed to shine without judgement, and through these events, we raise funds to help those same people when the darkness closes in. People on the autism spectrum arent all like Dustin Hoffmans character in Rain Man, many are more like Tom Cruises (who most people dont even realise is also on the spectrum) so often theres nothing to see except some eccentric behaviour, meaning it can be hard to understand or detect without the right information and experience. There is still much ignorance of autism and prejudice towards autistic people, but Autism All Stars is not about blame, its about enlightening people: shining a light into the darkness surrounding the condition, dissolving the barriers and encouraging people to accept it in all its forms. Dealing with autism and its effects can be dark, lonely and overwhelming, we know that, and the way we raise our funds reflects this. We encourage people to look within themselves and recognise that the things they love and enjoy can be used to raise money. Everyone has a passion or a talent, although many people have yet to recognise this or to realise how powerful a tool it can be. When it comes to autistic people, that passion may not be something thats conventionally thought of as a skill, but we believe in thinking WAY outside the box when it comes to uncovering peoples hidden abilities, and this is why: Imagine every experience as a small seed that continues to grow as you go through life. If you know someone with autism, or have autism yourself, youll already know just how quick the world is to criticise people for their differences and ridicule their quirks, but at All Stars we choose to celebrate these instead.", "addressLine1": "", "state": "", "country": "UK", "postcode": "", "telephone": "", "fax": "", "charityNumber": "1152681", "facebook": "http://www.facebook.com/autismallstars", "twitter": ""}{"charityLegalName": "West Pennard Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "The Cottage Coxbridge", "state": "Somerset", "country": "UK", "postcode": "BA68LG", "telephone": "+441458850734", "fax": "", "charityNumber": "233127", "facebook": "", "twitter": ""}{"charityLegalName": "Almondsbury Old School Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "33 Cope Park Almondsbury Bristol", "state": "", "country": "UK", "postcode": "BS324EZ", "telephone": "+441454610898", "fax": "", "charityNumber": "301451", "facebook": "", "twitter": ""}{"charityLegalName": "Wroxall In Action", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "17 Mountfield Road Wroxall Ventnor", "state": "", "country": "UK", "postcode": "PO383BX", "telephone": "", "fax": "", "charityNumber": "1063844", "facebook": "", "twitter": ""}{"charityLegalName": "British Small Animal Veterinary Association - PetSavers", "imageURL": "", "charityWebsite": "http://www.petsavers.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Woodrow House 1 Telford Way Waterwells Business Park", "state": "Gloucestershire", "country": "UK", "postcode": "GL22AB", "telephone": "+441452726723", "fax": "+441452726701", "charityNumber": "1024811", "facebook": "", "twitter": ""}{"charityLegalName": "Friends Of Tsunami Animal People Alliance", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "34 Mill Lane Cayton Bay Scarborough North Yorkshire", "state": "", "country": "UK", "postcode": "YO113NN", "telephone": "+447916338754", "fax": "", "charityNumber": "1147106", "facebook": "", "twitter": ""}{"charityLegalName": "Meanwood Valley Urban Farm Limited", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Meanwood Valley Urban Farm Limited Sugar Well Road", "state": "West Yorkshire", "country": "UK", "postcode": "LS72QG", "telephone": "+441132629759", "fax": "", "charityNumber": "510452", "facebook": "", "twitter": ""}{"charityLegalName": "The Parochial Church Council Of The Ecclesiastical Parish Of All Saints Fleet", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Fpcc Church Road Fleet Hampshire", "state": "", "country": "UK", "postcode": "GU514NB", "telephone": "", "fax": "", "charityNumber": "1129190", "facebook": "", "twitter": ""}{"charityLegalName": "Harbour Challenge", "imageURL": "", "charityWebsite": "http://www.harbourchallenge.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "46 Patchins Road Poole", "state": "", "country": "UK", "postcode": "BH165AS", "telephone": "+441202772436", "fax": "", "charityNumber": "1103870", "facebook": "", "twitter": ""}{"charityLegalName": "Sheffield Wednesday Football Club Community Programme", "imageURL": "", "charityWebsite": "http://www.swfc.co.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Hillsborough Football Stadium Leppings Lane", "state": "South Yorkshire", "country": "UK", "postcode": "S61SW", "telephone": "+441142212152", "fax": "", "charityNumber": "1108538", "facebook": "", "twitter": ""}{"charityLegalName": "Galloway's Society for the Blind", "imageURL": "", "charityWebsite": "http://www.galloways.org.uk", "smallDescription": "Established in Preston in 1867, the charity has been working with visually impaired people for over 140 years...", "longDescription": "Established in Preston in 1867, the charity has been working with visually impaired people for over 140 years. From Ormskirk to Silverdale the Society serves West Lancashire, Preston, Lancaster, Morecambe and surrounding districts, services include 11 social centres, resource and information centres at Preston, Morecambe, Chorley and Southport, talking newspapers, books and magazines, Braille transcription. The Society has seen a fall in Legacy income in recent years. Many developments which would further improve the quality of life for over 6000 visually impaired people are held up due to lack of funds. Please help us now.", "addressLine1": "Howick House Howick Park Avenue Penwortham", "state": "Lancashire", "country": "UK", "postcode": "PR10LS", "telephone": "+441772744148", "fax": "", "charityNumber": "526088", "facebook": "", "twitter": ""}{"charityLegalName": "Paper For All", "imageURL": "", "charityWebsite": "http://www.paper4allcharity.com", "smallDescription": "", "longDescription": "", "addressLine1": "74 Clearbrook Way", "state": "", "country": "UK", "postcode": "E10SD", "telephone": "", "fax": "", "charityNumber": "1116888", "facebook": "", "twitter": ""}{"charityLegalName": "The Shelsleys Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "8 The Bungalows Shelsley Beauchamp", "state": "Worcestershire", "country": "UK", "postcode": "WR66RD", "telephone": "+441886812180", "fax": "", "charityNumber": "523190", "facebook": "", "twitter": ""}{"charityLegalName": "Hospice of the Valleys (Hosbis y Cymoedd)", "imageURL": "https://www.charitychoice.co.uk/media/profile/h/hospice-of-the-valleys-hosbis-y-cymoedd-4189/Hospice%20of%20the%20Valleys%20logo.jpg", "charityWebsite": "http://www.hospiceofthevalleys.org.uk", "smallDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer...", "longDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer. Our team of specialist Nurses, Social Workers, Welfare Rights Officers and Therapists are able to help patients and their families deal with the challenges such a diagnosis brings. Our service is free and available 24hrs a day all year for the people of Blaenau Gwent.", "addressLine1": "Festival Drive", "state": "Blaenau Gwent", "country": "UK", "postcode": "NP238XF", "telephone": "+441495717277", "fax": "+441495724188", "charityNumber": "517724", "facebook": "", "twitter": ""}{"charityLegalName": "Cinnamon Trust - Helping Elderly and Terminally ill People and their Pets", "imageURL": "https://www.charitychoice.co.uk/media/profile/c/cinnamon-trust-helping-elderly-people-and-pets-1075/cinnamontrust.jpg", "charityWebsite": "http://www.cinnamon.org.uk", "smallDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty...", "longDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty. We step in to ensure that any problem encountered in the day to day care of a pet can be overcome and all the benefits of owning a pet can be preserved. Our aims are achieved by tasking a national network of over 6,000 volunteers to provide any assistance required including walking dogs and pet fostering. We operate a national register of 752 care homes/sheltered housing for the elderly that will accept pets. A principal concern for elderly and terminally ill pet owners is the long term care of beloved pets. We provide lifetime care for pets whose owners have died either in our unique home from home sanctuaries or in long term foster homes. We rely entirely on donations and legacies. We make no charge for our services. Peace of mind and practical help for people - love, care and safety for their pets.", "addressLine1": "10 Market Square", "state": "Cornwall", "country": "UK", "postcode": "TR274HE", "telephone": "+441736757900", "fax": "+441736757010", "charityNumber": "1134680", "facebook": "", "twitter": ""}{"charityLegalName": "Wythall Animal Sanctuary", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/wythall-animal-sanctuary-1258/top.jpg", "charityWebsite": "https://wythallanimalrescue.org/", "smallDescription": "Wythall Animal Sanctuary was founded by Mr...", "longDescription": "Wythall Animal Sanctuary was founded by Mr. & Mrs. E. Davies in 1968, whose aim was to save and find homes for as many unwanted pets as possible. Many thousands have been found new homes since then. Many of these animals may otherwise have been destroyed. We have a non-destruction policy and we are the last hope for these animals. As our name signifies we give them Sanctuary. We take in, when possible, animals for rehoming and some of these animals will not be fit for rehoming and will live the rest of their lives with us. We pick up all the bills, including veterinary bills, for our residents both long-term and animals for rehoming. It costs £4,000 a week to keep the Sanctuary running and we rely entirely on donations, fundraising and Wills to continue our work. Other ways you can help are by Sponsoring an Animal, Leave a gift in your Will or by becoming a 'Friend' of Wythall Animal Sanctuary.", "addressLine1": "Middle Lane Kings Norton", "state": "West Midlands", "country": "UK", "postcode": "B380DU", "telephone": "+441564823288", "fax": "", "charityNumber": "1137681", "facebook": "", "twitter": ""}{"charityLegalName": "Partially Sighted Society", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/partially-sighted-society-1520/partially-sighted-society.jpg", "charityWebsite": "https://www.partsight.org.uk/", "smallDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight...", "longDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight. The Partially Sighted Society has been in existence for over 50 years. Our aim is to help people with sight loss make the best use of their remaining vision. From our professionally equipped sight centre in Doncaster we provide a range of services to support anybody living with sight loss. These include: - Free Low Vision Assessments. Our professional low vision assessment has access to the latest aids and equipment to help you continue to live life independently. - Sight tests. We are a registered NHS Sight Test Centre and anyone can book an appointment with our part time Optometrist, who is as passionate about low vision as we are. We do not dispense spectacles, however, if new glasses are prescribed you can then take this to an optician of your choice. Our sight test clinic is ideal for those with learning disabilities or dementia. Our waiting area is never busy and we have supportive, caring staff. - Pss Print. Our print room offers a unique range of bold-lined stationery, exercise books, diaries and calendars. Andre, our print room manager, understands the challenges of visual impairment and is on hand to advise. We also offer a bespoke print service and free Visual Impairment Assessment Packs with samples of all our printed material. - Information and Support groups. Come and meet new people and learn new things at our variety of support and activity groups.", "addressLine1": "1 Bennetthorpe", "state": "South Yorkshire", "country": "UK", "postcode": "DN26AA", "telephone": "+441302965195", "fax": "+441302556587", "charityNumber": "254052", "facebook": "", "twitter": ""}{"charityLegalName": "St Kentigern Hospice and Palliative Care Centre, St Asaph, Denbighshire", "imageURL": "https://www.charitychoice.co.uk/media/profile/s/st-kentigern-hospice-and-palliative-care-centre-st-asaph-denbighshire-4300/St%20Kentigern%20logo.jpg", "charityWebsite": "http://www.stkentigernhospice.org.uk", "smallDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day...", "longDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day. We provide a relaxed, homely and informal environment for people with a diagnosis of cancer. Other services include physiotherapy, aromatherapy, reflexology, chiropody, and much more. We make no charge to our patients or their carers. Any donations received would be greatly appreciated.", "addressLine1": "St Kentigern Hospice Upper Denbigh Road", "state": "Denbighshire", "country": "UK", "postcode": "LL170RS", "telephone": "+441745585221", "fax": "+441745585224", "charityNumber": "519931", "facebook": "", "twitter": ""}{"charityLegalName": "Walsall Society for the Blind", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/walsallsocietyfortheblind/Walsall-logo.jpg", "charityWebsite": "http://www.walsallblind.org", "smallDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall...", "longDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall. Walsall Society for the Blind has been a flagship for sight loss services in the Walsall Borough for over 100 years. We currently have over 1500 visually impaired individuals on our database who have already made use of our services. With a total of 22 staff, we provide a seamless package of sight loss services across the Borough. From the early intervention of the Eye Clinic Liaison Officer (ECLO) to the Community Services, we can help anyone experiencing a sight loss, whether it is temporary or permanent, newly diagnosed or long standing. We also provide information and support to their families, carers and friends. At WSB we understand how devastating sight loss can be, and we realise the consequences of living with it can be dramatic. We aim to do our best by our service users, by making our services known from the first possible point, and carrying our support and guidance through for as long as the individual needs it.", "addressLine1": "Hawley House 11 Hatherton Road", "state": "West Midlands", "country": "UK", "postcode": "WS11XS", "telephone": "+441922627683", "fax": "", "charityNumber": "1075854", "facebook": "http://www.facebook.com/pages/Walsall-Society-for-the-Blind/213993005340708", "twitter": ""}{"charityLegalName": "Psoriasis and Psoriatic Arthritis Alliance (PAPAA)", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/psoriasis-and-psoriatic-arthritis-alliance-papaa-17015/top_wiki.jpg", "charityWebsite": "http://www.papaa.org", "smallDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis...", "longDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis.", "addressLine1": "Unit 3 Horseshoe Business Park Lye Lane Bricket Wood", "state": "Hertfordshire", "country": "UK", "postcode": "AL23TA", "telephone": "+441923672837", "fax": "+441923682606", "charityNumber": "1118192", "facebook": "", "twitter": ""}{"charityLegalName": "Oak Tree Animals' Charity", "imageURL": "https://www.charitychoice.co.uk/media/profile/o/oaktreeanimalscharity/OTAC-logoOrange-small.jpg", "charityWebsite": "https://www.oaktreeanimals.org.uk/", "smallDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle...", "longDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle. Its also a safe haven for stray, abandoned or unwanted dogs and cats who are awaiting new homes through our Adoption Programme. Every year Oak Tree takes in hundreds of lost or unwanted animals and gives them a second chance. We rehabilitate the animals, but we also prepare potential owners for life with a new companion and offer the help and support necessary for both animal and owner to live a long and happy life together. Our work in the community means that loving pet owners can find the information and resources they need to keep their animals happy, healthy and in good homes. We also support unowned animals such as feral cats through our Trap Neuter Return (TNR) programme. We use educational campaigns to raise awareness and change perceptions, hoping to provide a brighter future for animals in all walks of society. Our team speaks to schools, community groups and colleges about animal welfare and offers advice on working with animals in the future, investing in our younger generations and providing them with the knowledge they need to help animals in the long term.", "addressLine1": "Oak Tree Farm Wetheral Shields", "state": "Cumbria", "country": "UK", "postcode": "CA48JA", "telephone": "+441228560082", "fax": "+441228560985", "charityNumber": "1001169511", "facebook": "https://www.facebook.com/oaktreeanimals", "twitter": ""}{"charityLegalName": "Rastrick Juniors Football Club", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "14 Bramston Gardens Rastrick Brighouse West Yorkshire 14 Bramston Gardens", "state": "", "country": "UK", "postcode": "HD63AG", "telephone": "+447818070105", "fax": "", "charityNumber": "1148067", "facebook": "", "twitter": ""}{"charityLegalName": "Action Against Allergy", "imageURL": "", "charityWebsite": "http://www.actionagainstallergy.co.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Action Against Allergy PO Box 278", "state": "London", "country": "UK", "postcode": "TW14QQ", "telephone": "+442088922711", "fax": "", "charityNumber": "276637", "facebook": "", "twitter": ""}{"charityLegalName": "All Saints Educational Trust", "imageURL": "", "charityWebsite": "http://www.aset.org.uk", "smallDescription": "The Trust makes grants to help with the costs of the formal training or better qualification of individual teachers, and also funds educational advance by other means, eg research...", "longDescription": "The Trust makes grants to help with the costs of the formal training or better qualification of individual teachers, and also funds educational advance by other means, eg research.", "addressLine1": "Suite 8c First Floor Royal London House 22-25 Finsbury Square", "state": "", "country": "UK", "postcode": "EC2A1DX", "telephone": "+442079206465", "fax": "", "charityNumber": "312934", "facebook": "", "twitter": ""}{"charityLegalName": "H B Allen Charitable Trust", "imageURL": "", "charityWebsite": "http://www.hballenct.org.uk", "smallDescription": "The charity supports general charitable purposes by making grants to charities in the UK...", "longDescription": "The charity supports general charitable purposes by making grants to charities in the UK.", "addressLine1": "Chidden Holt Hambleton", "state": "Hampshire", "country": "UK", "postcode": "PO74TG", "telephone": "+442392632406", "fax": "", "charityNumber": "802306", "facebook": "", "twitter": ""}{"charityLegalName": "Restorer Ministries-God's Bible Church Of All Nations", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "15 Baronscourt Leeds", "state": "", "country": "UK", "postcode": "LS157AP", "telephone": "+441132646975", "fax": "", "charityNumber": "327906", "facebook": "", "twitter": ""}{"charityLegalName": "Rhydlewis Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Twrgwyn Rhydlewis Llandysul Dyfed", "state": "", "country": "UK", "postcode": "SA445RY", "telephone": "+441239851617", "fax": "", "charityNumber": "508456", "facebook": "", "twitter": ""}{"charityLegalName": "Alliance for Inclusive Education", "imageURL": "", "charityWebsite": "http://www.allfie.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "336 Brixton Road Brixton", "state": "", "country": "UK", "postcode": "SW97AA", "telephone": "+442077376030", "fax": "", "charityNumber": "1124424", "facebook": "", "twitter": ""}{"charityLegalName": "Rolladome All Skate Limited", "imageURL": "", "charityWebsite": "http://www.rolladome.org.uk", "smallDescription": "Who we are RollaDome All Skate was established in 2009 in North-West London and is a Charity, offering the complete roller skating package from skating lessons and training to roller discos...", "longDescription": "Who we are RollaDome All Skate was established in 2009 in North-West London and is a Charity, offering the complete roller skating package from skating lessons and training to roller discos. We are made up of committed staff who are all keen to make a difference to young peoples lives by encouraging them to be active, learn a new skill, stay healthy and participate in a family based activity. What we do We provide roller skating lessons for young people from as young as four to 18. We have run a number of successful school holiday projects, youth and community engagement projects and family events. Why we do it We are committed to providing roller skating as a positive and healthy recreational activity for, but not exclusively to, young people. We aim to improve their health and fitness, educational and recreational attainment and in doing so provide a safe and nurturing environment where they can learn valuable skills, improve their dexterity and have fun while doing so! Our Programs All our programs are for children and adults of all ages and abilities, and are available to organisations, schools, and individuals. Our programs are provided in a safe environment where all involved learn valuable skills: These include: Improving balance and coordination strengthening endurance Learning self-discipline both on and off the skate rink Improving life skills, mentoring, discipline and motivation", "addressLine1": "26 Newark Crescent London", "state": "", "country": "UK", "postcode": "NW107BD", "telephone": "+442088381171", "fax": "", "charityNumber": "1138918", "facebook": "https://www.facebook.com/rolla.dome", "twitter": ""}{"charityLegalName": "1st Shepton Mallett Scout Group", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Uphill Cottage Church Street Croscombe", "state": "Somerset", "country": "UK", "postcode": "BA53QS", "telephone": "+441749343910", "fax": "", "charityNumber": "1271155", "facebook": "", "twitter": ""}{"charityLegalName": "Dance Professionals Fund", "imageURL": "", "charityWebsite": "https://www.dancefund.org.uk/", "smallDescription": "The Dance Professionals Fund (the working name of the Royal Ballet Benevolent Fund) aims to support people in the dance world throughout their lives...", "longDescription": "The Dance Professionals Fund (the working name of the Royal Ballet Benevolent Fund) aims to support people in the dance world throughout their lives. We are the leading UK charity offering financial assistance for individuals during their dance careers and into retirement. We help professional dancers, choreographers and choreologists, as well as dance teachers. It does not matter whether you have worked for a major dance company or as an independent dancer.", "addressLine1": "113 Queens Road", "state": "Brighton & Hove", "country": "UK", "postcode": "BN13XG", "telephone": "+441273234011", "fax": "", "charityNumber": "207477", "facebook": "www.facebook.com/danceprofessionalsfund", "twitter": ""}{"charityLegalName": "Cornwall Hospice Care", "imageURL": "", "charityWebsite": "http://www.cornwallhospicecare.co.uk", "smallDescription": "Cornwall Hospice Care have two centres in Cornwall that provide their patients with free 24 hour residential palliative care, lymphoedema treatment, physio therapy, bereavement support and more...", "longDescription": "Cornwall Hospice Care have two centres in Cornwall that provide their patients with free 24 hour residential palliative care, lymphoedema treatment, physio therapy, bereavement support and more. The outpatient service includes an outreach program where consultants visit patients living at home or in nursing facilities within 48 hours of a request being made. A care advice line is also open 24 hours a day and the centre is actively involved in the training of professionals going into this field.", "addressLine1": "Daniels Lane Holmbush", "state": "Cornwall", "country": "UK", "postcode": "PL253HS", "telephone": "+44172666868", "fax": "", "charityNumber": "1113140", "facebook": "", "twitter": ""}{"charityLegalName": "Almond Valley Heritage Trust, The", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Livingstone Mill Millfield", "state": "West Lothian", "country": "UK", "postcode": "EH547AR", "telephone": "+441506414957", "fax": "+441506497771", "charityNumber": "013783", "facebook": "", "twitter": ""}{"charityLegalName": "Royal Ballet School", "imageURL": "", "charityWebsite": "http://www.royalballetschool.co.uk", "smallDescription": "Royal Ballet School traisn and educate students towards careers as classical ballet dancers...", "longDescription": "Royal Ballet School traisn and educate students towards careers as classical ballet dancers. It also supplies The Royal Ballet and Birmingham Royal Ballet with the majority of their dancers, contributing to the raising of national and international classical ballet.", "addressLine1": "46 Floral Street Covent Garden", "state": "", "country": "UK", "postcode": "WC2E9DA", "telephone": "+442078368899", "fax": "+442078457080", "charityNumber": "214364", "facebook": "", "twitter": ""}{"charityLegalName": "Lilleshall Relief In Need Charity", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Church Office, St John's Church Saltwells Drive Muxton", "state": "Shropshire", "country": "UK", "postcode": "TF28RJ", "telephone": "+441952670033", "fax": "", "charityNumber": "216246", "facebook": "", "twitter": ""}{"charityLegalName": "The Gallions Music Trust", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "c/o Gallions Primary School Warwall Beckton", "state": "", "country": "UK", "postcode": "E66WG", "telephone": "", "fax": "", "charityNumber": "1141927", "facebook": "", "twitter": ""}{"charityLegalName": "Tees Valley Wildlife Trust", "imageURL": "", "charityWebsite": "http://www.wildlifetrust.org.uk/teesvalley", "smallDescription": "", "longDescription": "", "addressLine1": "Margrove Heritage Centre Margrove Park, Boosbeck Saltburn By The Sea", "state": "", "country": "UK", "postcode": "TS123BZ", "telephone": "+441287636382", "fax": "+441287636383", "charityNumber": "511068", "facebook": "", "twitter": ""}{"charityLegalName": "Glasgow Educational & Marshall Trust", "imageURL": "", "charityWebsite": "http://www.gemt.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "21 Beaton Road", "state": "", "country": "UK", "postcode": "G414NW", "telephone": "+441414334449", "fax": "", "charityNumber": "012582", "facebook": "", "twitter": ""}{"charityLegalName": "The Swallows Head & Neck Cancer Support Group", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "50 Alderley Avenue Blackpool", "state": "", "country": "UK", "postcode": "FY41SP", "telephone": "+447779169833", "fax": "", "charityNumber": "1149794", "facebook": "", "twitter": ""}{"charityLegalName": "The Bouncing Ball Trust", "imageURL": "", "charityWebsite": "http://www.bouncingballtrust.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Admiral's Yard Station Road", "state": "", "country": "UK", "postcode": "BS346LR", "telephone": "+443301200720", "fax": "", "charityNumber": "1170946", "facebook": "", "twitter": ""}{"charityLegalName": "Stone Cross Memorial Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "264 Kings Drive Eastbourne", "state": "", "country": "UK", "postcode": "BN212XD", "telephone": "+441323502578", "fax": "", "charityNumber": "305326", "facebook": "", "twitter": ""}{"charityLegalName": "Small Steps Foundation", "imageURL": "", "charityWebsite": "http://www.smallstepsfoundation.com", "smallDescription": "", "longDescription": "", "addressLine1": "25 Southdown Crescent Cheadle Hulme", "state": "Greater Manchester", "country": "UK", "postcode": "SK86EQ", "telephone": "+441614828802", "fax": "", "charityNumber": "1138643", "facebook": "", "twitter": ""}{"charityLegalName": "Toynbee Hall", "imageURL": "", "charityWebsite": "http://www.toynbeehall.org.uk", "smallDescription": "Toynbee Hall was established in 1884 to care for the disadvantaged in the local community and to help them integrate into society...", "longDescription": "Toynbee Hall was established in 1884 to care for the disadvantaged in the local community and to help them integrate into society.", "addressLine1": "Appeals Department 28 Commercial Street", "state": "", "country": "UK", "postcode": "E16LS", "telephone": "+442072476943", "fax": "+442073775964", "charityNumber": "211850", "facebook": "", "twitter": ""}{"charityLegalName": "The Shelsleys Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "8 The Bungalows Shelsley Beauchamp", "state": "Worcestershire", "country": "UK", "postcode": "WR66RD", "telephone": "+441886812180", "fax": "", "charityNumber": "523190", "facebook": "", "twitter": ""}{"charityLegalName": "British Small Animal Veterinary Association - PetSavers", "imageURL": "", "charityWebsite": "http://www.petsavers.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Woodrow House 1 Telford Way Waterwells Business Park", "state": "Gloucestershire", "country": "UK", "postcode": "GL22AB", "telephone": "+441452726723", "fax": "+441452726701", "charityNumber": "1024811", "facebook": "", "twitter": ""}{"charityLegalName": "Laleham Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "The Broadway Laleham", "state": "Middlesex", "country": "UK", "postcode": "TW181RZ", "telephone": "", "fax": "", "charityNumber": "305063", "facebook": "", "twitter": ""}{"charityLegalName": "Bury Society for Blind & Partially Sighted People", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "36 Bolton Street", "state": "Greater Manchester", "country": "UK", "postcode": "BL90LL", "telephone": "+441617637014", "fax": "+441617633395", "charityNumber": "1102525", "facebook": "", "twitter": ""}{"charityLegalName": "Alliance for Community Capacity Building in Northeast India", "imageURL": "", "charityWebsite": "http://www.accb.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "57 Newington Drive", "state": "Tyne & Wear", "country": "UK", "postcode": "NE299JA", "telephone": "+441912581933", "fax": "", "charityNumber": "1106666", "facebook": "", "twitter": ""}{"charityLegalName": "The Lyallpur Medical Services Trust", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "7-9 Swan Street Manchester", "state": "", "country": "UK", "postcode": "M45JJ", "telephone": "+441618390902", "fax": "", "charityNumber": "1135183", "facebook": "", "twitter": ""}{"charityLegalName": "National Football Museum", "imageURL": "", "charityWebsite": "", "smallDescription": "The museum aims to improve public education on the history and development of association football through its exhibitions and items of historic and cultural value...", "longDescription": "The museum aims to improve public education on the history and development of association football through its exhibitions and items of historic and cultural value.", "addressLine1": "Cathedral Gardens", "state": "Greater Manchester", "country": "UK", "postcode": "M43BG", "telephone": "+441618709275", "fax": "", "charityNumber": "1050792", "facebook": "", "twitter": ""}{"charityLegalName": "Macmillan Caring Locally", "imageURL": "", "charityWebsite": "http://www.macmillanlocal.org", "smallDescription": "Established in 1974 to support the first Macmillan Unit which opened in February 1975 and now cares for twenty in-patients and up to one hundred and seventy day-care patients...", "longDescription": "Established in 1974 to support the first Macmillan Unit which opened in February 1975 and now cares for twenty in-patients and up to one hundred and seventy day-care patients.", "addressLine1": "Macmillan Unit, Christchurch Hospital Fairmile Road", "state": "Dorset", "country": "UK", "postcode": "BH232JX", "telephone": "+441202477628", "fax": "", "charityNumber": "268218", "facebook": "", "twitter": ""}{"charityLegalName": "Food For All", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "102 Caledonian Road Kingscross", "state": "", "country": "UK", "postcode": "N19DN", "telephone": "+442071685732", "fax": "", "charityNumber": "1077897", "facebook": "", "twitter": ""}{"charityLegalName": "Balls to Cancer", "imageURL": "", "charityWebsite": "http://www.ballstocancer.com", "smallDescription": "", "longDescription": "", "addressLine1": "The Lodge Mason Street Coseley", "state": "West Midlands", "country": "UK", "postcode": "WV149SZ", "telephone": "", "fax": "", "charityNumber": "1146185", "facebook": "", "twitter": ""}{"charityLegalName": "Partially Sighted Society", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/partially-sighted-society-1520/partially-sighted-society.jpg", "charityWebsite": "https://www.partsight.org.uk/", "smallDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight...", "longDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight. The Partially Sighted Society has been in existence for over 50 years. Our aim is to help people with sight loss make the best use of their remaining vision. From our professionally equipped sight centre in Doncaster we provide a range of services to support anybody living with sight loss. These include: - Free Low Vision Assessments. Our professional low vision assessment has access to the latest aids and equipment to help you continue to live life independently. - Sight tests. We are a registered NHS Sight Test Centre and anyone can book an appointment with our part time Optometrist, who is as passionate about low vision as we are. We do not dispense spectacles, however, if new glasses are prescribed you can then take this to an optician of your choice. Our sight test clinic is ideal for those with learning disabilities or dementia. Our waiting area is never busy and we have supportive, caring staff. - Pss Print. Our print room offers a unique range of bold-lined stationery, exercise books, diaries and calendars. Andre, our print room manager, understands the challenges of visual impairment and is on hand to advise. We also offer a bespoke print service and free Visual Impairment Assessment Packs with samples of all our printed material. - Information and Support groups. Come and meet new people and learn new things at our variety of support and activity groups.", "addressLine1": "1 Bennetthorpe", "state": "South Yorkshire", "country": "UK", "postcode": "DN26AA", "telephone": "+441302965195", "fax": "+441302556587", "charityNumber": "254052", "facebook": "", "twitter": ""}{"charityLegalName": "Hospice of the Valleys (Hosbis y Cymoedd)", "imageURL": "https://www.charitychoice.co.uk/media/profile/h/hospice-of-the-valleys-hosbis-y-cymoedd-4189/Hospice%20of%20the%20Valleys%20logo.jpg", "charityWebsite": "http://www.hospiceofthevalleys.org.uk", "smallDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer...", "longDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer. Our team of specialist Nurses, Social Workers, Welfare Rights Officers and Therapists are able to help patients and their families deal with the challenges such a diagnosis brings. Our service is free and available 24hrs a day all year for the people of Blaenau Gwent.", "addressLine1": "Festival Drive", "state": "Blaenau Gwent", "country": "UK", "postcode": "NP238XF", "telephone": "+441495717277", "fax": "+441495724188", "charityNumber": "517724", "facebook": "", "twitter": ""}{"charityLegalName": "Cinnamon Trust - Helping Elderly and Terminally ill People and their Pets", "imageURL": "https://www.charitychoice.co.uk/media/profile/c/cinnamon-trust-helping-elderly-people-and-pets-1075/cinnamontrust.jpg", "charityWebsite": "http://www.cinnamon.org.uk", "smallDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty...", "longDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty. We step in to ensure that any problem encountered in the day to day care of a pet can be overcome and all the benefits of owning a pet can be preserved. Our aims are achieved by tasking a national network of over 6,000 volunteers to provide any assistance required including walking dogs and pet fostering. We operate a national register of 752 care homes/sheltered housing for the elderly that will accept pets. A principal concern for elderly and terminally ill pet owners is the long term care of beloved pets. We provide lifetime care for pets whose owners have died either in our unique home from home sanctuaries or in long term foster homes. We rely entirely on donations and legacies. We make no charge for our services. Peace of mind and practical help for people - love, care and safety for their pets.", "addressLine1": "10 Market Square", "state": "Cornwall", "country": "UK", "postcode": "TR274HE", "telephone": "+441736757900", "fax": "+441736757010", "charityNumber": "1134680", "facebook": "", "twitter": ""}{"charityLegalName": "Wythall Animal Sanctuary", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/wythall-animal-sanctuary-1258/top.jpg", "charityWebsite": "https://wythallanimalrescue.org/", "smallDescription": "Wythall Animal Sanctuary was founded by Mr...", "longDescription": "Wythall Animal Sanctuary was founded by Mr. & Mrs. E. Davies in 1968, whose aim was to save and find homes for as many unwanted pets as possible. Many thousands have been found new homes since then. Many of these animals may otherwise have been destroyed. We have a non-destruction policy and we are the last hope for these animals. As our name signifies we give them Sanctuary. We take in, when possible, animals for rehoming and some of these animals will not be fit for rehoming and will live the rest of their lives with us. We pick up all the bills, including veterinary bills, for our residents both long-term and animals for rehoming. It costs £4,000 a week to keep the Sanctuary running and we rely entirely on donations, fundraising and Wills to continue our work. Other ways you can help are by Sponsoring an Animal, Leave a gift in your Will or by becoming a 'Friend' of Wythall Animal Sanctuary.", "addressLine1": "Middle Lane Kings Norton", "state": "West Midlands", "country": "UK", "postcode": "B380DU", "telephone": "+441564823288", "fax": "", "charityNumber": "1137681", "facebook": "", "twitter": ""}{"charityLegalName": "St Kentigern Hospice and Palliative Care Centre, St Asaph, Denbighshire", "imageURL": "https://www.charitychoice.co.uk/media/profile/s/st-kentigern-hospice-and-palliative-care-centre-st-asaph-denbighshire-4300/St%20Kentigern%20logo.jpg", "charityWebsite": "http://www.stkentigernhospice.org.uk", "smallDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day...", "longDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day. We provide a relaxed, homely and informal environment for people with a diagnosis of cancer. Other services include physiotherapy, aromatherapy, reflexology, chiropody, and much more. We make no charge to our patients or their carers. Any donations received would be greatly appreciated.", "addressLine1": "St Kentigern Hospice Upper Denbigh Road", "state": "Denbighshire", "country": "UK", "postcode": "LL170RS", "telephone": "+441745585221", "fax": "+441745585224", "charityNumber": "519931", "facebook": "", "twitter": ""}{"charityLegalName": "Walsall Society for the Blind", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/walsallsocietyfortheblind/Walsall-logo.jpg", "charityWebsite": "http://www.walsallblind.org", "smallDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall...", "longDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall. Walsall Society for the Blind has been a flagship for sight loss services in the Walsall Borough for over 100 years. We currently have over 1500 visually impaired individuals on our database who have already made use of our services. With a total of 22 staff, we provide a seamless package of sight loss services across the Borough. From the early intervention of the Eye Clinic Liaison Officer (ECLO) to the Community Services, we can help anyone experiencing a sight loss, whether it is temporary or permanent, newly diagnosed or long standing. We also provide information and support to their families, carers and friends. At WSB we understand how devastating sight loss can be, and we realise the consequences of living with it can be dramatic. We aim to do our best by our service users, by making our services known from the first possible point, and carrying our support and guidance through for as long as the individual needs it.", "addressLine1": "Hawley House 11 Hatherton Road", "state": "West Midlands", "country": "UK", "postcode": "WS11XS", "telephone": "+441922627683", "fax": "", "charityNumber": "1075854", "facebook": "http://www.facebook.com/pages/Walsall-Society-for-the-Blind/213993005340708", "twitter": ""}{"charityLegalName": "Oak Tree Animals' Charity", "imageURL": "https://www.charitychoice.co.uk/media/profile/o/oaktreeanimalscharity/OTAC-logoOrange-small.jpg", "charityWebsite": "https://www.oaktreeanimals.org.uk/", "smallDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle...", "longDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle. Its also a safe haven for stray, abandoned or unwanted dogs and cats who are awaiting new homes through our Adoption Programme. Every year Oak Tree takes in hundreds of lost or unwanted animals and gives them a second chance. We rehabilitate the animals, but we also prepare potential owners for life with a new companion and offer the help and support necessary for both animal and owner to live a long and happy life together. Our work in the community means that loving pet owners can find the information and resources they need to keep their animals happy, healthy and in good homes. We also support unowned animals such as feral cats through our Trap Neuter Return (TNR) programme. We use educational campaigns to raise awareness and change perceptions, hoping to provide a brighter future for animals in all walks of society. Our team speaks to schools, community groups and colleges about animal welfare and offers advice on working with animals in the future, investing in our younger generations and providing them with the knowledge they need to help animals in the long term.", "addressLine1": "Oak Tree Farm Wetheral Shields", "state": "Cumbria", "country": "UK", "postcode": "CA48JA", "telephone": "+441228560082", "fax": "+441228560985", "charityNumber": "1001169511", "facebook": "https://www.facebook.com/oaktreeanimals", "twitter": ""}{"charityLegalName": "Psoriasis and Psoriatic Arthritis Alliance (PAPAA)", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/psoriasis-and-psoriatic-arthritis-alliance-papaa-17015/top_wiki.jpg", "charityWebsite": "http://www.papaa.org", "smallDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis...", "longDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis.", "addressLine1": "Unit 3 Horseshoe Business Park Lye Lane Bricket Wood", "state": "Hertfordshire", "country": "UK", "postcode": "AL23TA", "telephone": "+441923672837", "fax": "+441923682606", "charityNumber": "1118192", "facebook": "", "twitter": ""}{"charityLegalName": "Murray Hall Community Trust", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Manjula Patel The Bridge St Marks Road West Midlands", "state": "West Midlands", "country": "UK", "postcode": "DY40SL", "telephone": "+441216121807", "fax": "", "charityNumber": "1040170", "facebook": "", "twitter": ""}{"charityLegalName": "Walsall Community Church (Walsall Money Advice Project)", "imageURL": "", "charityWebsite": "http://www.wmap.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "51 Bradford Street", "state": "West Midlands", "country": "UK", "postcode": "WS13QD", "telephone": "+441922623292", "fax": "+441922632803", "charityNumber": "1076491", "facebook": "", "twitter": ""}{"charityLegalName": "Blyth All Weather Lifeboat", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Old Tugboat Jetty High Quay Blyth", "state": "", "country": "UK", "postcode": "NE242AZ", "telephone": "", "fax": "", "charityNumber": "1124987", "facebook": "", "twitter": ""}{"charityLegalName": "Palace for All", "imageURL": "", "charityWebsite": "http://www.palaceforall.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Scholefield Road", "state": "", "country": "UK", "postcode": "N193ES", "telephone": "+442075611689", "fax": "+442075611689", "charityNumber": "1051112", "facebook": "", "twitter": ""}{"charityLegalName": "Naturally Africa Foundation", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "5 Golding Gardens East Peckham Tonbridge", "state": "", "country": "UK", "postcode": "TN125PB", "telephone": "+442081230301", "fax": "", "charityNumber": "1137411", "facebook": "", "twitter": ""}{"charityLegalName": "The Gallions Music Trust", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "c/o Gallions Primary School Warwall Beckton", "state": "", "country": "UK", "postcode": "E66WG", "telephone": "", "fax": "", "charityNumber": "1141927", "facebook": "", "twitter": ""}{"charityLegalName": "Faith In Action International Rally", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "40 Pennington Way London", "state": "", "country": "UK", "postcode": "SE129QB", "telephone": "+447588681256", "fax": "", "charityNumber": "1147063", "facebook": "", "twitter": ""}{"charityLegalName": "Midlands Asthma and Allergy Research Association (MAARA)", "imageURL": "", "charityWebsite": "http://www.maara.org", "smallDescription": "", "longDescription": "", "addressLine1": "PO Box 1057", "state": "Leicestershire", "country": "UK", "postcode": "LE23GZ", "telephone": "+441162479888", "fax": "", "charityNumber": "257131", "facebook": "", "twitter": ""}{"charityLegalName": "Tweed Valley Mountain Rescue", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Rescue Centre Goslawdales Selkirk", "state": "Scottish Borders", "country": "UK", "postcode": "TD74EP", "telephone": "+447974301431", "fax": "", "charityNumber": "009451", "facebook": "", "twitter": ""}{"charityLegalName": "Priscilla Bacon Lodge Palliative Care Unit", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Colman Hospital Unthank Road", "state": "Norfolk", "country": "UK", "postcode": "NR22PJ", "telephone": "+441603288981ext.4981", "fax": "+441603288988", "charityNumber": "278667", "facebook": "", "twitter": ""}{"charityLegalName": "Allan And Nesta Ferguson Charitable Settlement", "imageURL": "", "charityWebsite": "", "smallDescription": "Allan And Nesta Ferguson makes grants to help the poor and it also supports education projects...", "longDescription": "Allan And Nesta Ferguson makes grants to help the poor and it also supports education projects.", "addressLine1": "High Street Bishops Stortford Herts", "state": "", "country": "UK", "postcode": "CM232LU", "telephone": "+441279755200", "fax": "", "charityNumber": "275487", "facebook": "", "twitter": ""}{"charityLegalName": "Tilney St Lawrence Village Hall And Recreation Ground", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "2b Westfields Close Tilney St. Lawrence King's Lynn Norfolk", "state": "", "country": "UK", "postcode": "PE344QW", "telephone": "+441945880215", "fax": "", "charityNumber": "304092", "facebook": "", "twitter": ""}{"charityLegalName": "Allsorts Gloucestershire", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "65 Bisley Old Road Stroud Gloucestershire", "state": "", "country": "UK", "postcode": "GL51NF", "telephone": "+441453-764438", "fax": "", "charityNumber": "1153484", "facebook": "", "twitter": ""}{"charityLegalName": "Severn Valley Railway Charitable Trust Limited", "imageURL": "", "charityWebsite": "https://www.svrtrust.org.uk/", "smallDescription": "Not many of the quarter of a million visitors who come every year to the Severn Valley Railway will realise the scale of the costs involved in keeping the line going...", "longDescription": "Not many of the quarter of a million visitors who come every year to the Severn Valley Railway will realise the scale of the costs involved in keeping the line going. Whilst its day-to-day operation is covered by ticket sales and profits from catering and retail outlets, the SVR needs substantial additional funding to restore and maintain both infrastructure and rolling stock. Unless these investments are made, over time, piece by piece, the whole railway will grind to a halt. And that's not something any of us want to contemplate. By donating to the SVR Charitable Trust you will be helping to fund rolling stock restoration, infrastructure restoration, apprentice training and investment for the future. The Charitable Trust plays a key role in funding many projects across the railway: there's the £1.3 million project to restore Falling Sands Viaduct, the £1 million restoration of locomotive 4930 'Hagley Hall' and numerous heritage carriage restorations, including GWR 9581, which we believe will have the first ever specially designed buffet counter for wheelchair-using passengers. Please donate through our website to help preserve this wonderful heritage asset.", "addressLine1": "Number One Comberton Place", "state": "Worcestershire", "country": "UK", "postcode": "DY101QR", "telephone": "+441562757940", "fax": "", "charityNumber": "1092723", "facebook": "@svrofficial", "twitter": ""}{"charityLegalName": "Active4All", "imageURL": "", "charityWebsite": "http://www.active4all.info", "smallDescription": "", "longDescription": "", "addressLine1": "10 Holmwood Avenue Uddingston", "state": "", "country": "UK", "postcode": "G717AJ", "telephone": "+441698815400", "fax": "+441698580482", "charityNumber": "4036591", "facebook": "", "twitter": ""}{"charityLegalName": "Teign Valley Sea Cadets", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "1 Chantry Close", "state": "Devon", "country": "UK", "postcode": "TQ148FE", "telephone": "+441626772285", "fax": "", "charityNumber": "1102518", "facebook": "", "twitter": ""}{"charityLegalName": "Animal Care Trust", "imageURL": "", "charityWebsite": "http://www.rvc.ac.uk/act", "smallDescription": "", "longDescription": "", "addressLine1": "Royal Veterinary College Animal Care Trust Hawkshead Lane", "state": "Hertfordshire", "country": "UK", "postcode": "AL97TA", "telephone": "+441707666333", "fax": "", "charityNumber": "281571", "facebook": "", "twitter": ""}{"charityLegalName": "Health Workers For All Ltd", "imageURL": "", "charityWebsite": "http://www.healthworkersforall.org/", "smallDescription": "Established in 2012 Health Workers for All was first set up in 2007 under the programme name Medic to Medic as an innovative scheme to support trainee health workers in low-income countries...", "longDescription": "Established in 2012 Health Workers for All was first set up in 2007 under the programme name Medic to Medic as an innovative scheme to support trainee health workers in low-income countries. Many countries suffer from a chronic shortage of health works to provide health services to their population, particularly in rural areas. Health Workers for All focus on supporting those who are most likely to drop out from their training for financial or pastoral reasons, such as students from rural areas, students with non-professional parents and students with little family support such as orphans. For the past five years, Medic to Medic has operated as an independent programme within an umbrella charity (The International Medical Education Trust 2000  IMET2000). By 2012, we had expanded enough to become an independent organisation: Health Workers For All in which we run our current programmes: Medic to Medic (supporting medical students), REACH (physiotherapy students) and New Solutions (pharmacy students). Aim We aim to support trainee health workers throughout their education who are in financial need but have academic potential. What we do Our programs link students to donors, in this way we function along the lines of sponsor a child schemes run by well-known charities. Although we link individual students, we pool our donations so that even if a donor withdraws, no student is disadvantaged. Our students send their linked sponsor regular updates on their progress. This can be developed into a correspondence if the donor wishes. We hope this will not only provide mentoring advice for medical students, but will also raise awareness of the conditions facing medical colleagues worldwide.", "addressLine1": "NPIMR (TT Block) C/o Northwick Park Hospital Watford Road", "state": "Middlesex", "country": "UK", "postcode": "HA13UJ", "telephone": "+442088693603", "fax": "", "charityNumber": "1149904", "facebook": "https://www.facebook.com/MedictoMedic", "twitter": ""}{"charityLegalName": "Football Foundation, The", "imageURL": "", "charityWebsite": "", "smallDescription": "The Football Foundation is the UKs largest sports charity...", "longDescription": "The Football Foundation is the UKs largest sports charity. Funded by the Premier League, The Football Association and the Government, the Foundation directs £30m every year into grass roots sport.", "addressLine1": "72c Crawthew Grove", "state": "", "country": "UK", "postcode": "SE229AB", "telephone": "", "fax": "", "charityNumber": "1079309", "facebook": "", "twitter": ""}{"charityLegalName": "Look: National Federation of Families with Visually Impaired Children", "imageURL": "", "charityWebsite": "http://www.look-uk.org", "smallDescription": "LOOK's Vision and Mission The Vision of LOOK is to be one of the first points of contact and guidance for families with children affected by visual impairment...", "longDescription": "LOOK's Vision and Mission The Vision of LOOK is to be one of the first points of contact and guidance for families with children affected by visual impairment. The Mission of LOOK is to improve the lives of families with visually impaired children and young people by providing support, information and activities.", "addressLine1": "c/o The Royal National College for the Blind Venns Lane", "state": "Herefordshire", "country": "UK", "postcode": "HR11DT", "telephone": "+441432376314", "fax": "", "charityNumber": "1140471", "facebook": "", "twitter": ""}{"charityLegalName": "Sheffield Galleries and Museums Trust", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Leader House Surrey Street", "state": "South Yorkshire", "country": "UK", "postcode": "S12LH", "telephone": "", "fax": "", "charityNumber": "1068850", "facebook": "", "twitter": ""}{"charityLegalName": "The Seeing Dogs Alliance", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "116 Potters Lane Send", "state": "Surrey", "country": "UK", "postcode": "GU237AL", "telephone": "+441483765556", "fax": "", "charityNumber": "510224", "facebook": "", "twitter": ""}{"charityLegalName": "Cornwall Deaf Centre", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "8 Brunton Road Pool Redruth", "state": "", "country": "UK", "postcode": "TR153SL", "telephone": "+441209613829", "fax": "", "charityNumber": "1000759", "facebook": "", "twitter": ""}{"charityLegalName": "The Ringsfield Hall Trust", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Ringsfield Hall Ringsfield", "state": "Suffolk", "country": "UK", "postcode": "NR348JR", "telephone": "+441502713020", "fax": "+441502710615", "charityNumber": "1093404", "facebook": "", "twitter": ""}{"charityLegalName": "Small Dole Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "9 Hoewood Small Dole Henfield West Sussex", "state": "", "country": "UK", "postcode": "BN59YR", "telephone": "+441273494831", "fax": "", "charityNumber": "275112", "facebook": "", "twitter": ""}{"charityLegalName": "Village Hall - Winterborne Whitechurch", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "2 Queens Square Winterborne Whitechurch Blandford Forum Dorset", "state": "", "country": "UK", "postcode": "DT110AF", "telephone": "+441258881204", "fax": "", "charityNumber": "209082", "facebook": "", "twitter": ""}{"charityLegalName": "Hospitaller Order of Saint John of God", "imageURL": "", "charityWebsite": "http://www.hospitaller.org.uk", "smallDescription": "The Hospitaller Order of Saint John of God is an international Religious Order of Brothers providing health, social care and pastoral services to sick, vulnerable and disadvantaged people in fifty-two countries throughout the world...", "longDescription": "The Hospitaller Order of Saint John of God is an international Religious Order of Brothers providing health, social care and pastoral services to sick, vulnerable and disadvantaged people in fifty-two countries throughout the world.", "addressLine1": "Saint Bede's House Morton Park Way", "state": "Co. Durham", "country": "UK", "postcode": "DL14NZ", "telephone": "+441325373701", "fax": "+441325373707", "charityNumber": "232539", "facebook": "", "twitter": ""}{"charityLegalName": "Burton Physically Handicapped And Disabled Club", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "33 Lansdowne Road Branston Burton On Trent", "state": "", "country": "UK", "postcode": "DE143EW", "telephone": "+441283512504", "fax": "", "charityNumber": "1024233", "facebook": "", "twitter": ""}{"charityLegalName": "Born To Shine Challenge Ltd", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Bethel House Lansdowne Place London", "state": "", "country": "UK", "postcode": "SE14XH", "telephone": "+442074079996", "fax": "", "charityNumber": "1142350", "facebook": "", "twitter": ""}{"charityLegalName": "Northern Ballet Theatre", "imageURL": "", "charityWebsite": "http://www.nbt.co.uk", "smallDescription": "Northern Ballet Theatre produces and performs ballets and works to improve the UK's cultural heritage and understanding...", "longDescription": "Northern Ballet Theatre produces and performs ballets and works to improve the UK's cultural heritage and understanding.", "addressLine1": "West Park Centre Spen Lane", "state": "West Yorkshire", "country": "UK", "postcode": "LS165BE", "telephone": "+441132745355", "fax": "+441132208001", "charityNumber": "259140", "facebook": "", "twitter": ""}{"charityLegalName": "Rhydlewis Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Twrgwyn Rhydlewis Llandysul Dyfed", "state": "", "country": "UK", "postcode": "SA445RY", "telephone": "+441239851617", "fax": "", "charityNumber": "508456", "facebook": "", "twitter": ""}{"charityLegalName": "Saint John of God Hospitaller Services", "imageURL": "", "charityWebsite": "https://www.saintjohnofgod.org", "smallDescription": "Saint John of God Hospitaller Services supports the sick, the disabled and the elderly in their times of need...", "longDescription": "Saint John of God Hospitaller Services supports the sick, the disabled and the elderly in their times of need.", "addressLine1": "Saint Bede's House Morton Park Way", "state": "Co. Durham", "country": "UK", "postcode": "DL14XZ", "telephone": "+441325373700", "fax": "+441325373707", "charityNumber": "1108428", "facebook": "", "twitter": ""}{"charityLegalName": "Cinnamon Trust - Helping Elderly and Terminally ill People and their Pets", "imageURL": "https://www.charitychoice.co.uk/media/profile/c/cinnamon-trust-helping-elderly-people-and-pets-1075/cinnamontrust.jpg", "charityWebsite": "http://www.cinnamon.org.uk", "smallDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty...", "longDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty. We step in to ensure that any problem encountered in the day to day care of a pet can be overcome and all the benefits of owning a pet can be preserved. Our aims are achieved by tasking a national network of over 6,000 volunteers to provide any assistance required including walking dogs and pet fostering. We operate a national register of 752 care homes/sheltered housing for the elderly that will accept pets. A principal concern for elderly and terminally ill pet owners is the long term care of beloved pets. We provide lifetime care for pets whose owners have died either in our unique home from home sanctuaries or in long term foster homes. We rely entirely on donations and legacies. We make no charge for our services. Peace of mind and practical help for people - love, care and safety for their pets.", "addressLine1": "10 Market Square", "state": "Cornwall", "country": "UK", "postcode": "TR274HE", "telephone": "+441736757900", "fax": "+441736757010", "charityNumber": "1134680", "facebook": "", "twitter": ""}{"charityLegalName": "St Kentigern Hospice and Palliative Care Centre, St Asaph, Denbighshire", "imageURL": "https://www.charitychoice.co.uk/media/profile/s/st-kentigern-hospice-and-palliative-care-centre-st-asaph-denbighshire-4300/St%20Kentigern%20logo.jpg", "charityWebsite": "http://www.stkentigernhospice.org.uk", "smallDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day...", "longDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day. We provide a relaxed, homely and informal environment for people with a diagnosis of cancer. Other services include physiotherapy, aromatherapy, reflexology, chiropody, and much more. We make no charge to our patients or their carers. Any donations received would be greatly appreciated.", "addressLine1": "St Kentigern Hospice Upper Denbigh Road", "state": "Denbighshire", "country": "UK", "postcode": "LL170RS", "telephone": "+441745585221", "fax": "+441745585224", "charityNumber": "519931", "facebook": "", "twitter": ""}{"charityLegalName": "Hospice of the Valleys (Hosbis y Cymoedd)", "imageURL": "https://www.charitychoice.co.uk/media/profile/h/hospice-of-the-valleys-hosbis-y-cymoedd-4189/Hospice%20of%20the%20Valleys%20logo.jpg", "charityWebsite": "http://www.hospiceofthevalleys.org.uk", "smallDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer...", "longDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer. Our team of specialist Nurses, Social Workers, Welfare Rights Officers and Therapists are able to help patients and their families deal with the challenges such a diagnosis brings. Our service is free and available 24hrs a day all year for the people of Blaenau Gwent.", "addressLine1": "Festival Drive", "state": "Blaenau Gwent", "country": "UK", "postcode": "NP238XF", "telephone": "+441495717277", "fax": "+441495724188", "charityNumber": "517724", "facebook": "", "twitter": ""}{"charityLegalName": "Wythall Animal Sanctuary", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/wythall-animal-sanctuary-1258/top.jpg", "charityWebsite": "https://wythallanimalrescue.org/", "smallDescription": "Wythall Animal Sanctuary was founded by Mr...", "longDescription": "Wythall Animal Sanctuary was founded by Mr. & Mrs. E. Davies in 1968, whose aim was to save and find homes for as many unwanted pets as possible. Many thousands have been found new homes since then. Many of these animals may otherwise have been destroyed. We have a non-destruction policy and we are the last hope for these animals. As our name signifies we give them Sanctuary. We take in, when possible, animals for rehoming and some of these animals will not be fit for rehoming and will live the rest of their lives with us. We pick up all the bills, including veterinary bills, for our residents both long-term and animals for rehoming. It costs £4,000 a week to keep the Sanctuary running and we rely entirely on donations, fundraising and Wills to continue our work. Other ways you can help are by Sponsoring an Animal, Leave a gift in your Will or by becoming a 'Friend' of Wythall Animal Sanctuary.", "addressLine1": "Middle Lane Kings Norton", "state": "West Midlands", "country": "UK", "postcode": "B380DU", "telephone": "+441564823288", "fax": "", "charityNumber": "1137681", "facebook": "", "twitter": ""}{"charityLegalName": "Partially Sighted Society", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/partially-sighted-society-1520/partially-sighted-society.jpg", "charityWebsite": "https://www.partsight.org.uk/", "smallDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight...", "longDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight. The Partially Sighted Society has been in existence for over 50 years. Our aim is to help people with sight loss make the best use of their remaining vision. From our professionally equipped sight centre in Doncaster we provide a range of services to support anybody living with sight loss. These include: - Free Low Vision Assessments. Our professional low vision assessment has access to the latest aids and equipment to help you continue to live life independently. - Sight tests. We are a registered NHS Sight Test Centre and anyone can book an appointment with our part time Optometrist, who is as passionate about low vision as we are. We do not dispense spectacles, however, if new glasses are prescribed you can then take this to an optician of your choice. Our sight test clinic is ideal for those with learning disabilities or dementia. Our waiting area is never busy and we have supportive, caring staff. - Pss Print. Our print room offers a unique range of bold-lined stationery, exercise books, diaries and calendars. Andre, our print room manager, understands the challenges of visual impairment and is on hand to advise. We also offer a bespoke print service and free Visual Impairment Assessment Packs with samples of all our printed material. - Information and Support groups. Come and meet new people and learn new things at our variety of support and activity groups.", "addressLine1": "1 Bennetthorpe", "state": "South Yorkshire", "country": "UK", "postcode": "DN26AA", "telephone": "+441302965195", "fax": "+441302556587", "charityNumber": "254052", "facebook": "", "twitter": ""}{"charityLegalName": "Psoriasis and Psoriatic Arthritis Alliance (PAPAA)", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/psoriasis-and-psoriatic-arthritis-alliance-papaa-17015/top_wiki.jpg", "charityWebsite": "http://www.papaa.org", "smallDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis...", "longDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis.", "addressLine1": "Unit 3 Horseshoe Business Park Lye Lane Bricket Wood", "state": "Hertfordshire", "country": "UK", "postcode": "AL23TA", "telephone": "+441923672837", "fax": "+441923682606", "charityNumber": "1118192", "facebook": "", "twitter": ""}{"charityLegalName": "Oak Tree Animals' Charity", "imageURL": "https://www.charitychoice.co.uk/media/profile/o/oaktreeanimalscharity/OTAC-logoOrange-small.jpg", "charityWebsite": "https://www.oaktreeanimals.org.uk/", "smallDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle...", "longDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle. Its also a safe haven for stray, abandoned or unwanted dogs and cats who are awaiting new homes through our Adoption Programme. Every year Oak Tree takes in hundreds of lost or unwanted animals and gives them a second chance. We rehabilitate the animals, but we also prepare potential owners for life with a new companion and offer the help and support necessary for both animal and owner to live a long and happy life together. Our work in the community means that loving pet owners can find the information and resources they need to keep their animals happy, healthy and in good homes. We also support unowned animals such as feral cats through our Trap Neuter Return (TNR) programme. We use educational campaigns to raise awareness and change perceptions, hoping to provide a brighter future for animals in all walks of society. Our team speaks to schools, community groups and colleges about animal welfare and offers advice on working with animals in the future, investing in our younger generations and providing them with the knowledge they need to help animals in the long term.", "addressLine1": "Oak Tree Farm Wetheral Shields", "state": "Cumbria", "country": "UK", "postcode": "CA48JA", "telephone": "+441228560082", "fax": "+441228560985", "charityNumber": "1001169511", "facebook": "https://www.facebook.com/oaktreeanimals", "twitter": ""}{"charityLegalName": "Walsall Society for the Blind", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/walsallsocietyfortheblind/Walsall-logo.jpg", "charityWebsite": "http://www.walsallblind.org", "smallDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall...", "longDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall. Walsall Society for the Blind has been a flagship for sight loss services in the Walsall Borough for over 100 years. We currently have over 1500 visually impaired individuals on our database who have already made use of our services. With a total of 22 staff, we provide a seamless package of sight loss services across the Borough. From the early intervention of the Eye Clinic Liaison Officer (ECLO) to the Community Services, we can help anyone experiencing a sight loss, whether it is temporary or permanent, newly diagnosed or long standing. We also provide information and support to their families, carers and friends. At WSB we understand how devastating sight loss can be, and we realise the consequences of living with it can be dramatic. We aim to do our best by our service users, by making our services known from the first possible point, and carrying our support and guidance through for as long as the individual needs it.", "addressLine1": "Hawley House 11 Hatherton Road", "state": "West Midlands", "country": "UK", "postcode": "WS11XS", "telephone": "+441922627683", "fax": "", "charityNumber": "1075854", "facebook": "http://www.facebook.com/pages/Walsall-Society-for-the-Blind/213993005340708", "twitter": ""}{"charityLegalName": "Glamis Hall For All", "imageURL": "", "charityWebsite": "http://www.glamishall.org.uk", "smallDescription": "Who Are We? We are a group of friends who came together in 2014 to save Glamis Hall from closure...", "longDescription": "Who Are We? We are a group of friends who came together in 2014 to save Glamis Hall from closure. We became a registered charity (No. 1160317) in early 2015 to help us provide services at Glamis Hall for the community. What is Glamis Hall? Glamis Hall is a community centre on the Queensway Estate in Wellingborough, Northamptonshire. It consists of a wellbeing centre for elderly people, a large sports hall with kitchen and servery, community room and football changing rooms. Our Mission To provide a Community Hub for the residents of the Borough of Wellingborough and the surrounding areas.", "addressLine1": "Glamis Hall Day Centre Goldsmith Road Wellingborough", "state": "", "country": "UK", "postcode": "NN83RU", "telephone": "+441933677326", "fax": "", "charityNumber": "1160317", "facebook": "https://www.facebook.com/GlamisHall/", "twitter": ""}{"charityLegalName": "Hernhill Village Hall And Playing Fields", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Belvedere Dargate Faversham", "state": "", "country": "UK", "postcode": "ME139HH", "telephone": "+441227750791", "fax": "", "charityNumber": "302762", "facebook": "", "twitter": ""}{"charityLegalName": "John Marshall's Charity", "imageURL": "", "charityWebsite": "", "smallDescription": "Marshalls Charity was founded in 1631 at the bequest of John Marshall...", "longDescription": "Marshalls Charity was founded in 1631 at the bequest of John Marshall. Its purposes have evolved over the centuries and today the charity exists to support the Church of England and Church in Wales by making grants towards the repair of parsonages and churches", "addressLine1": "66 Newcomen Street", "state": "", "country": "UK", "postcode": "SE11YT", "telephone": "+442074072979", "fax": "", "charityNumber": "206780", "facebook": "", "twitter": ""}{"charityLegalName": "Pallant House Gallery", "imageURL": "", "charityWebsite": "", "smallDescription": "Pallant House Gallery supports the education of the public in the fine arts and the history of domestic architecture by keeping the House open to the public...", "longDescription": "Pallant House Gallery supports the education of the public in the fine arts and the history of domestic architecture by keeping the House open to the public.", "addressLine1": "9 North Pallant", "state": "West Sussex", "country": "UK", "postcode": "PO191TJ", "telephone": "+441243774557", "fax": "", "charityNumber": "1102435", "facebook": "", "twitter": ""}{"charityLegalName": "Restorer Ministries-God's Bible Church Of All Nations", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "15 Baronscourt Leeds", "state": "", "country": "UK", "postcode": "LS157AP", "telephone": "+441132646975", "fax": "", "charityNumber": "327906", "facebook": "", "twitter": ""}{"charityLegalName": "Queen's Hall Help Committee", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Wigan Methodist Mission 46 Market Street Wigan", "state": "", "country": "UK", "postcode": "WN11HX", "telephone": "+441942244358", "fax": "", "charityNumber": "506518", "facebook": "", "twitter": ""}{"charityLegalName": "St Michael's and All Saints Charity", "imageURL": "", "charityWebsite": "", "smallDescription": "The charity's trust maintains the property of the charity...", "longDescription": "The charity's trust maintains the property of the charity.", "addressLine1": "Cornmarket Street", "state": "Oxfordshire", "country": "UK", "postcode": "OX13EY", "telephone": "+441865240940", "fax": "", "charityNumber": "261304", "facebook": "", "twitter": ""}{"charityLegalName": "Donisthorpe Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "Donisthorpe Hall is a residential nursing home for the Jewish elderly...", "longDescription": "Donisthorpe Hall is a residential nursing home for the Jewish elderly.", "addressLine1": "Shadwell Lane", "state": "West Yorkshire", "country": "UK", "postcode": "LS176AW", "telephone": "+441132684248", "fax": "", "charityNumber": "1077573", "facebook": "", "twitter": ""}{"charityLegalName": "Ludgershall Pre-School Playgroup", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Short Street Ludgershall", "state": "Hampshire", "country": "UK", "postcode": "SP119RB", "telephone": "+441264790999", "fax": "", "charityNumber": "1020800", "facebook": "", "twitter": ""}{"charityLegalName": "The Shelsleys Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "8 The Bungalows Shelsley Beauchamp", "state": "Worcestershire", "country": "UK", "postcode": "WR66RD", "telephone": "+441886812180", "fax": "", "charityNumber": "523190", "facebook": "", "twitter": ""}{"charityLegalName": "Home-Start Pendle And Ribble Valley", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Suite 1 Bridgewater House Surrey Road Nelson Lancashire", "state": "", "country": "UK", "postcode": "BB97TZ", "telephone": "+441282690536", "fax": "", "charityNumber": "1106092", "facebook": "", "twitter": ""}{"charityLegalName": "Reall (formerly Homeless International)", "imageURL": "", "charityWebsite": "http://www.homeless-international.org", "smallDescription": "Transforming slums, creating homes Urban poverty is a massive and growing issue, but it is often poorly understood, underestimated and unrecognised...", "longDescription": "Transforming slums, creating homes Urban poverty is a massive and growing issue, but it is often poorly understood, underestimated and unrecognised. Almost one billion people  a sixth of the worlds total population  live in slums, and this figure will increase to 1.4 billion by 2020 if urgent action is not taken to address urban poverty. Reall believes that building a home is the most powerful step a family can take to improve its living conditions. We help communities transform slums by supporting them to secure land, build decent homes, get safe water and sanitation, and negotiate with governments  ensuring that they have a voice that gets heard. Each year our work reaches thousands of households throughout Africa and Asia, helping to create safe, healthy and secure communities. Whether through leaving a gift or making a donation today, please help us continue our work  transforming slums and creating homes.", "addressLine1": "8-14 Harnall Row", "state": "West Midlands", "country": "UK", "postcode": "CV15DR", "telephone": "+442475093340", "fax": "", "charityNumber": "1017255041976", "facebook": "http://www.facebook.com/reallint", "twitter": ""}{"charityLegalName": "Care 4 All (north East Lincolnshire) Ltd", "imageURL": "", "charityWebsite": "http://www.care4all.org.uk", "smallDescription": "Care4all are a local charity providing services for older people and people with disabilities within North East Lincolnshire...", "longDescription": "Care4all are a local charity providing services for older people and people with disabilities within North East Lincolnshire. Our day opportunities are provided from four health and wellbeing centres throughout Immingham, Grimsby and Cleethorpes. Older Peoples Day Services offer a wide range of activities and social events to promote independence, encourage involvement and social interaction, and reduce isolation. The aim is to support people to live their chosen lifestyle in their own homes for as long as possible and also, if appropriate, provide respite for carers. We also operate a Meals Plus service in which hot nutritious meals are delivered to peoples homes. The service is much more than just a delivery service as our drivers are aware that they may be a persons only visitor that day and an element of care is included. This can range from helping with the meal to monitoring and reporting food and fluid intake, medication prompts and social interaction. Disability Services provide a range of activities and opportunities within both centre and local community based settings to support adults with learning and/or physical disabilities to enjoy meaningful, purposeful lives of their choice. Another service provide by Care4all is Personal Assistant Support Solutions (PASS), this is a matching service for adults with physical or learning disabilities, mental health problems or long term illness who are seeking to employ a personal assistant to support them to live independently and lead the best quality of life possible. Care4all operate a number of enterprises including a garden centre, a chain of cafes, charity shop, textile banks and specially adapted holiday chalet. Each of these unique enterprises provides real employment opportunities to local people with disabilities in a range of different roles, including horticulture and gardening, retail, catering and administration. The jobs they create improve lives through helping to enhance peoples self-esteem and confidence by being included in society. All profits made are reinvested back into the organisation to develop the business further.", "addressLine1": "Queen Street Resource Centre Queen Street Grimsby North East Lincolnshire", "state": "", "country": "UK", "postcode": "DN311QG", "telephone": "+441472571100", "fax": "", "charityNumber": "41146255", "facebook": "https://www.facebook.com/Care4allNEL", "twitter": ""}{"charityLegalName": "The Jane Goodall Institute - UK (JGI): Wildlife Research, Conservation and Education", "imageURL": "", "charityWebsite": "http://www.janegoodall.org;%20www.rootsnshoots.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Suite 9 Orchard House 51-67 Commercial Road", "state": "Hampshire", "country": "UK", "postcode": "SO151GG", "telephone": "+442380335660", "fax": "", "charityNumber": "327858", "facebook": "", "twitter": ""}{"charityLegalName": "Arthritis Action", "imageURL": "", "charityWebsite": "http://www.arthritisaction.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "56 Buckingham Gate", "state": "", "country": "UK", "postcode": "SW1E6AE", "telephone": "+442037817128", "fax": "", "charityNumber": "292569", "facebook": "", "twitter": ""}{"charityLegalName": "Friends of Visually Impaired Children in the Gambia", "imageURL": "", "charityWebsite": "http://www.friendsofgovi.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "1 Humber Close Caister-On-Sea", "state": "Norfolk", "country": "UK", "postcode": "NR305UF", "telephone": "+441493721506", "fax": "+441493721506", "charityNumber": "1070173", "facebook": "", "twitter": ""}{"charityLegalName": "B.l.i.z.e. All Breed Rescue", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "27 Moorland Way Poole", "state": "", "country": "UK", "postcode": "BH165JY", "telephone": "+447850661375", "fax": "", "charityNumber": "1162925", "facebook": "", "twitter": ""}{"charityLegalName": "The By All Means Gospel Trust", "imageURL": "", "charityWebsite": "http://www.bam-gospeltrust.org", "smallDescription": "", "longDescription": "", "addressLine1": "353 Station Road Dorridge", "state": "West Midlands", "country": "UK", "postcode": "B938EY", "telephone": "+441564771185", "fax": "", "charityNumber": "231070", "facebook": "", "twitter": ""}{"charityLegalName": "Choices 4 All", "imageURL": "", "charityWebsite": "http://www.choices4all.co.uk", "smallDescription": "Choices 4 All : Reach Your Potential...", "longDescription": "Choices 4 All : Reach Your Potential. Choices 4 All is a training provider with a difference. It succeeds with individuals, aged 18 years and over, who have learning disabilities and difficulties who need a training approach to be responsive to their learning style and access needs. The training approach used by Choices 4 All caters for those students who do not flourish in the more conventional training environment. Choices 4 All offers training to learners in life and living skills, functional skills of English, Mathematics and Information Communication Technology, catering and hospitality skills, employability skills and independence. Choices 4 All's training is geared to those students with learning difficulties who wish to acquire comprehensive employability and independent living skills and successfully gain progression into employment or further education.", "addressLine1": "The 21 Building 21 Pinner Road Harrow Middlesex", "state": "", "country": "UK", "postcode": "HA14ES", "telephone": "+442084240848", "fax": "", "charityNumber": "41077111", "facebook": "https://www.facebook.com/Choices4All?rf=143763619070631", "twitter": ""}{"charityLegalName": "International Musicians Seminar, Prussia Cove, Cornwall", "imageURL": "", "charityWebsite": "http://www.i-m-s.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "32 Grafton Square", "state": "", "country": "UK", "postcode": "SW40DB", "telephone": "+442077209020", "fax": "+442077209033", "charityNumber": "270204", "facebook": "", "twitter": ""}{"charityLegalName": "Cornwall Wildlife Trust", "imageURL": "", "charityWebsite": "http://www.cornwallwildlifetrust.org.uk", "smallDescription": "We are the leading local wildlife charity working to protect Cornwall's wildlife and wild places, ensuring all money raised in Cornwall, stays in Cornwall...", "longDescription": "We are the leading local wildlife charity working to protect Cornwall's wildlife and wild places, ensuring all money raised in Cornwall, stays in Cornwall. With over 57 nature reserves and thousands of acres of land, we work tirelessly to protect and support Cornwall's landscape. Reporting, rescuing, restoring or recording we work with volunteers and local groups to learn more about this stuning corner of England.", "addressLine1": "Five Acres", "state": "Cornwall", "country": "UK", "postcode": "TR49DJ", "telephone": "+441872273939", "fax": "+441872225478", "charityNumber": "214929", "facebook": "https://www.facebook.com/CornwallWildlife", "twitter": ""}{"charityLegalName": "Rhydlewis Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Twrgwyn Rhydlewis Llandysul Dyfed", "state": "", "country": "UK", "postcode": "SA445RY", "telephone": "+441239851617", "fax": "", "charityNumber": "508456", "facebook": "", "twitter": ""}{"charityLegalName": "Pallottine Missionary Sisters Of The Catholic Apostolate", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "52 Park Mount Drive", "state": "Cheshire", "country": "UK", "postcode": "SK118NT", "telephone": "+441625616459", "fax": "", "charityNumber": "234185", "facebook": "", "twitter": ""}{"charityLegalName": "Look: National Federation of Families with Visually Impaired Children", "imageURL": "", "charityWebsite": "http://www.look-uk.org", "smallDescription": "LOOK's Vision and Mission The Vision of LOOK is to be one of the first points of contact and guidance for families with children affected by visual impairment...", "longDescription": "LOOK's Vision and Mission The Vision of LOOK is to be one of the first points of contact and guidance for families with children affected by visual impairment. The Mission of LOOK is to improve the lives of families with visually impaired children and young people by providing support, information and activities.", "addressLine1": "c/o The Royal National College for the Blind Venns Lane", "state": "Herefordshire", "country": "UK", "postcode": "HR11DT", "telephone": "+441432376314", "fax": "", "charityNumber": "1140471", "facebook": "", "twitter": ""}{"charityLegalName": "Royal Victoria Hall Foundation (1880)", "imageURL": "", "charityWebsite": "http://www.rvhf.org", "smallDescription": "", "longDescription": "", "addressLine1": "111 Green Street", "state": "Middlesex", "country": "UK", "postcode": "TW166QX", "telephone": "+441932782341", "fax": "", "charityNumber": "1880211246", "facebook": "", "twitter": ""}{"charityLegalName": "Allchurches Trust Ltd", "imageURL": "", "charityWebsite": "http://www.allchurches.co.uk", "smallDescription": "All Churches Trust promotes Christianity by promoting and supporting charitable work in the UK...", "longDescription": "All Churches Trust promotes Christianity by promoting and supporting charitable work in the UK.", "addressLine1": "Beaufort House Brunswick Road", "state": "Gloucestershire", "country": "UK", "postcode": "GL11JZ", "telephone": "+441452528533", "fax": "+441452308860", "charityNumber": "263960", "facebook": "", "twitter": ""}{"charityLegalName": "The Wrightson Allotments", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "6 Meadow Close Shaftesbury Dorset", "state": "", "country": "UK", "postcode": "SP78EF", "telephone": "+447841027045", "fax": "", "charityNumber": "264589", "facebook": "", "twitter": ""}{"charityLegalName": "Dallas Road Parent Teacher Association", "imageURL": "", "charityWebsite": "http://www.dallasroad.lancs.sch.uk/", "smallDescription": "", "longDescription": "", "addressLine1": "Dallas Road Primary School High Street", "state": "Lancashire", "country": "UK", "postcode": "LA11LD", "telephone": "+44152464520", "fax": "", "charityNumber": "1012366", "facebook": "", "twitter": ""}{"charityLegalName": "Bennington Hall Trust Fund", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "20 Withyholt Park Charlton Kings Cheltenham", "state": "", "country": "UK", "postcode": "GL539BP", "telephone": "+441242231644", "fax": "", "charityNumber": "262688", "facebook": "", "twitter": ""}{"charityLegalName": "Pallant House Gallery", "imageURL": "", "charityWebsite": "", "smallDescription": "Pallant House Gallery supports the education of the public in the fine arts and the history of domestic architecture by keeping the House open to the public...", "longDescription": "Pallant House Gallery supports the education of the public in the fine arts and the history of domestic architecture by keeping the House open to the public.", "addressLine1": "9 North Pallant", "state": "West Sussex", "country": "UK", "postcode": "PO191TJ", "telephone": "+441243774557", "fax": "", "charityNumber": "1102435", "facebook": "", "twitter": ""}{"charityLegalName": "Lamport Hall Preservation Trust", "imageURL": "", "charityWebsite": "", "smallDescription": "Lamport Hall Preservation Trust oversees the stewardship of the Hall, contents and estate, including the restoration of the Hall and gardens, so that it can be used as a public resource...", "longDescription": "Lamport Hall Preservation Trust oversees the stewardship of the Hall, contents and estate, including the restoration of the Hall and gardens, so that it can be used as a public resource.", "addressLine1": "Lamport", "state": "Northamptonshire", "country": "UK", "postcode": "NN69HD", "telephone": "+441604686272", "fax": "", "charityNumber": "267999", "facebook": "", "twitter": ""}{"charityLegalName": "The Totally Different Playscheme", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "79 Harford Drive", "state": "Hertfordshire", "country": "UK", "postcode": "WD173DQ", "telephone": "+441923244196", "fax": "", "charityNumber": "1110386", "facebook": "", "twitter": ""}{"charityLegalName": "Hospice of the Valleys (Hosbis y Cymoedd)", "imageURL": "https://www.charitychoice.co.uk/media/profile/h/hospice-of-the-valleys-hosbis-y-cymoedd-4189/Hospice%20of%20the%20Valleys%20logo.jpg", "charityWebsite": "http://www.hospiceofthevalleys.org.uk", "smallDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer...", "longDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer. Our team of specialist Nurses, Social Workers, Welfare Rights Officers and Therapists are able to help patients and their families deal with the challenges such a diagnosis brings. Our service is free and available 24hrs a day all year for the people of Blaenau Gwent.", "addressLine1": "Festival Drive", "state": "Blaenau Gwent", "country": "UK", "postcode": "NP238XF", "telephone": "+441495717277", "fax": "+441495724188", "charityNumber": "517724", "facebook": "", "twitter": ""}{"charityLegalName": "Cinnamon Trust - Helping Elderly and Terminally ill People and their Pets", "imageURL": "https://www.charitychoice.co.uk/media/profile/c/cinnamon-trust-helping-elderly-people-and-pets-1075/cinnamontrust.jpg", "charityWebsite": "http://www.cinnamon.org.uk", "smallDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty...", "longDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty. We step in to ensure that any problem encountered in the day to day care of a pet can be overcome and all the benefits of owning a pet can be preserved. Our aims are achieved by tasking a national network of over 6,000 volunteers to provide any assistance required including walking dogs and pet fostering. We operate a national register of 752 care homes/sheltered housing for the elderly that will accept pets. A principal concern for elderly and terminally ill pet owners is the long term care of beloved pets. We provide lifetime care for pets whose owners have died either in our unique home from home sanctuaries or in long term foster homes. We rely entirely on donations and legacies. We make no charge for our services. Peace of mind and practical help for people - love, care and safety for their pets.", "addressLine1": "10 Market Square", "state": "Cornwall", "country": "UK", "postcode": "TR274HE", "telephone": "+441736757900", "fax": "+441736757010", "charityNumber": "1134680", "facebook": "", "twitter": ""}{"charityLegalName": "Wythall Animal Sanctuary", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/wythall-animal-sanctuary-1258/top.jpg", "charityWebsite": "https://wythallanimalrescue.org/", "smallDescription": "Wythall Animal Sanctuary was founded by Mr...", "longDescription": "Wythall Animal Sanctuary was founded by Mr. & Mrs. E. Davies in 1968, whose aim was to save and find homes for as many unwanted pets as possible. Many thousands have been found new homes since then. Many of these animals may otherwise have been destroyed. We have a non-destruction policy and we are the last hope for these animals. As our name signifies we give them Sanctuary. We take in, when possible, animals for rehoming and some of these animals will not be fit for rehoming and will live the rest of their lives with us. We pick up all the bills, including veterinary bills, for our residents both long-term and animals for rehoming. It costs £4,000 a week to keep the Sanctuary running and we rely entirely on donations, fundraising and Wills to continue our work. Other ways you can help are by Sponsoring an Animal, Leave a gift in your Will or by becoming a 'Friend' of Wythall Animal Sanctuary.", "addressLine1": "Middle Lane Kings Norton", "state": "West Midlands", "country": "UK", "postcode": "B380DU", "telephone": "+441564823288", "fax": "", "charityNumber": "1137681", "facebook": "", "twitter": ""}{"charityLegalName": "Partially Sighted Society", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/partially-sighted-society-1520/partially-sighted-society.jpg", "charityWebsite": "https://www.partsight.org.uk/", "smallDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight...", "longDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight. The Partially Sighted Society has been in existence for over 50 years. Our aim is to help people with sight loss make the best use of their remaining vision. From our professionally equipped sight centre in Doncaster we provide a range of services to support anybody living with sight loss. These include: - Free Low Vision Assessments. Our professional low vision assessment has access to the latest aids and equipment to help you continue to live life independently. - Sight tests. We are a registered NHS Sight Test Centre and anyone can book an appointment with our part time Optometrist, who is as passionate about low vision as we are. We do not dispense spectacles, however, if new glasses are prescribed you can then take this to an optician of your choice. Our sight test clinic is ideal for those with learning disabilities or dementia. Our waiting area is never busy and we have supportive, caring staff. - Pss Print. Our print room offers a unique range of bold-lined stationery, exercise books, diaries and calendars. Andre, our print room manager, understands the challenges of visual impairment and is on hand to advise. We also offer a bespoke print service and free Visual Impairment Assessment Packs with samples of all our printed material. - Information and Support groups. Come and meet new people and learn new things at our variety of support and activity groups.", "addressLine1": "1 Bennetthorpe", "state": "South Yorkshire", "country": "UK", "postcode": "DN26AA", "telephone": "+441302965195", "fax": "+441302556587", "charityNumber": "254052", "facebook": "", "twitter": ""}{"charityLegalName": "St Kentigern Hospice and Palliative Care Centre, St Asaph, Denbighshire", "imageURL": "https://www.charitychoice.co.uk/media/profile/s/st-kentigern-hospice-and-palliative-care-centre-st-asaph-denbighshire-4300/St%20Kentigern%20logo.jpg", "charityWebsite": "http://www.stkentigernhospice.org.uk", "smallDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day...", "longDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day. We provide a relaxed, homely and informal environment for people with a diagnosis of cancer. Other services include physiotherapy, aromatherapy, reflexology, chiropody, and much more. We make no charge to our patients or their carers. Any donations received would be greatly appreciated.", "addressLine1": "St Kentigern Hospice Upper Denbigh Road", "state": "Denbighshire", "country": "UK", "postcode": "LL170RS", "telephone": "+441745585221", "fax": "+441745585224", "charityNumber": "519931", "facebook": "", "twitter": ""}{"charityLegalName": "Walsall Society for the Blind", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/walsallsocietyfortheblind/Walsall-logo.jpg", "charityWebsite": "http://www.walsallblind.org", "smallDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall...", "longDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall. Walsall Society for the Blind has been a flagship for sight loss services in the Walsall Borough for over 100 years. We currently have over 1500 visually impaired individuals on our database who have already made use of our services. With a total of 22 staff, we provide a seamless package of sight loss services across the Borough. From the early intervention of the Eye Clinic Liaison Officer (ECLO) to the Community Services, we can help anyone experiencing a sight loss, whether it is temporary or permanent, newly diagnosed or long standing. We also provide information and support to their families, carers and friends. At WSB we understand how devastating sight loss can be, and we realise the consequences of living with it can be dramatic. We aim to do our best by our service users, by making our services known from the first possible point, and carrying our support and guidance through for as long as the individual needs it.", "addressLine1": "Hawley House 11 Hatherton Road", "state": "West Midlands", "country": "UK", "postcode": "WS11XS", "telephone": "+441922627683", "fax": "", "charityNumber": "1075854", "facebook": "http://www.facebook.com/pages/Walsall-Society-for-the-Blind/213993005340708", "twitter": ""}{"charityLegalName": "Psoriasis and Psoriatic Arthritis Alliance (PAPAA)", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/psoriasis-and-psoriatic-arthritis-alliance-papaa-17015/top_wiki.jpg", "charityWebsite": "http://www.papaa.org", "smallDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis...", "longDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis.", "addressLine1": "Unit 3 Horseshoe Business Park Lye Lane Bricket Wood", "state": "Hertfordshire", "country": "UK", "postcode": "AL23TA", "telephone": "+441923672837", "fax": "+441923682606", "charityNumber": "1118192", "facebook": "", "twitter": ""}{"charityLegalName": "Oak Tree Animals' Charity", "imageURL": "https://www.charitychoice.co.uk/media/profile/o/oaktreeanimalscharity/OTAC-logoOrange-small.jpg", "charityWebsite": "https://www.oaktreeanimals.org.uk/", "smallDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle...", "longDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle. Its also a safe haven for stray, abandoned or unwanted dogs and cats who are awaiting new homes through our Adoption Programme. Every year Oak Tree takes in hundreds of lost or unwanted animals and gives them a second chance. We rehabilitate the animals, but we also prepare potential owners for life with a new companion and offer the help and support necessary for both animal and owner to live a long and happy life together. Our work in the community means that loving pet owners can find the information and resources they need to keep their animals happy, healthy and in good homes. We also support unowned animals such as feral cats through our Trap Neuter Return (TNR) programme. We use educational campaigns to raise awareness and change perceptions, hoping to provide a brighter future for animals in all walks of society. Our team speaks to schools, community groups and colleges about animal welfare and offers advice on working with animals in the future, investing in our younger generations and providing them with the knowledge they need to help animals in the long term.", "addressLine1": "Oak Tree Farm Wetheral Shields", "state": "Cumbria", "country": "UK", "postcode": "CA48JA", "telephone": "+441228560082", "fax": "+441228560985", "charityNumber": "1001169511", "facebook": "https://www.facebook.com/oaktreeanimals", "twitter": ""}{"charityLegalName": "Rastrick Juniors Football Club", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "14 Bramston Gardens Rastrick Brighouse West Yorkshire 14 Bramston Gardens", "state": "", "country": "UK", "postcode": "HD63AG", "telephone": "+447818070105", "fax": "", "charityNumber": "1148067", "facebook": "", "twitter": ""}{"charityLegalName": "Action Against Allergy", "imageURL": "", "charityWebsite": "http://www.actionagainstallergy.co.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Action Against Allergy PO Box 278", "state": "London", "country": "UK", "postcode": "TW14QQ", "telephone": "+442088922711", "fax": "", "charityNumber": "276637", "facebook": "", "twitter": ""}{"charityLegalName": "All Saints Educational Trust", "imageURL": "", "charityWebsite": "http://www.aset.org.uk", "smallDescription": "The Trust makes grants to help with the costs of the formal training or better qualification of individual teachers, and also funds educational advance by other means, eg research...", "longDescription": "The Trust makes grants to help with the costs of the formal training or better qualification of individual teachers, and also funds educational advance by other means, eg research.", "addressLine1": "Suite 8c First Floor Royal London House 22-25 Finsbury Square", "state": "", "country": "UK", "postcode": "EC2A1DX", "telephone": "+442079206465", "fax": "", "charityNumber": "312934", "facebook": "", "twitter": ""}{"charityLegalName": "H B Allen Charitable Trust", "imageURL": "", "charityWebsite": "http://www.hballenct.org.uk", "smallDescription": "The charity supports general charitable purposes by making grants to charities in the UK...", "longDescription": "The charity supports general charitable purposes by making grants to charities in the UK.", "addressLine1": "Chidden Holt Hambleton", "state": "Hampshire", "country": "UK", "postcode": "PO74TG", "telephone": "+442392632406", "fax": "", "charityNumber": "802306", "facebook": "", "twitter": ""}{"charityLegalName": "Restorer Ministries-God's Bible Church Of All Nations", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "15 Baronscourt Leeds", "state": "", "country": "UK", "postcode": "LS157AP", "telephone": "+441132646975", "fax": "", "charityNumber": "327906", "facebook": "", "twitter": ""}{"charityLegalName": "Rhydlewis Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Twrgwyn Rhydlewis Llandysul Dyfed", "state": "", "country": "UK", "postcode": "SA445RY", "telephone": "+441239851617", "fax": "", "charityNumber": "508456", "facebook": "", "twitter": ""}{"charityLegalName": "Alliance for Inclusive Education", "imageURL": "", "charityWebsite": "http://www.allfie.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "336 Brixton Road Brixton", "state": "", "country": "UK", "postcode": "SW97AA", "telephone": "+442077376030", "fax": "", "charityNumber": "1124424", "facebook": "", "twitter": ""}{"charityLegalName": "Rolladome All Skate Limited", "imageURL": "", "charityWebsite": "http://www.rolladome.org.uk", "smallDescription": "Who we are RollaDome All Skate was established in 2009 in North-West London and is a Charity, offering the complete roller skating package from skating lessons and training to roller discos...", "longDescription": "Who we are RollaDome All Skate was established in 2009 in North-West London and is a Charity, offering the complete roller skating package from skating lessons and training to roller discos. We are made up of committed staff who are all keen to make a difference to young peoples lives by encouraging them to be active, learn a new skill, stay healthy and participate in a family based activity. What we do We provide roller skating lessons for young people from as young as four to 18. We have run a number of successful school holiday projects, youth and community engagement projects and family events. Why we do it We are committed to providing roller skating as a positive and healthy recreational activity for, but not exclusively to, young people. We aim to improve their health and fitness, educational and recreational attainment and in doing so provide a safe and nurturing environment where they can learn valuable skills, improve their dexterity and have fun while doing so! Our Programs All our programs are for children and adults of all ages and abilities, and are available to organisations, schools, and individuals. Our programs are provided in a safe environment where all involved learn valuable skills: These include: Improving balance and coordination strengthening endurance Learning self-discipline both on and off the skate rink Improving life skills, mentoring, discipline and motivation", "addressLine1": "26 Newark Crescent London", "state": "", "country": "UK", "postcode": "NW107BD", "telephone": "+442088381171", "fax": "", "charityNumber": "1138918", "facebook": "https://www.facebook.com/rolla.dome", "twitter": ""}{"charityLegalName": "1st Shepton Mallett Scout Group", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Uphill Cottage Church Street Croscombe", "state": "Somerset", "country": "UK", "postcode": "BA53QS", "telephone": "+441749343910", "fax": "", "charityNumber": "1271155", "facebook": "", "twitter": ""}{"charityLegalName": "Dance Professionals Fund", "imageURL": "", "charityWebsite": "https://www.dancefund.org.uk/", "smallDescription": "The Dance Professionals Fund (the working name of the Royal Ballet Benevolent Fund) aims to support people in the dance world throughout their lives...", "longDescription": "The Dance Professionals Fund (the working name of the Royal Ballet Benevolent Fund) aims to support people in the dance world throughout their lives. We are the leading UK charity offering financial assistance for individuals during their dance careers and into retirement. We help professional dancers, choreographers and choreologists, as well as dance teachers. It does not matter whether you have worked for a major dance company or as an independent dancer.", "addressLine1": "113 Queens Road", "state": "Brighton & Hove", "country": "UK", "postcode": "BN13XG", "telephone": "+441273234011", "fax": "", "charityNumber": "207477", "facebook": "www.facebook.com/danceprofessionalsfund", "twitter": ""}{"charityLegalName": "Cornwall Hospice Care", "imageURL": "", "charityWebsite": "http://www.cornwallhospicecare.co.uk", "smallDescription": "Cornwall Hospice Care have two centres in Cornwall that provide their patients with free 24 hour residential palliative care, lymphoedema treatment, physio therapy, bereavement support and more...", "longDescription": "Cornwall Hospice Care have two centres in Cornwall that provide their patients with free 24 hour residential palliative care, lymphoedema treatment, physio therapy, bereavement support and more. The outpatient service includes an outreach program where consultants visit patients living at home or in nursing facilities within 48 hours of a request being made. A care advice line is also open 24 hours a day and the centre is actively involved in the training of professionals going into this field.", "addressLine1": "Daniels Lane Holmbush", "state": "Cornwall", "country": "UK", "postcode": "PL253HS", "telephone": "+44172666868", "fax": "", "charityNumber": "1113140", "facebook": "", "twitter": ""}{"charityLegalName": "Almond Valley Heritage Trust, The", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Livingstone Mill Millfield", "state": "West Lothian", "country": "UK", "postcode": "EH547AR", "telephone": "+441506414957", "fax": "+441506497771", "charityNumber": "013783", "facebook": "", "twitter": ""}{"charityLegalName": "St Michaels & All Angels Episcopal Church Inverness", "imageURL": "", "charityWebsite": "http://www.angelforce.co.uk/stmichael", "smallDescription": "", "longDescription": "", "addressLine1": "St Michaels Rectory Abban Street", "state": "Highland", "country": "UK", "postcode": "IV38HH", "telephone": "+441463233797", "fax": "", "charityNumber": "010352", "facebook": "", "twitter": ""}{"charityLegalName": "Hospitaller Order of Saint John of God", "imageURL": "", "charityWebsite": "http://www.hospitaller.org.uk", "smallDescription": "The Hospitaller Order of Saint John of God is an international Religious Order of Brothers providing health, social care and pastoral services to sick, vulnerable and disadvantaged people in fifty-two countries throughout the world...", "longDescription": "The Hospitaller Order of Saint John of God is an international Religious Order of Brothers providing health, social care and pastoral services to sick, vulnerable and disadvantaged people in fifty-two countries throughout the world.", "addressLine1": "Saint Bede's House Morton Park Way", "state": "Co. Durham", "country": "UK", "postcode": "DL14NZ", "telephone": "+441325373701", "fax": "+441325373707", "charityNumber": "232539", "facebook": "", "twitter": ""}{"charityLegalName": "Small Steps Foundation", "imageURL": "", "charityWebsite": "http://www.smallstepsfoundation.com", "smallDescription": "", "longDescription": "", "addressLine1": "25 Southdown Crescent Cheadle Hulme", "state": "Greater Manchester", "country": "UK", "postcode": "SK86EQ", "telephone": "+441614828802", "fax": "", "charityNumber": "1138643", "facebook": "", "twitter": ""}{"charityLegalName": "Galleywood Heritage Centre", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "237 Barnard Road Chelmsford", "state": "", "country": "UK", "postcode": "CM28RU", "telephone": "+441245475263", "fax": "", "charityNumber": "1128416", "facebook": "", "twitter": ""}{"charityLegalName": "Naturally Africa Foundation", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "5 Golding Gardens East Peckham Tonbridge", "state": "", "country": "UK", "postcode": "TN125PB", "telephone": "+442081230301", "fax": "", "charityNumber": "1137411", "facebook": "", "twitter": ""}{"charityLegalName": "Beyond the Wall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Thornham Walled Garden Thornham Magna", "state": "Suffolk", "country": "UK", "postcode": "IP238HA", "telephone": "+441379788700", "fax": "", "charityNumber": "292229", "facebook": "", "twitter": ""}{"charityLegalName": "Smallpeice Trust", "imageURL": "", "charityWebsite": "http://www.smallpeicetrust.org.uk", "smallDescription": "Smallpeice Trust promotes education in engineering technology and engineering as a career...", "longDescription": "Smallpeice Trust promotes education in engineering technology and engineering as a career.", "addressLine1": "74 Upper Holly Walk", "state": "Warwickshire", "country": "UK", "postcode": "CV324JL", "telephone": "+441926333207", "fax": "", "charityNumber": "313719", "facebook": "", "twitter": ""}{"charityLegalName": "Hallam Diocesan Caring Services (Hallam Diocese)", "imageURL": "", "charityWebsite": "", "smallDescription": "Hallam Diocese works to promote the Roman Catholic religion in the local area...", "longDescription": "Hallam Diocese works to promote the Roman Catholic religion in the local area.", "addressLine1": "St Wilfrid's Centre 524 Queens Road", "state": "South Yorkshire", "country": "UK", "postcode": "S24DT", "telephone": "+441142580000", "fax": "+441142580000", "charityNumber": "512021", "facebook": "", "twitter": ""}{"charityLegalName": "English National Ballet School", "imageURL": "", "charityWebsite": "http://www.enbschool.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Carlyle Building Hortensia Road", "state": "", "country": "UK", "postcode": "SW100QS", "telephone": "+442073766253", "fax": "+442073763404", "charityNumber": "800512", "facebook": "", "twitter": ""}{"charityLegalName": "Royal Victoria Hall Foundation (1880)", "imageURL": "", "charityWebsite": "http://www.rvhf.org", "smallDescription": "", "longDescription": "", "addressLine1": "111 Green Street", "state": "Middlesex", "country": "UK", "postcode": "TW166QX", "telephone": "+441932782341", "fax": "", "charityNumber": "1880211246", "facebook": "", "twitter": ""}{"charityLegalName": "Snettisham Memorial Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Memorial Hall 13 Old Church Road", "state": "Norfolk", "country": "UK", "postcode": "PE317QT", "telephone": "+441485545838", "fax": "", "charityNumber": "304065", "facebook": "", "twitter": ""}{"charityLegalName": "The Dream Valley Association", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "45 Moorthorne Crescent", "state": "Tyne & Wear", "country": "UK", "postcode": "ST58HR", "telephone": "", "fax": "", "charityNumber": "1071814", "facebook": "", "twitter": ""}{"charityLegalName": "Wetley Rocks Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "9 Folly Fields Cheddleton", "state": "Staffordshire", "country": "UK", "postcode": "ST137BX", "telephone": "+441782551739", "fax": "", "charityNumber": "522636", "facebook": "", "twitter": ""}{"charityLegalName": "Village Hall - Winterborne Whitechurch", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "2 Queens Square Winterborne Whitechurch Blandford Forum Dorset", "state": "", "country": "UK", "postcode": "DT110AF", "telephone": "+441258881204", "fax": "", "charityNumber": "209082", "facebook": "", "twitter": ""}{"charityLegalName": "Birtley Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Old Post Office Birtley Hexham", "state": "", "country": "UK", "postcode": "NE483HL", "telephone": "+447786562912", "fax": "", "charityNumber": "522033", "facebook": "", "twitter": ""}{"charityLegalName": "Menfa Mentoring For All", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "1a Maria Street, Butetown Cardiff", "state": "", "country": "UK", "postcode": "CF105HG", "telephone": "+442920487058", "fax": "", "charityNumber": "1083162", "facebook": "", "twitter": ""}{"charityLegalName": "Watts Gallery", "imageURL": "", "charityWebsite": "http://www.wattsgallery.org.uk/", "smallDescription": "Watts Gallery promotes the wider knowledge and appreciation of the works of G...", "longDescription": "Watts Gallery promotes the wider knowledge and appreciation of the works of G. F. Watts and Mrs Mary Watts within the wider context of nineteenth-century art and runs a gallery to showcase their works.", "addressLine1": "Down Lane", "state": "Surrey", "country": "UK", "postcode": "GU31DH", "telephone": "+441483810235", "fax": "", "charityNumber": "313612", "facebook": "", "twitter": ""}{"charityLegalName": "Cornwall Search & Rescue", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Melyn Dhowr Cottage Tregoose", "state": "Cornwall", "country": "UK", "postcode": "TR84NE", "telephone": "+441637881647", "fax": "", "charityNumber": "1100708", "facebook": "", "twitter": ""}{"charityLegalName": "Restorer Ministries-God's Bible Church Of All Nations", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "15 Baronscourt Leeds", "state": "", "country": "UK", "postcode": "LS157AP", "telephone": "+441132646975", "fax": "", "charityNumber": "327906", "facebook": "", "twitter": ""}{"charityLegalName": "The Queen's Hall", "imageURL": "", "charityWebsite": "http://www.thequeenshall.net", "smallDescription": "", "longDescription": "", "addressLine1": "Clerk Street", "state": "", "country": "UK", "postcode": "EH89JG", "telephone": "+441316683456", "fax": "+441316682656", "charityNumber": "012294", "facebook": "", "twitter": ""}{"charityLegalName": "Cinnamon Trust - Helping Elderly and Terminally ill People and their Pets", "imageURL": "https://www.charitychoice.co.uk/media/profile/c/cinnamon-trust-helping-elderly-people-and-pets-1075/cinnamontrust.jpg", "charityWebsite": "http://www.cinnamon.org.uk", "smallDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty...", "longDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty. We step in to ensure that any problem encountered in the day to day care of a pet can be overcome and all the benefits of owning a pet can be preserved. Our aims are achieved by tasking a national network of over 6,000 volunteers to provide any assistance required including walking dogs and pet fostering. We operate a national register of 752 care homes/sheltered housing for the elderly that will accept pets. A principal concern for elderly and terminally ill pet owners is the long term care of beloved pets. We provide lifetime care for pets whose owners have died either in our unique home from home sanctuaries or in long term foster homes. We rely entirely on donations and legacies. We make no charge for our services. Peace of mind and practical help for people - love, care and safety for their pets.", "addressLine1": "10 Market Square", "state": "Cornwall", "country": "UK", "postcode": "TR274HE", "telephone": "+441736757900", "fax": "+441736757010", "charityNumber": "1134680", "facebook": "", "twitter": ""}{"charityLegalName": "St Kentigern Hospice and Palliative Care Centre, St Asaph, Denbighshire", "imageURL": "https://www.charitychoice.co.uk/media/profile/s/st-kentigern-hospice-and-palliative-care-centre-st-asaph-denbighshire-4300/St%20Kentigern%20logo.jpg", "charityWebsite": "http://www.stkentigernhospice.org.uk", "smallDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day...", "longDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day. We provide a relaxed, homely and informal environment for people with a diagnosis of cancer. Other services include physiotherapy, aromatherapy, reflexology, chiropody, and much more. We make no charge to our patients or their carers. Any donations received would be greatly appreciated.", "addressLine1": "St Kentigern Hospice Upper Denbigh Road", "state": "Denbighshire", "country": "UK", "postcode": "LL170RS", "telephone": "+441745585221", "fax": "+441745585224", "charityNumber": "519931", "facebook": "", "twitter": ""}{"charityLegalName": "Partially Sighted Society", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/partially-sighted-society-1520/partially-sighted-society.jpg", "charityWebsite": "https://www.partsight.org.uk/", "smallDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight...", "longDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight. The Partially Sighted Society has been in existence for over 50 years. Our aim is to help people with sight loss make the best use of their remaining vision. From our professionally equipped sight centre in Doncaster we provide a range of services to support anybody living with sight loss. These include: - Free Low Vision Assessments. Our professional low vision assessment has access to the latest aids and equipment to help you continue to live life independently. - Sight tests. We are a registered NHS Sight Test Centre and anyone can book an appointment with our part time Optometrist, who is as passionate about low vision as we are. We do not dispense spectacles, however, if new glasses are prescribed you can then take this to an optician of your choice. Our sight test clinic is ideal for those with learning disabilities or dementia. Our waiting area is never busy and we have supportive, caring staff. - Pss Print. Our print room offers a unique range of bold-lined stationery, exercise books, diaries and calendars. Andre, our print room manager, understands the challenges of visual impairment and is on hand to advise. We also offer a bespoke print service and free Visual Impairment Assessment Packs with samples of all our printed material. - Information and Support groups. Come and meet new people and learn new things at our variety of support and activity groups.", "addressLine1": "1 Bennetthorpe", "state": "South Yorkshire", "country": "UK", "postcode": "DN26AA", "telephone": "+441302965195", "fax": "+441302556587", "charityNumber": "254052", "facebook": "", "twitter": ""}{"charityLegalName": "Hospice of the Valleys (Hosbis y Cymoedd)", "imageURL": "https://www.charitychoice.co.uk/media/profile/h/hospice-of-the-valleys-hosbis-y-cymoedd-4189/Hospice%20of%20the%20Valleys%20logo.jpg", "charityWebsite": "http://www.hospiceofthevalleys.org.uk", "smallDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer...", "longDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer. Our team of specialist Nurses, Social Workers, Welfare Rights Officers and Therapists are able to help patients and their families deal with the challenges such a diagnosis brings. Our service is free and available 24hrs a day all year for the people of Blaenau Gwent.", "addressLine1": "Festival Drive", "state": "Blaenau Gwent", "country": "UK", "postcode": "NP238XF", "telephone": "+441495717277", "fax": "+441495724188", "charityNumber": "517724", "facebook": "", "twitter": ""}{"charityLegalName": "Wythall Animal Sanctuary", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/wythall-animal-sanctuary-1258/top.jpg", "charityWebsite": "https://wythallanimalrescue.org/", "smallDescription": "Wythall Animal Sanctuary was founded by Mr...", "longDescription": "Wythall Animal Sanctuary was founded by Mr. & Mrs. E. Davies in 1968, whose aim was to save and find homes for as many unwanted pets as possible. Many thousands have been found new homes since then. Many of these animals may otherwise have been destroyed. We have a non-destruction policy and we are the last hope for these animals. As our name signifies we give them Sanctuary. We take in, when possible, animals for rehoming and some of these animals will not be fit for rehoming and will live the rest of their lives with us. We pick up all the bills, including veterinary bills, for our residents both long-term and animals for rehoming. It costs £4,000 a week to keep the Sanctuary running and we rely entirely on donations, fundraising and Wills to continue our work. Other ways you can help are by Sponsoring an Animal, Leave a gift in your Will or by becoming a 'Friend' of Wythall Animal Sanctuary.", "addressLine1": "Middle Lane Kings Norton", "state": "West Midlands", "country": "UK", "postcode": "B380DU", "telephone": "+441564823288", "fax": "", "charityNumber": "1137681", "facebook": "", "twitter": ""}{"charityLegalName": "Psoriasis and Psoriatic Arthritis Alliance (PAPAA)", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/psoriasis-and-psoriatic-arthritis-alliance-papaa-17015/top_wiki.jpg", "charityWebsite": "http://www.papaa.org", "smallDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis...", "longDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis.", "addressLine1": "Unit 3 Horseshoe Business Park Lye Lane Bricket Wood", "state": "Hertfordshire", "country": "UK", "postcode": "AL23TA", "telephone": "+441923672837", "fax": "+441923682606", "charityNumber": "1118192", "facebook": "", "twitter": ""}{"charityLegalName": "Oak Tree Animals' Charity", "imageURL": "https://www.charitychoice.co.uk/media/profile/o/oaktreeanimalscharity/OTAC-logoOrange-small.jpg", "charityWebsite": "https://www.oaktreeanimals.org.uk/", "smallDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle...", "longDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle. Its also a safe haven for stray, abandoned or unwanted dogs and cats who are awaiting new homes through our Adoption Programme. Every year Oak Tree takes in hundreds of lost or unwanted animals and gives them a second chance. We rehabilitate the animals, but we also prepare potential owners for life with a new companion and offer the help and support necessary for both animal and owner to live a long and happy life together. Our work in the community means that loving pet owners can find the information and resources they need to keep their animals happy, healthy and in good homes. We also support unowned animals such as feral cats through our Trap Neuter Return (TNR) programme. We use educational campaigns to raise awareness and change perceptions, hoping to provide a brighter future for animals in all walks of society. Our team speaks to schools, community groups and colleges about animal welfare and offers advice on working with animals in the future, investing in our younger generations and providing them with the knowledge they need to help animals in the long term.", "addressLine1": "Oak Tree Farm Wetheral Shields", "state": "Cumbria", "country": "UK", "postcode": "CA48JA", "telephone": "+441228560082", "fax": "+441228560985", "charityNumber": "1001169511", "facebook": "https://www.facebook.com/oaktreeanimals", "twitter": ""}{"charityLegalName": "Walsall Society for the Blind", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/walsallsocietyfortheblind/Walsall-logo.jpg", "charityWebsite": "http://www.walsallblind.org", "smallDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall...", "longDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall. Walsall Society for the Blind has been a flagship for sight loss services in the Walsall Borough for over 100 years. We currently have over 1500 visually impaired individuals on our database who have already made use of our services. With a total of 22 staff, we provide a seamless package of sight loss services across the Borough. From the early intervention of the Eye Clinic Liaison Officer (ECLO) to the Community Services, we can help anyone experiencing a sight loss, whether it is temporary or permanent, newly diagnosed or long standing. We also provide information and support to their families, carers and friends. At WSB we understand how devastating sight loss can be, and we realise the consequences of living with it can be dramatic. We aim to do our best by our service users, by making our services known from the first possible point, and carrying our support and guidance through for as long as the individual needs it.", "addressLine1": "Hawley House 11 Hatherton Road", "state": "West Midlands", "country": "UK", "postcode": "WS11XS", "telephone": "+441922627683", "fax": "", "charityNumber": "1075854", "facebook": "http://www.facebook.com/pages/Walsall-Society-for-the-Blind/213993005340708", "twitter": ""}{"charityLegalName": "Kay Kendall Leukaemia Fund", "imageURL": "", "charityWebsite": "", "smallDescription": "Kay Kendall Leukaemia Fund funds charities and research working on the treatment of leukaemia...", "longDescription": "Kay Kendall Leukaemia Fund funds charities and research working on the treatment of leukaemia.", "addressLine1": "The Peak 5 Wilton Road", "state": "", "country": "UK", "postcode": "SW1V1AP", "telephone": "", "fax": "", "charityNumber": "290772", "facebook": "", "twitter": ""}{"charityLegalName": "Shri Vallabh Nidhi - UK", "imageURL": "", "charityWebsite": "", "smallDescription": "To advance the Hindu religion in accordance with the teaching of Shri Vallabh and in furtherance thereof to provide and maintain a temple for public religious worship and other religious charitable purpose...", "longDescription": "To advance the Hindu religion in accordance with the teaching of Shri Vallabh and in furtherance thereof to provide and maintain a temple for public religious worship and other religious charitable purposes", "addressLine1": "PO Box 700 Ealing Road", "state": "Middlesex", "country": "UK", "postcode": "HA04TA", "telephone": "+442089021742", "fax": "", "charityNumber": "277833", "facebook": "", "twitter": ""}{"charityLegalName": "The Waterfall Trust", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "12 Midanbury Lane Southampton", "state": "", "country": "UK", "postcode": "SO184HP", "telephone": "+442380223248", "fax": "", "charityNumber": "1148491", "facebook": "", "twitter": ""}{"charityLegalName": "Velindre Village Hall Fund", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Cae Glas Velindre Brecon Powys", "state": "", "country": "UK", "postcode": "LD30SY", "telephone": "+441497847529", "fax": "", "charityNumber": "501289", "facebook": "", "twitter": ""}{"charityLegalName": "Littlebourne War Memorial Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "50 The Hill Littlebourne Canterbury", "state": "", "country": "UK", "postcode": "CT31TA", "telephone": "+441227722476", "fax": "", "charityNumber": "302786", "facebook": "", "twitter": ""}{"charityLegalName": "Walsall Foster Carer's Association", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "2 Barbel Drive Wolverhampton", "state": "", "country": "UK", "postcode": "WV100TQ", "telephone": "+44122698127", "fax": "", "charityNumber": "1112154", "facebook": "", "twitter": ""}{"charityLegalName": "Allen Lane Foundation", "imageURL": "", "charityWebsite": "http://www.allenlane.org.uk", "smallDescription": "Allen Lane Foundation makes grants to support charitable causes...", "longDescription": "Allen Lane Foundation makes grants to support charitable causes. The Foundation particularly focuses on areas of social disadvantage and groups which the trustees feel are undeservedly unpopular.", "addressLine1": "90 The Mount", "state": "North Yorkshire", "country": "UK", "postcode": "YO241AR", "telephone": "+441904613223", "fax": "", "charityNumber": "248031", "facebook": "", "twitter": ""}{"charityLegalName": "Galloway Wildlife Conservation Trust", "imageURL": "", "charityWebsite": "http://gallowaywildlife.co.uk/contactus.php", "smallDescription": "", "longDescription": "", "addressLine1": "Lochfergus Plantation Kirkcudbright", "state": "Dumfries & Galloway", "country": "UK", "postcode": "DG64XX", "telephone": "+441557331645", "fax": "", "charityNumber": "042826", "facebook": "", "twitter": ""}{"charityLegalName": "Royal Victoria Hall Foundation (1880)", "imageURL": "", "charityWebsite": "http://www.rvhf.org", "smallDescription": "", "longDescription": "", "addressLine1": "111 Green Street", "state": "Middlesex", "country": "UK", "postcode": "TW166QX", "telephone": "+441932782341", "fax": "", "charityNumber": "1880211246", "facebook": "", "twitter": ""}{"charityLegalName": "Assessment and Qualifications Alliance", "imageURL": "", "charityWebsite": "http://www.aqa.org.uk", "smallDescription": "AQA provides and conduct national public examinations and in particular examinations for the award of GCE and GCSE...", "longDescription": "AQA provides and conduct national public examinations and in particular examinations for the award of GCE and GCSE.", "addressLine1": "Stag Hill House", "state": "Surrey", "country": "UK", "postcode": "GU27XJ", "telephone": "+448001977162", "fax": "", "charityNumber": "1073334", "facebook": "", "twitter": ""}{"charityLegalName": "The Parochial Church Council Of The Ecclesiastical Parish Of Crondall & Ewshot", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "30 Ashley Close Crondall Farnham", "state": "", "country": "UK", "postcode": "GU105RD", "telephone": "+441252851277", "fax": "", "charityNumber": "1128489", "facebook": "", "twitter": ""}{"charityLegalName": "Scarth Memorial Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "5 South Cleatlam Darlington", "state": "", "country": "UK", "postcode": "DL23QP", "telephone": "+441833660802", "fax": "", "charityNumber": "520586", "facebook": "", "twitter": ""}{"charityLegalName": "The Totally Different Playscheme", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "79 Harford Drive", "state": "Hertfordshire", "country": "UK", "postcode": "WD173DQ", "telephone": "+441923244196", "fax": "", "charityNumber": "1110386", "facebook": "", "twitter": ""}{"charityLegalName": "Chapel Saint Leonards Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Gordine, 4 Wellvale Close Chapel St Leonards", "state": "Lincolnshire", "country": "UK", "postcode": "PE245BH", "telephone": "+441754872346", "fax": "", "charityNumber": "521909", "facebook": "", "twitter": ""}{"charityLegalName": "Forth Valley College", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Grangemouth Road", "state": "", "country": "UK", "postcode": "FK29AD", "telephone": "", "fax": "", "charityNumber": "021191", "facebook": "", "twitter": ""}{"charityLegalName": "Walsall Community Church (Walsall Money Advice Project)", "imageURL": "", "charityWebsite": "http://www.wmap.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "51 Bradford Street", "state": "West Midlands", "country": "UK", "postcode": "WS13QD", "telephone": "+441922623292", "fax": "+441922632803", "charityNumber": "1076491", "facebook": "", "twitter": ""}{"charityLegalName": "St Michael's and All Saints Charity", "imageURL": "", "charityWebsite": "", "smallDescription": "The charity's trust maintains the property of the charity...", "longDescription": "The charity's trust maintains the property of the charity.", "addressLine1": "Cornmarket Street", "state": "Oxfordshire", "country": "UK", "postcode": "OX13EY", "telephone": "+441865240940", "fax": "", "charityNumber": "261304", "facebook": "", "twitter": ""}{"charityLegalName": "John Lyall Charity", "imageURL": "", "charityWebsite": "http://www.johnlyallcharity.org", "smallDescription": "John Lyall Charity provides education, nutrition and community projects for street children and their families in Wawa, a shanty town in the Philippines...", "longDescription": "John Lyall Charity provides education, nutrition and community projects for street children and their families in Wawa, a shanty town in the Philippines. Wawa is an extremely poor area and houses are often inhabited by three generations of the same family. Their small wooden shacks have inadequate sanitation and are regularly damaged by typhoons. Around 40% of children do not attend school as their families rely on them to scavange or earn a meagre income selling fish in the market. As a result, children are malnourished and vulnerable to illness and abuse. JLC are working to change this by providing the opportunity for adults to learn employable skills, classes for children to learn literacy and numeracy so that they can return to school, and a nutrition programme to feed children in school and educate patrents about healthy eating. We have also held child protection workshops and established a creche facility to keep children safe and off of the streets. Most importantly, we are bringing hope to Wawa for a better future. We have already seen the positive impact that JLC projects are having on children and families in Wawa, but need your support to continue to improve lives.", "addressLine1": "111 Green Street", "state": "Middlesex", "country": "UK", "postcode": "TW166QX", "telephone": "+441932782341", "fax": "", "charityNumber": "1080035", "facebook": "http://www.facebook.com/pages/John-Lyall-Charity/204516519596791", "twitter": ""}{"charityLegalName": "Health All Round", "imageURL": "", "charityWebsite": "http://www.healthallround.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Springwell House Ardmillan Terrace", "state": "", "country": "UK", "postcode": "EH112JL", "telephone": "", "fax": "", "charityNumber": "006065", "facebook": "", "twitter": ""}{"charityLegalName": "Cam Sight (the Cambridgeshire Society for the Blind & Partially Sighted)", "imageURL": "", "charityWebsite": "http://www.camsight.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "167 Green End Road", "state": "Cambridgeshire", "country": "UK", "postcode": "CB41RW", "telephone": "+441223420033", "fax": "+441223501829", "charityNumber": "201640", "facebook": "", "twitter": ""}{"charityLegalName": "Arrhythmia Alliance", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "PO Box 3697", "state": "Warwickshire", "country": "UK", "postcode": "CV378YL", "telephone": "+441789450787", "fax": "", "charityNumber": "1107496", "facebook": "", "twitter": ""}{"charityLegalName": "Sheffield Wednesday Football Club Community Programme", "imageURL": "", "charityWebsite": "http://www.swfc.co.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Hillsborough Football Stadium Leppings Lane", "state": "South Yorkshire", "country": "UK", "postcode": "S61SW", "telephone": "+441142212152", "fax": "", "charityNumber": "1108538", "facebook": "", "twitter": ""}{"charityLegalName": "Midlands Asthma and Allergy Research Association (MAARA)", "imageURL": "", "charityWebsite": "http://www.maara.org", "smallDescription": "", "longDescription": "", "addressLine1": "PO Box 1057", "state": "Leicestershire", "country": "UK", "postcode": "LE23GZ", "telephone": "+441162479888", "fax": "", "charityNumber": "257131", "facebook": "", "twitter": ""}{"charityLegalName": "Shri Vallabh Nidhi - UK", "imageURL": "", "charityWebsite": "", "smallDescription": "To advance the Hindu religion in accordance with the teaching of Shri Vallabh and in furtherance thereof to provide and maintain a temple for public religious worship and other religious charitable purpose...", "longDescription": "To advance the Hindu religion in accordance with the teaching of Shri Vallabh and in furtherance thereof to provide and maintain a temple for public religious worship and other religious charitable purposes", "addressLine1": "PO Box 700 Ealing Road", "state": "Middlesex", "country": "UK", "postcode": "HA04TA", "telephone": "+442089021742", "fax": "", "charityNumber": "277833", "facebook": "", "twitter": ""}{"charityLegalName": "Friends Of Swallowcliffe Parish Church", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "14 Tisbury Row Tisbury Salisbury", "state": "", "country": "UK", "postcode": "SP36RZ", "telephone": "+441747870959", "fax": "", "charityNumber": "273638", "facebook": "", "twitter": ""}{"charityLegalName": "Groundwork Devon and Cornwall", "imageURL": "", "charityWebsite": "http://www.groundwork-devonandcornwall.org.uk", "smallDescription": "Groundwork Southwest works toward the re-generation of urban areas which have suffered from dereliction, neglect or abandonment...", "longDescription": "Groundwork Southwest works toward the re-generation of urban areas which have suffered from dereliction, neglect or abandonment.", "addressLine1": "1st Floor Lyster Court The Millfields Stonehouse", "state": "Plymouth", "country": "UK", "postcode": "PL13JB", "telephone": "+441752217721", "fax": "+441752201680", "charityNumber": "1008537", "facebook": "", "twitter": ""}{"charityLegalName": "Royal Ballet School Endowment Fund", "imageURL": "", "charityWebsite": "http://www.royalballetschool.co.uk", "smallDescription": "The charity provides scholarships and facilities for students at the Royal Ballet School...", "longDescription": "The charity provides scholarships and facilities for students at the Royal Ballet School. See entry under the Royal Ballet School.", "addressLine1": "46 Floral Street Covent Garden", "state": "", "country": "UK", "postcode": "WC2E9DA", "telephone": "+442087486335", "fax": "+442082377109", "charityNumber": "285766", "facebook": "", "twitter": ""}{"charityLegalName": "B.l.i.z.e. All Breed Rescue", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "27 Moorland Way Poole", "state": "", "country": "UK", "postcode": "BH165JY", "telephone": "+447850661375", "fax": "", "charityNumber": "1162925", "facebook": "", "twitter": ""}{"charityLegalName": "Small Steps Foundation", "imageURL": "", "charityWebsite": "http://www.smallstepsfoundation.com", "smallDescription": "", "longDescription": "", "addressLine1": "25 Southdown Crescent Cheadle Hulme", "state": "Greater Manchester", "country": "UK", "postcode": "SK86EQ", "telephone": "+441614828802", "fax": "", "charityNumber": "1138643", "facebook": "", "twitter": ""}{"charityLegalName": "Blyth All Weather Lifeboat", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Old Tugboat Jetty High Quay Blyth", "state": "", "country": "UK", "postcode": "NE242AZ", "telephone": "", "fax": "", "charityNumber": "1124987", "facebook": "", "twitter": ""}{"charityLegalName": "CALL Plus (trading as Being There)", "imageURL": "", "charityWebsite": "http://www.beingthere.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Chafes Hague Lambert 2-4 Primrose Avenue Urmston", "state": "Greater Manchester", "country": "UK", "postcode": "M410TY", "telephone": "+448451232329", "fax": "", "charityNumber": "1016053", "facebook": "", "twitter": ""}{"charityLegalName": "Contact", "imageURL": "", "charityWebsite": "http://www.contact.org.uk", "smallDescription": "We are Contact, the charity for families with disabled children We support families with the best possible guidance and information...", "longDescription": "We are Contact, the charity for families with disabled children We support families with the best possible guidance and information. We bring families together to support each other. And we help families to campaign, volunteer and fundraise to improve life for themselves and others.", "addressLine1": "209-211 City Road", "state": "", "country": "UK", "postcode": "EC1V1JN", "telephone": "+448088083555", "fax": "", "charityNumber": "284912039169", "facebook": "https://www.facebook.com/contactfamilies", "twitter": ""}{"charityLegalName": "Hospice of the Valleys (Hosbis y Cymoedd)", "imageURL": "https://www.charitychoice.co.uk/media/profile/h/hospice-of-the-valleys-hosbis-y-cymoedd-4189/Hospice%20of%20the%20Valleys%20logo.jpg", "charityWebsite": "http://www.hospiceofthevalleys.org.uk", "smallDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer...", "longDescription": "Hospice of the Valleys cares for people in their own homes when they have been diagnosed with a life-threatening illness such as cancer. Our team of specialist Nurses, Social Workers, Welfare Rights Officers and Therapists are able to help patients and their families deal with the challenges such a diagnosis brings. Our service is free and available 24hrs a day all year for the people of Blaenau Gwent.", "addressLine1": "Festival Drive", "state": "Blaenau Gwent", "country": "UK", "postcode": "NP238XF", "telephone": "+441495717277", "fax": "+441495724188", "charityNumber": "517724", "facebook": "", "twitter": ""}{"charityLegalName": "Partially Sighted Society", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/partially-sighted-society-1520/partially-sighted-society.jpg", "charityWebsite": "https://www.partsight.org.uk/", "smallDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight...", "longDescription": "The Partially Sighted Society provides information, advice, training, magnifiers and electronic low vision aids and clear print material for anybody with a visual impairment to help them to make the best use of their remaining sight. The Partially Sighted Society has been in existence for over 50 years. Our aim is to help people with sight loss make the best use of their remaining vision. From our professionally equipped sight centre in Doncaster we provide a range of services to support anybody living with sight loss. These include: - Free Low Vision Assessments. Our professional low vision assessment has access to the latest aids and equipment to help you continue to live life independently. - Sight tests. We are a registered NHS Sight Test Centre and anyone can book an appointment with our part time Optometrist, who is as passionate about low vision as we are. We do not dispense spectacles, however, if new glasses are prescribed you can then take this to an optician of your choice. Our sight test clinic is ideal for those with learning disabilities or dementia. Our waiting area is never busy and we have supportive, caring staff. - Pss Print. Our print room offers a unique range of bold-lined stationery, exercise books, diaries and calendars. Andre, our print room manager, understands the challenges of visual impairment and is on hand to advise. We also offer a bespoke print service and free Visual Impairment Assessment Packs with samples of all our printed material. - Information and Support groups. Come and meet new people and learn new things at our variety of support and activity groups.", "addressLine1": "1 Bennetthorpe", "state": "South Yorkshire", "country": "UK", "postcode": "DN26AA", "telephone": "+441302965195", "fax": "+441302556587", "charityNumber": "254052", "facebook": "", "twitter": ""}{"charityLegalName": "Cinnamon Trust - Helping Elderly and Terminally ill People and their Pets", "imageURL": "https://www.charitychoice.co.uk/media/profile/c/cinnamon-trust-helping-elderly-people-and-pets-1075/cinnamontrust.jpg", "charityWebsite": "http://www.cinnamon.org.uk", "smallDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty...", "longDescription": "We recognise the importance of the treasured relationship between people and pets and we recognise that this relationship is, more often than not seriously threatened by infirmity and frailty. We step in to ensure that any problem encountered in the day to day care of a pet can be overcome and all the benefits of owning a pet can be preserved. Our aims are achieved by tasking a national network of over 6,000 volunteers to provide any assistance required including walking dogs and pet fostering. We operate a national register of 752 care homes/sheltered housing for the elderly that will accept pets. A principal concern for elderly and terminally ill pet owners is the long term care of beloved pets. We provide lifetime care for pets whose owners have died either in our unique home from home sanctuaries or in long term foster homes. We rely entirely on donations and legacies. We make no charge for our services. Peace of mind and practical help for people - love, care and safety for their pets.", "addressLine1": "10 Market Square", "state": "Cornwall", "country": "UK", "postcode": "TR274HE", "telephone": "+441736757900", "fax": "+441736757010", "charityNumber": "1134680", "facebook": "", "twitter": ""}{"charityLegalName": "Wythall Animal Sanctuary", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/wythall-animal-sanctuary-1258/top.jpg", "charityWebsite": "https://wythallanimalrescue.org/", "smallDescription": "Wythall Animal Sanctuary was founded by Mr...", "longDescription": "Wythall Animal Sanctuary was founded by Mr. & Mrs. E. Davies in 1968, whose aim was to save and find homes for as many unwanted pets as possible. Many thousands have been found new homes since then. Many of these animals may otherwise have been destroyed. We have a non-destruction policy and we are the last hope for these animals. As our name signifies we give them Sanctuary. We take in, when possible, animals for rehoming and some of these animals will not be fit for rehoming and will live the rest of their lives with us. We pick up all the bills, including veterinary bills, for our residents both long-term and animals for rehoming. It costs £4,000 a week to keep the Sanctuary running and we rely entirely on donations, fundraising and Wills to continue our work. Other ways you can help are by Sponsoring an Animal, Leave a gift in your Will or by becoming a 'Friend' of Wythall Animal Sanctuary.", "addressLine1": "Middle Lane Kings Norton", "state": "West Midlands", "country": "UK", "postcode": "B380DU", "telephone": "+441564823288", "fax": "", "charityNumber": "1137681", "facebook": "", "twitter": ""}{"charityLegalName": "St Kentigern Hospice and Palliative Care Centre, St Asaph, Denbighshire", "imageURL": "https://www.charitychoice.co.uk/media/profile/s/st-kentigern-hospice-and-palliative-care-centre-st-asaph-denbighshire-4300/St%20Kentigern%20logo.jpg", "charityWebsite": "http://www.stkentigernhospice.org.uk", "smallDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day...", "longDescription": "We are an 8 bed residential unit and Day Care Centre, caring for 15 patients per day. We provide a relaxed, homely and informal environment for people with a diagnosis of cancer. Other services include physiotherapy, aromatherapy, reflexology, chiropody, and much more. We make no charge to our patients or their carers. Any donations received would be greatly appreciated.", "addressLine1": "St Kentigern Hospice Upper Denbigh Road", "state": "Denbighshire", "country": "UK", "postcode": "LL170RS", "telephone": "+441745585221", "fax": "+441745585224", "charityNumber": "519931", "facebook": "", "twitter": ""}{"charityLegalName": "Psoriasis and Psoriatic Arthritis Alliance (PAPAA)", "imageURL": "https://www.charitychoice.co.uk/media/profile/p/psoriasis-and-psoriatic-arthritis-alliance-papaa-17015/top_wiki.jpg", "charityWebsite": "http://www.papaa.org", "smallDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis...", "longDescription": "PAPAA is an independent charity dedicated to providing support, help, advice, education, training and funding for research, which will provide positive outcomes for people affected by psoriasis and psoriatic arthritis.", "addressLine1": "Unit 3 Horseshoe Business Park Lye Lane Bricket Wood", "state": "Hertfordshire", "country": "UK", "postcode": "AL23TA", "telephone": "+441923672837", "fax": "+441923682606", "charityNumber": "1118192", "facebook": "", "twitter": ""}{"charityLegalName": "Walsall Society for the Blind", "imageURL": "https://www.charitychoice.co.uk/media/profile/w/walsallsocietyfortheblind/Walsall-logo.jpg", "charityWebsite": "http://www.walsallblind.org", "smallDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall...", "longDescription": "About Us Our Mission is to provide information, support and friendship to all visually impaired people in the Borough of Walsall. Walsall Society for the Blind has been a flagship for sight loss services in the Walsall Borough for over 100 years. We currently have over 1500 visually impaired individuals on our database who have already made use of our services. With a total of 22 staff, we provide a seamless package of sight loss services across the Borough. From the early intervention of the Eye Clinic Liaison Officer (ECLO) to the Community Services, we can help anyone experiencing a sight loss, whether it is temporary or permanent, newly diagnosed or long standing. We also provide information and support to their families, carers and friends. At WSB we understand how devastating sight loss can be, and we realise the consequences of living with it can be dramatic. We aim to do our best by our service users, by making our services known from the first possible point, and carrying our support and guidance through for as long as the individual needs it.", "addressLine1": "Hawley House 11 Hatherton Road", "state": "West Midlands", "country": "UK", "postcode": "WS11XS", "telephone": "+441922627683", "fax": "", "charityNumber": "1075854", "facebook": "http://www.facebook.com/pages/Walsall-Society-for-the-Blind/213993005340708", "twitter": ""}{"charityLegalName": "Oak Tree Animals' Charity", "imageURL": "https://www.charitychoice.co.uk/media/profile/o/oaktreeanimalscharity/OTAC-logoOrange-small.jpg", "charityWebsite": "https://www.oaktreeanimals.org.uk/", "smallDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle...", "longDescription": "Founded in 1909 by Francis Cox, who campaigned for better working conditions for pit ponies and other working horses, the Charity has now grown to provide a home for horses, goats, sheep and cattle. Its also a safe haven for stray, abandoned or unwanted dogs and cats who are awaiting new homes through our Adoption Programme. Every year Oak Tree takes in hundreds of lost or unwanted animals and gives them a second chance. We rehabilitate the animals, but we also prepare potential owners for life with a new companion and offer the help and support necessary for both animal and owner to live a long and happy life together. Our work in the community means that loving pet owners can find the information and resources they need to keep their animals happy, healthy and in good homes. We also support unowned animals such as feral cats through our Trap Neuter Return (TNR) programme. We use educational campaigns to raise awareness and change perceptions, hoping to provide a brighter future for animals in all walks of society. Our team speaks to schools, community groups and colleges about animal welfare and offers advice on working with animals in the future, investing in our younger generations and providing them with the knowledge they need to help animals in the long term.", "addressLine1": "Oak Tree Farm Wetheral Shields", "state": "Cumbria", "country": "UK", "postcode": "CA48JA", "telephone": "+441228560082", "fax": "+441228560985", "charityNumber": "1001169511", "facebook": "https://www.facebook.com/oaktreeanimals", "twitter": ""}{"charityLegalName": "Priscilla Bacon Lodge Palliative Care Unit", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Colman Hospital Unthank Road", "state": "Norfolk", "country": "UK", "postcode": "NR22PJ", "telephone": "+441603288981ext.4981", "fax": "+441603288988", "charityNumber": "278667", "facebook": "", "twitter": ""}{"charityLegalName": "Glamis Hall For All", "imageURL": "", "charityWebsite": "http://www.glamishall.org.uk", "smallDescription": "Who Are We? We are a group of friends who came together in 2014 to save Glamis Hall from closure...", "longDescription": "Who Are We? We are a group of friends who came together in 2014 to save Glamis Hall from closure. We became a registered charity (No. 1160317) in early 2015 to help us provide services at Glamis Hall for the community. What is Glamis Hall? Glamis Hall is a community centre on the Queensway Estate in Wellingborough, Northamptonshire. It consists of a wellbeing centre for elderly people, a large sports hall with kitchen and servery, community room and football changing rooms. Our Mission To provide a Community Hub for the residents of the Borough of Wellingborough and the surrounding areas.", "addressLine1": "Glamis Hall Day Centre Goldsmith Road Wellingborough", "state": "", "country": "UK", "postcode": "NN83RU", "telephone": "+441933677326", "fax": "", "charityNumber": "1160317", "facebook": "https://www.facebook.com/GlamisHall/", "twitter": ""}{"charityLegalName": "Care 4 All (north East Lincolnshire) Ltd", "imageURL": "", "charityWebsite": "http://www.care4all.org.uk", "smallDescription": "Care4all are a local charity providing services for older people and people with disabilities within North East Lincolnshire...", "longDescription": "Care4all are a local charity providing services for older people and people with disabilities within North East Lincolnshire. Our day opportunities are provided from four health and wellbeing centres throughout Immingham, Grimsby and Cleethorpes. Older Peoples Day Services offer a wide range of activities and social events to promote independence, encourage involvement and social interaction, and reduce isolation. The aim is to support people to live their chosen lifestyle in their own homes for as long as possible and also, if appropriate, provide respite for carers. We also operate a Meals Plus service in which hot nutritious meals are delivered to peoples homes. The service is much more than just a delivery service as our drivers are aware that they may be a persons only visitor that day and an element of care is included. This can range from helping with the meal to monitoring and reporting food and fluid intake, medication prompts and social interaction. Disability Services provide a range of activities and opportunities within both centre and local community based settings to support adults with learning and/or physical disabilities to enjoy meaningful, purposeful lives of their choice. Another service provide by Care4all is Personal Assistant Support Solutions (PASS), this is a matching service for adults with physical or learning disabilities, mental health problems or long term illness who are seeking to employ a personal assistant to support them to live independently and lead the best quality of life possible. Care4all operate a number of enterprises including a garden centre, a chain of cafes, charity shop, textile banks and specially adapted holiday chalet. Each of these unique enterprises provides real employment opportunities to local people with disabilities in a range of different roles, including horticulture and gardening, retail, catering and administration. The jobs they create improve lives through helping to enhance peoples self-esteem and confidence by being included in society. All profits made are reinvested back into the organisation to develop the business further.", "addressLine1": "Queen Street Resource Centre Queen Street Grimsby North East Lincolnshire", "state": "", "country": "UK", "postcode": "DN311QG", "telephone": "+441472571100", "fax": "", "charityNumber": "41146255", "facebook": "https://www.facebook.com/Care4allNEL", "twitter": ""}{"charityLegalName": "Avon Sport And Leisure Club For The Visually Impaired", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "7 Hamilton Road Southville", "state": "", "country": "UK", "postcode": "BS31PA", "telephone": "+441179837915", "fax": "", "charityNumber": "278199", "facebook": "", "twitter": ""}{"charityLegalName": "Faith In Action International Rally", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "40 Pennington Way London", "state": "", "country": "UK", "postcode": "SE129QB", "telephone": "+447588681256", "fax": "", "charityNumber": "1147063", "facebook": "", "twitter": ""}{"charityLegalName": "Church Without Walls (truth Ministries)", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "42 Plumbridge Street London", "state": "", "country": "UK", "postcode": "SE108PA", "telephone": "+442086915614", "fax": "", "charityNumber": "1144410", "facebook": "", "twitter": ""}{"charityLegalName": "Scarth Memorial Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "5 South Cleatlam Darlington", "state": "", "country": "UK", "postcode": "DL23QP", "telephone": "+441833660802", "fax": "", "charityNumber": "520586", "facebook": "", "twitter": ""}{"charityLegalName": "The Bouncing Ball Trust", "imageURL": "", "charityWebsite": "http://www.bouncingballtrust.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Admiral's Yard Station Road", "state": "", "country": "UK", "postcode": "BS346LR", "telephone": "+443301200720", "fax": "", "charityNumber": "1170946", "facebook": "", "twitter": ""}{"charityLegalName": "Sesaw (suffolk And Essex Small Animal Welfare)", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Idano Stoke Road Leavenheath Colchester", "state": "", "country": "UK", "postcode": "CO64PP", "telephone": "+441787210888", "fax": "", "charityNumber": "1124029", "facebook": "", "twitter": ""}{"charityLegalName": "The Burton Blind And Partially Sighted Club", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "33 The Green Barton Under Needwood Burton-on-Trent Staffordshire", "state": "", "country": "UK", "postcode": "DE138JD", "telephone": "", "fax": "", "charityNumber": "1040914", "facebook": "", "twitter": ""}{"charityLegalName": "Victoria Hall Performing Arts Association", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Treasurer Victoria Theatre 106 Wedgewood Drive Harlow", "state": "", "country": "UK", "postcode": "CM179PY", "telephone": "+447834324802", "fax": "", "charityNumber": "1051379", "facebook": "", "twitter": ""}{"charityLegalName": "Lyng & District Community Hall", "imageURL": "", "charityWebsite": "http://www.lynghallforall.uk", "smallDescription": "Lyng Hall is in need of support and funding to rebuild this essential central hub of our community...", "longDescription": "Lyng Hall is in need of support and funding to rebuild this essential central hub of our community. Our hall is more than 60 years old. The facilities it offers are in bad condition, out of date and inadequate. We need to take action NOW to avoid it's enforced closure. The demand for a new hall is high. Many elderly live in our rural village and without a Bus Service they have to rely on lifts and taxis which can be expensive. Many people are isolated with their own transport and we aim to offer elderly and families services that combat this, along with exercise programs to help keep people fit, and clubs and groups for the young people to keep them entertained.", "addressLine1": "Richmond Place Lyng Norwich Norfolk", "state": "", "country": "UK", "postcode": "NR95RF", "telephone": "+441603872238", "fax": "", "charityNumber": "1156339", "facebook": "www.facebook.com/lyngdistrictcommunityhall", "twitter": ""}{"charityLegalName": "Cambridge Crystallographic Data Centre", "imageURL": "", "charityWebsite": "", "smallDescription": "Cambridge Crystallographic Data Centre supports the science of chemistry and crystallography in all its branches by helping researchers and research programmes...", "longDescription": "Cambridge Crystallographic Data Centre supports the science of chemistry and crystallography in all its branches by helping researchers and research programmes.", "addressLine1": "12 Union Road", "state": "Cambridgeshire", "country": "UK", "postcode": "CB21EZ", "telephone": "+441223336408", "fax": "", "charityNumber": "800579", "facebook": "", "twitter": ""}{"charityLegalName": "Warslow Village Hall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "", "state": "", "country": "UK", "postcode": "", "telephone": "", "fax": "", "charityNumber": "216771", "facebook": "", "twitter": ""}{"charityLegalName": "1st Allerton Boy Scout Group", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "218 Brodie Avenue Liverpool", "state": "", "country": "UK", "postcode": "L197NG", "telephone": "+441514942663", "fax": "", "charityNumber": "1521582", "facebook": "", "twitter": ""}{"charityLegalName": "Born To Shine Challenge Ltd", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Bethel House Lansdowne Place London", "state": "", "country": "UK", "postcode": "SE14XH", "telephone": "+442074079996", "fax": "", "charityNumber": "1142350", "facebook": "", "twitter": ""}{"charityLegalName": "Success For All Foundation", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Studio 8 Stuart House St Johns Street", "state": "Cambridgeshire", "country": "UK", "postcode": "PE15DD", "telephone": "+441733490222", "fax": "", "charityNumber": "1077079", "facebook": "", "twitter": ""}{"charityLegalName": "The Queen's Hall", "imageURL": "", "charityWebsite": "http://www.thequeenshall.net", "smallDescription": "", "longDescription": "", "addressLine1": "Clerk Street", "state": "", "country": "UK", "postcode": "EH89JG", "telephone": "+441316683456", "fax": "+441316682656", "charityNumber": "012294", "facebook": "", "twitter": ""}{"charityLegalName": "Hallam Diocesan Caring Services (Hallam Diocese)", "imageURL": "", "charityWebsite": "", "smallDescription": "Hallam Diocese works to promote the Roman Catholic religion in the local area...", "longDescription": "Hallam Diocese works to promote the Roman Catholic religion in the local area.", "addressLine1": "St Wilfrid's Centre 524 Queens Road", "state": "South Yorkshire", "country": "UK", "postcode": "S24DT", "telephone": "+441142580000", "fax": "+441142580000", "charityNumber": "512021", "facebook": "", "twitter": ""}{"charityLegalName": "Water Fall", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "Green Pastures 11 Blackthorn Lane Leicester", "state": "", "country": "UK", "postcode": "LE24FA", "telephone": "+441162985518", "fax": "", "charityNumber": "1140634", "facebook": "", "twitter": ""}{"charityLegalName": "Faith In Action International Rally", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "40 Pennington Way London", "state": "", "country": "UK", "postcode": "SE129QB", "telephone": "+447588681256", "fax": "", "charityNumber": "1147063", "facebook": "", "twitter": ""}{"charityLegalName": "Tech4All", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "70 Bedford Gardens", "state": "", "country": "UK", "postcode": "W87EH", "telephone": "+442078881328", "fax": "", "charityNumber": "41054041", "facebook": "", "twitter": ""}{"charityLegalName": "The Sowton Village Hall", "imageURL": "", "charityWebsite": "http://www.sowtonvillage.com", "smallDescription": "Fund raising for the maintenance and improvement of Sowton Village Hall...", "longDescription": "Fund raising for the maintenance and improvement of Sowton Village Hall. Organising social events in the hall. Letting out the hall to individuals or groups. Acting as a focus for the residents in the area of benefit", "addressLine1": "Willow Cottage 14 Sowton Village Sowton", "state": "Devon", "country": "UK", "postcode": "EX52AD", "telephone": "+441392367956", "fax": "", "charityNumber": "300975", "facebook": "", "twitter": ""}{"charityLegalName": "Bungoma Calling", "imageURL": "", "charityWebsite": "http://www.bungomacalling.co.uk", "smallDescription": "Bungoma Calling is a UK charity working with Christian churches in Bungoma, Western Kenya...", "longDescription": "Bungoma Calling is a UK charity working with Christian churches in Bungoma, Western Kenya. It is also linked with the St Dorcas Orphanage where in 2015 thirty (30) children of 5 years old and upwards live. They all go to school and the charity is trying to ensure they all have a quality education up to and including secondary school by a sponsorship programme to pay their school fees. Several primary schools in the York area are linked with schools in Bungoma. Each year a team go out to visit and work with the orphanage, the link schools and the churches.", "addressLine1": "Orchard House Ingleby Arncliffe", "state": "North Yorkshire", "country": "UK", "postcode": "DL63LN", "telephone": "+441609882937", "fax": "", "charityNumber": "1137121", "facebook": "https://www.facebook.com/pages/Bungoma-Calling/268280119905085", "twitter": ""}{"charityLegalName": "BEN - The Automotive Industry Charity", "imageURL": "", "charityWebsite": "http://ben.org.uk", "smallDescription": "", "longDescription": "", "addressLine1": "Lynwood Court Lynwood Village Rise Road", "state": "Windsor & Maidenhead", "country": "UK", "postcode": "SL50FG", "telephone": "+441344298100", "fax": "+441344298109", "charityNumber": "297877039842", "facebook": "", "twitter": ""}{"charityLegalName": "Wallasey Islamic Cultural Centre", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "22 Brook Close", "state": "Merseyside", "country": "UK", "postcode": "CH441DU", "telephone": "+441512010357", "fax": "", "charityNumber": "1144643", "facebook": "", "twitter": ""}{"charityLegalName": "PCC of All Saints Onslow Village Guildford", "imageURL": "", "charityWebsite": "http://www.allsaintschurchgfd.org.uk/welcome.htm", "smallDescription": "ALL SAINTS' CHURCH We are a friendly, open and welcoming church, meeting in the centre of the community...", "longDescription": "ALL SAINTS' CHURCH We are a friendly, open and welcoming church, meeting in the centre of the community. Whether you are looking to join the church family on a regular basis, or are enquiring about becoming part of the church for a special event, such as a wedding or a baptism, just contact us via the website or telephone, or turn up for a service. Each week, children and adults of all ages gather for worship at three different times on a Sunday and on weekdays. Newcomers are always welcome and we hope that you will find a spiritual home here - all are truly welcome. At the moment we are fundraising with two of our congregation abseiling from Guildford Cathedral Tower on 21st June. Please donate generously via our church website page, or by using the 'donate now' button on this page. Thank you for your support.", "addressLine1": "53 Agraria Road", "state": "Surrey", "country": "UK", "postcode": "GU24LF", "telephone": "+441483822982", "fax": "", "charityNumber": "72292", "facebook": "https://www.facebook.com/allsaintschurchgfd", "twitter": ""}{"charityLegalName": "Dysfunction Gallery", "imageURL": "", "charityWebsite": "http://www.dysfunction.eu/home/4589015301", "smallDescription": "", "longDescription": "", "addressLine1": "10 Todshill Street Strathaven South Lanarkshire", "state": "", "country": "UK", "postcode": "ML106DD", "telephone": "+441357238943", "fax": "", "charityNumber": "046829", "facebook": "", "twitter": ""}{"charityLegalName": "The Totally Different Playscheme", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "79 Harford Drive", "state": "Hertfordshire", "country": "UK", "postcode": "WD173DQ", "telephone": "+441923244196", "fax": "", "charityNumber": "1110386", "facebook": "", "twitter": ""}{"charityLegalName": "National Gallery", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "National Gallery Trafalgar Square", "state": "", "country": "UK", "postcode": "WC2N5DN", "telephone": "+442077475875", "fax": "+442077475878", "charityNumber": "", "facebook": "", "twitter": ""}{"charityLegalName": "Cornwall Community Accountancy Service", "imageURL": "", "charityWebsite": "", "smallDescription": "", "longDescription": "", "addressLine1": "8 Greenacres Nanstallon Bodmin Cornwall", "state": "", "country": "UK", "postcode": "PL305LZ", "telephone": "+447867524663", "fax": "", "charityNumber": "1147929", "facebook": "", "twitter": ""}{"charityLegalName": "Active4All", "imageURL": "", "charityWebsite": "http://www.active4all.info", "smallDescription": "", "longDescription": "", "addressLine1": "10 Holmwood Avenue Uddingston", "state": "", "country": "UK", "postcode": "G717AJ", "telephone": "+441698815400", "fax": "+441698580482", "charityNumber": "4036591", "facebook": "", "twitter": ""}